{
  "metadata": {
    "source_document": "DIT098.md",
    "course_code": "DIT098",
    "course_title": "Gameplay Design",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "3 Nov 2025 - 18 Jan 2026",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86109"
  },
  "sections": {
    "About": "The Gameplay design course will focus on how the rules and game components can be used to create game environments that encourage and advocate specific interaction, either between people or between people and the game system. The goal of these environments can vary from experimental environments in the automotive or aerospace industry, learning environments in simulations for pure entertainment environments on home computers or game consoles. The course covers general design methods that can be applied in all these areas.\n\nThe course aims to provide an understanding of how all the components in a game environment interact with each other as well as the relations gameplay design have to other areas necessary for contemporary interactive simulations, such as programming and graphical design. Key issues addressed in the course is how to motivate users to some specific interaction, the relationship between interaction and narrative, how to balance the interaction in multi-user environments, how to support and encourage the creativity of the user, how to modify the design solutions to suit both new and experienced users as well as how to change design solutions to suit the interaction sessions with time constraints.",
    "Entry requirements": "To be eligible for the course the student must have a Bachelor's degree, 180credits or have passed 60 credits in the subject Computer Science.\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)",
    "Additional information": "Last modified: 20 February 2025"
  }
}