{
  "metadata": {
    "source_document": "DIT096.md",
    "course_code": "DIT096",
    "course_title": "Human-Computer Interaction",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "iteration": "Spring 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "20 Jan 2025 - 23 Mar 2025",
    "application_period": "16 Sep 2024 - 15 Oct 2024",
    "application_code": "GU-86043"
  },
  "sections": {
    "About": "Human Computer Interaction (HCI) is a field which deals with the design, evaluation and implementation of interactive systems and studying phenomena around them. The aim of the course is to allow students to experience the most important phases of user-centered design:\n\n- understanding context of use,\n- charting requirements,\n- generating multiple design solutions and\n- evaluating prototypes with users.\n\nThe course consists of both theoretical and practical parts, and students learn about the different steps in the design process and relevant methods for designing for users. The course covers a broad area of designing interactive systems, which includes different types of interfaces and interaction modalities. The course prepares students to collaborate in an interdisciplinary environment with specialists in design and cognitive science.",
    "Entry requirements": "To be eligible for this course, the student must have successfully completed 7.5 hec in programming (e.g., DIT009 Fundamentals of programming or DIT044 Object-oriented programming, or equivalent)\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 165 credits.",
    "Tuition": "Full education cost: 19 253 SEK\n\nFirst payment: 19 253 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)",
    "Additional information": "Last modified 18 February 2025"
  }
}