{
  "metadata": {
    "source_document": "DIT173.md",
    "course_code": "DIT173",
    "course_title": "Dependable Real-Time Systems",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "iteration": "Spring 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "24 Mar 2025 - 8 Jun 2025",
    "application_period": "16 Sep 2024 - 15 Oct 2024",
    "application_code": "GU-86075"
  },
  "sections": {
    "About": "This course is intended to give a deeper understanding of the problems involved in designing dependable real-time systems based on multiprocessor architectures. Specifically, the course covers the following topics:\n\n- Background: motivation for; and definition of; real-time computing systems.\n- Characteristics of real-time systems: application constraints; design methods; task models; run-time mechanisms; architectures.\n- Evaluation of real-time systems: performance measures; evaluation methodologies.\n- Single and multiprocessor scheduling: problem definition; terminology; and algorithms.\n- Complexity theory and NP-completeness in the context of real-time scheduling.\n- Real-time communications: protocols and end-to-end delay guarantees.\n- Fault-tolerance techniques for real-time systems: models; algorithms and architectures.",
    "Entry requirements": "To be eligible for the course students should have successfully completed courses corresponding to 120 higher education credits within the subject Computer Science or equivalent. In addition, a pass grade in the preparatory course DIT162 Real-Time systems, 7.5 credits, is required. Applicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 19 253 SEK\n\nFirst payment: 19 253 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\nMore information about tuition fees",
    "Additional information": "Last modified: 15 January 2025"
  }
}