{
  "metadata": {
    "source_document": "DIT104.md",
    "course_code": "DIT104",
    "course_title": "Interaction design methodology",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "1 Sep 2025 - 2 Nov 2025",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86139"
  },
  "sections": {
    "About": "This course introduces the basic design methodology in interaction design. The course consists of several smaller exercises, a group project, and an individual examination.\n\nTheory is combined with practical training to give students practice in working systematically with the design of computational things and systems. Training in specific design methods is provided through exercises and the group project while meta methods such as iterative design and user centered design are aspects of the home exam.",
    "Entry requirements": "To be eligible for the course the student must have succesfully completed a bachelor thesis course, e.g. DIT561. In addition, the student must have succesfully completed a 7,5 credit course in Human-computer interaction, e.g. DIT095 or TIG091.\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 17 753 SEK\nFirst payment: 17 753 SEK\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)\nApplication closed, late application opens 15 July 2025.",
    "Additional information": "Last modified: 21 February 2025"
  }
}