{
  "metadata": {
    "source_document": "DIT224.md",
    "course_code": "DIT224",
    "course_title": "Computer Graphics",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "3 Nov 2025 - 18 Jan 2026",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86096"
  },
  "sections": {
    "About": "The course aims to provide broad knowledge about algorithms for three dimensional computer graphics and also gives the student experience in implementing basic 3Dgraphic techniques.\n\nThe course provides knowledge of the principles used to create images through computer algorithms. The primary focus is on real-time rendering and photo realistic rendering.\n\nThe first part of the course covers real-time rendering, where techniques and data structures for e.g. illumination, special effects, shadows and reflections will be studied.\n\nDesign of graphics hardware and speedup algorithms will also be treated.\n\nThe second part focus on generating photo-realistic images and includes the studying of algorithms for ray tracing and global illumination.\n\nOverall, the course provides explanations and some capabilities to, on a basic level, apply corresponding mathematics, e.g., object and camera transformations, light/material interaction, and intersection tests. For this, linear algebra is used.\n\nThe course contains some programming tutorials, giving the students practical skills concerning programming for 3D-graphics.",
    "Entry requirements": "To be eligible for the course, students should have successfully completed courses corresponding to 90 credits within the subject of Computer Science, including the following courses:\n\n- 7.5 credits in data structures (DIT960 or equivalent), and\n\n- 15 credits in imperative or object-oriented programing (DIT012 and DIT952, orequivalent).\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\n**No fees** are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)\n\nApplication closed, late application opens 15 July 2025.",
    "Additional information": "20 February 2025"
  }
}