{
  "metadata": {
    "source_document": "DIT382.md",
    "course_code": "DIT382",
    "course_title": "Algorithms for Machine Learning and Inference",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "iteration": "Spring 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "20 Jan 2025 - 23 Mar 2025",
    "application_period": "16 Sep 2024 - 15 Oct 2024",
    "application_code": "GU-86011"
  },
  "sections": {
    "About": "This course will discuss the theory and application of algorithms for machine learning and inference, from an AI perspective. In this context, we consider as learning to draw conclusions from given data or experience which results in some model that generalises these data. Inference is to compute the desired answers or actions based on the model.\n\nAlgorithms of this kind are commonly used in for example classification tasks (e.g., character recognition, or to predict if a new customer is creditworthy) and in expert systems (e.g., for medical diagnosis). A new and commercially important area of application is data mining, where the algorithms are used to automatically detect interesting information and relations in large commercial or scientific databases.\n\nThe course intends to give a good understanding of this crossdisciplinary area, with a sufficient depth to use and evaluate the available methods, and to understand the scientific literature. During the course we may discuss potential problems with machine learning methods, for example, bias in training data and safety of autonomous agents.\n\nThe following concepts are covered:\n\n- Bayesian learning: likelihood, prior, posterior.\n\n- Supervised learning: Bayes classifier, Logistic Regression, Deep Learning (Standard and CNN), Support Vector Machines, regression models, K-nn models.\n- Unsupervised learning: Clustering algorithms, EM algorithm, Mixture models,\n\n- Kernel methods,\n\n- Temporal machine learning models (for example RNN)",
    "Entry requirements": "To be eligible to the course, the student should have a bachelor degree.\n\nIn particular, the student must have acquired the following knowledge:\n\n- 7\\.5 credits of programming (e.g., DIT440 Introduction to Functional Programming, DIT042 Object-Oriented Programming, DIT012 Imperative Programming with Basic Object-Orientation, or equivalent)\n\n- 7\\.5 credits of data structures (e.g., DIT961 Data Structures, DIT181 Data Structures and Algorithms, or equivalent)\n\n- 7\\.5 credits of basic probability and statistics (e.g., MSG810 Mathematical Statistics and Discrete Mathematics, DIT861 Statistical Methods for Data Science, or equivalent) - 7.5 credits of linear algebra (e.g., MMGD20 Linear Algebra, or equivalent)\n\n- 7\\.5 credits of multivariate calculus.\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 19 253 SEK\n\nFirst payment: 19 253 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)",
    "Additional information": "Last modified 20 September 2024"
  }
}