{
  "metadata": {
    "source_document": "DIT414.md",
    "course_code": "DIT414",
    "course_title": "Design and construction of digital games",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "iteration": "Spring 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "20 Jan 2025 - 23 Mar 2025",
    "application_period": "16 Sep 2024 - 15 Oct 2024",
    "application_code": "GU-86047"
  },
  "sections": {
    "About": "This course is divided into three successive parts. These parts cover design, construction and evaluation of games. The largest part will be given to game development in Unity or Unreal.\n\nThe first part is about the topic of game design. It will cover requirements gathering and specification: what do you want a game to do; for whom are you designing a game; and what does success look like? Students on this course will develop the design documentation for their own game as a deliverable for the first part.\n\nThe second part will take that design documentation and turn it into an prototype using Unreal or Unity. A playable demo of a game design is produced here.\n\nThe third part takes the prototype created in the previous part and focuses on playtesting. This will include ensuring accessibility for an audience that includes disabled gamers. Together those are the deliverable for the final part of the course.\n\nEach part will also introduce theoretical concepts through lectures, academic papers, books, and professional literature.",
    "Entry requirements": "Students taking this course are expected to have experience in software development, equivalent to having completed a course of at least five credits in an imperative programming language such as Java, C# or Python.\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 165 credits.",
    "Tuition": "Full education cost: 19 253 SEK\n\nFirst payment: 19 253 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)",
    "Additional information": "Last modified\n\n20 September 2024"
  }
}