{
  "metadata": {
    "source_document": "DIT572.md",
    "course_code": "DIT572",
    "course_title": "Game Engine Architecture",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "iteration": "Spring 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "20 Jan 2025 - 23 Mar 2025",
    "application_period": "16 Sep 2024 - 15 Oct 2024",
    "application_code": "GU-86045"
  },
  "sections": {
    "About": "The design and implementation of the fundamental components of a game engine is the core of the Game Engine Architecture course. The course focuses mainly upon 2-dimensional games although other types of game engines are discussed, and students wishing to explore 3D game engines can do so as part of the assignment. During the course we will develop an example game engine which includes several of the key aspects of professional game engine systems.\n\nThe course will cover timing regulation, game object architecture, collision action, collision responses, and some simple physics. It will also discuss relevant design decisions and design patterns. It is not expected during this course that you will develop a feasible competitor for what is on the market. Rather, the process of building a game engine is intended to be illuminating when developing games in more robust engines.",
    "Entry requirements": "To be eligible for this course, students must have either:\n\n- successfully completed the course Computer Graphics, 7.5 credits, or equivalent, or\n\n- have 15 credits of programming experience, of which 7.5 of those credits should be in an object-oriented context.\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 19 253 SEK\n\nFirst payment: 19 253 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)",
    "Additional information": "Last modified\n\n23 September 2024"
  }
}