{
  "metadata": {
    "source_document": "DIT983.md",
    "course_code": "DIT983",
    "course_title": "Domain Specific Languages of Mathematics",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "iteration": "Spring 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "20 Jan 2025 - 23 Mar 2025",
    "application_period": "16 Sep 2024 - 15 Oct 2024",
    "application_code": "GU-86020"
  },
  "sections": {
    "About": "The course will present classical mathematical topics from a computing science perspective: giving specifications of the concepts introduced, paying attention to syntax and types, and ultimately constructing DSLs of some mathematical areas mentioned below.\n\nThe lecture topics are:\n\n- Introduction to functional programming and calculational proofs\n\n- Introduction to Domain Specific Languages (DSLs): case study linear algebra\n\n- DSLs and mathematics: case study category theory\n\n- Real analysis: mean value theorems, Taylor formulas\n- Real analysis: a DSL for power series\n\n- More linear algebra: eigenvalues and optimization",
    "Entry requirements": "The student should have successfully completed:\n\n- 7.5 hec in discrete mathematics, for example DIT980 Introductory Discrete Mathematics for Computer Scientists\n\n- 15 hec in mathematics, for example MMGD20 Linear Algebra D and MMGD30 Calculus D\n\n- 15 hec in computer science, for example DIT440 Introduction to Functional Programming or MVG300 Programming with Matlab and DIT012 Imperative Programming with Basic Object-orientation\n\nAdditional 22.5 hec of any mathematics or computer science courses.",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 165 credits.",
    "Tuition": "Full education cost: 19 253 SEK\n\nFirst payment: 19 253 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)",
    "Additional information": "Last modified\n\n29 August 2024"
  }
}