{
  "metadata": {
    "source_document": "MMA350.md",
    "course_code": "MMA350",
    "course_title": "Algebraic Number Theory",
    "department": "Department of Mathematical Sciences",
    "credits": "7.5",
    "iteration": "Spring 2026",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "19 Jan 2026 - 22 Mar 2026",
    "application_period": "15 Sep 2025 - 15 Oct 2025",
    "application_code": "GU-17004"
  },
  "sections": {
    "About": "Algebraic number theory is the part of number theory that uses methods from algebra to answer questions about integers in general and number fields in particular. The subject has inspired the Langlands Program, which won the Abel Prize, and is fundamental to parts of algebraic geometry. An important concept is algebraic integers, which concern the relationship between ordinary integers and rational numbers. But in most number fields, unique factorization of integers as a product of primes does not work.\n\nIn this course you will study algebraic integers and fractional ideals which work as “ideal numbers” in number fields. You will also learn how different factorization of ideals and integers can be.",
    "Entry requirements": "General entry requirements and the equivalent of 90credits in mathematics and basic Galois theory equivalent to parts of the course MMA310 Galois Theory. In Galois theory, the requirements are: knowledge of separable field extensions, the fundamental theorem of Galois theory, the existence of the algebraic extension of the rational numbers, and the embedding of number fields therein.",
    "Selection": "All eligible applicants who have applied before the deadline will be granted a place.",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)",
    "Additional information": "Last modified 15 January 2025"
  }
}