{
  "metadata": {
    "source_document": "DIT094.pdf",
    "course_code": "DIT094",
    "course_title": "Mini Project: Team Programming",
    "swedish_title": "Miniprojekt: Team-programmering",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "First Cycle",
    "main_field_of_study": "Software Engineering",
    "specialization": "G1F, First cycle, has less than 60 credits in first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2020-10-29",
    "valid_from_date": "2021-08-30",
    "programmes": [
      "Software Engineering and Management Bachelor's Programme (N1SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2020-10-29 to be valid from 2021-08-30, autumn semester of 2021.",
    "Position in the educational system": "The course is a compulsory course in the Software Engineering and Management\nBachelor's Programme.\nThe course can be part of the following programme: 1) Software Engineering and\nManagement Bachelor's Programme (N1SOF)",
    "Entry requirements": "To be eligible for this course, students must have completed 7,5 hec in object oriented\nprogramming (for example DIT042 Object-Oriented Programming, 7.5 hec).\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• relate software development to project management activities such as project\nplanning, cost estimation, and risk management,\n• explain different methods and techniques within the project management area,\n• describe concept and terminology within the project management area,\n• explain the impact of human factors and team dynamics on project efficiency and\nsuccess,\n• analyze a programming problem, describe the problem and its design solution in an\nabstract way,\nCompetence and skills\n• plan and execute a project using different techniques for time management, risk\nmanagement, cost estimations, project budgeting as well as project monitoring,\n• define criteria for project reviews,\n• identify and manage the risks involved in a project,\n• resolve conflicts and negotiate successfully with project members,\n• design and implement an object oriented solution from a problem description,\n• perform a stakeholder analysis for a project,\nJudgement and approach\n• work in a project team, divide a project in tasks and dividing tasks among team\nmembers,\n• take individual responsibility within a project team,\n• communicate and interact professionally within a project team, and\n• communicate results of the project to interested parties in professional ways.",
    "Course content": "The course introduces the students the theories, concepts and practices of project\nmanagement and software development projects. The course focuses on project\nmanagement, the process of creating software, the skill of programming and working\ntogether as a team towards a common goal.\nThe purpose of this course is to give the students an introduction to the project\nmanagement area and the tools and techniques used to manage software development\nprojects. The course introduces the students to the human element and discusses people,\npersonalities and dynamics and the way in which they have an impact on IT projects.\nAreas such as cost estimation, risk management, and project evaluation are also\ndiscussed.\nStudents work in a project to create a software prototype and relevant documentation\nfrom a conceptual idea and specification. The project enables the students to practice\nand develop their skills within project management and to collaborate, communicate\nand take responsibility. The project requires the student to organize their work\nefficiently.",
    "Sub-courses": "1. Project (Projekt), 7.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The teaching consists of lectures, workshops, and a project, as well as supervision in\nconnection to the project.\nLanguage of instruction: English",
    "Assessment": "The course is examined through a review of the artifacts the students produced for their\nprojects, an oral presentation, a written group report, and individual contributions to\nthe group work. The project is carried out in groups of students.\nIn case a student fully participated in the project work, but failed the project in a few\nelements, one individual re-examination is provided. In case the student did not\ncontribute to the project work, or failed the re-examination, the student has to join a\nnew project group.\nIf a student, who has failed the same examined element on two occasions, wishes to\nchange examiner before the next examination session, such a request is to be submitted\nto the department in writing and granted unless there are special reasons to the contrary\n(Chapter 6, Section 22 of Higher Education Ordinance).\nIn the event that a course has ceased or undergone major changes, students are to be\nguaranteed at least three examination sessions (including the ordinary examination\nsession) over a period of at least one year, though at most two years after the course has\nceased/been changed. The same applies to work experience and VFU, although this is\nrestricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nThe grading scale comprises Fail (U), 3, 4 or 5. To pass the course, all mandatory\ncomponents must be passed. To earn a higher grade than Pass, a higher weighted\naverage from the grades of the components is required.",
    "Course evaluation": "The course is evaluated through a meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "Course literature to be announced 8 weeks prior to the start of the course."
  }
}