{
  "metadata": {
    "source_document": "DIT103.pdf",
    "course_code": "DIT103",
    "course_title": "Language-Based Security",
    "swedish_title": "Språkbaserad datasäkerhet",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": 7.5,
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science, Software Engineering",
    "specialization": "A1F",
    "language_of_instruction": "English",
    "confirmation_date": "2012-11-12",
    "valid_from_date": "2014-03-17",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Software Engineering Master's Programme (N2SOM)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2012-11-12 to be valid from 2014-03-17.",
    "Position in the educational system": "The course is a part of the Computer Science Master's Programme and a single-subject course at the University of Gothenburg. The course is also offered as an elective course in the Software Engineering Master's programme.\nThe course can be part of the following programmes: 1) Computer Science, Master's Programme (N2COS) and 2) Software Engineering Master's Programme (N2SOM)",
    "Entry requirements": "The requirements for the course is to have successfully completed two year studies within the subject Computer Science or equivalent.\nEnglish B level or English proficiency equivalent to IELTS 6.5 no part under 5.5 or TOEFL 575 p, TWE score 4.5 is also required.",
    "Learning outcomes": "After the course the student should be able to\n5.1. Knowledge and understanding.\n•\napply practical knowledge of security for modern programming languages.\n• demonstrate the critical knowledge of principles behind application-level attacks (such as Trojan horses, worms, buffer overrun attacks, web application attacks, covert channels, and malicious code)\n• define language-based protection mechanisms (such as static security analysis, program transformation, and stack inspection).\n5.2. Skills and abilities.\n• demonstrate the ability to identify application- and language-level security threats\n•\nspecify and argue for application- and language-level security policies\n•\n• design and claim the security, clarity, usability, and efficiency of solutions\nimplement such solutions in expressive programming languages.\n5.3. Judgement and approach.\n• develop judgement that will allow the student to apply their knowledge in new environments.",
    "Course content": "This course combines practical and cutting-edge research material. For the latter part, the course's particular emphasis is on the use of formal, or semantic, models of program behaviour for specifying and enforcing security properties. The course consists of lectures, group meetings and project presentations.",
    "Sub-courses": "",
    "Form of teaching": "Language of instruction: English",
    "Assessment": "The course is examined by 3 laborations (U/G), carried out individual or in group, and an individual written report (U/G/VG), which is also presented orally.\nA student who failed a same examination twice has the right to request of the department a change of examiner. The request is to be in writing and submitted as soon as possible. The department is to grant such a request without undue delay.\nIn cases where a course has been discontinued or major changes have been made a student should be guaranteed at least three examination occasions (including the ordinary examination occasion) during a time of at least one year from the last time the course was given",
    "Grades": "The grading scale comprises: Fail (U), Pass (G), Pass with Distinction (VG).\nTo Pass the course, students must Pass the labs and the project. In order to Pass the project part, students need to make a presentation of the project in class and Pass the requirements on a written report that documents the project. To Pass with Distinction, student must pass the labs and get the grade Pass with Distintion on the project part. In order to Pass with Distinction on the project part, the project must be significantly more substantial than average.\nRegarding the application of ECTS scales, please see Vice-Chancellors decision 2007-05- 28, dnr G 8 1976/07.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between teachers and student representatives. Further, an anonymous questionnaire can be used to ensure written information. The outcome of the evaluations serves to improve the course by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "Knowledge of the material covered in the courses DIT230 Programming languages and DIT641 Computer Security is recommended although not required as a prerequisite.\nThe course replaces the DIT101 Langage-Based Security course. The course cannot be included in a degree which contains DIT101. Neither can the course be included in a degree which is based on another degree in which the course DIT101 is included.\nThe syllabus correspond to the syllabus of the Language-Based Security course at Chalmers."
  }
}