{
  "metadata": {
    "source_document": "DIT291.pdf",
    "course_code": "DIT291",
    "course_title": "Architectures for Scale-out Systems",
    "swedish_title": "Arkitekturer för horisontellt skalande system",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science-Networks and Distributed Systems, Software Engineering",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2020-10-27",
    "valid_from_date": "2022-01-17",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2020-10-27 and was last revised on 2020-10-27 to be valid from 2022-01-\n17, spring semester of 2022.",
    "Position in the educational system": "The course is part of the Software Engineering and Management Master's Programme.\nThe course is also a single subject course at the University of Gothenburg.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS) and 2) Software Engineering and Management Master's\nProgramme (N2SOF)",
    "Entry requirements": "Sucessfully completed courses in programming, with the minimum of:\n• 7.5 credits successfully completed courses in programming\n• 7.5 credits successfully completed courses in object-oriented design\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• describe and distinguish common architectural styles and patterns for building large\nscale-out systems, particularly those that are operated on the Web\n• describe the state of practice at industry leaders, such as Google or Microsoft,\nrelated to designing, deploying, and operating scale-out systems\nCompetence and skills\n•\n• employ monitoring solutions to identify faults and performance degradations in\nscale-out systems\n• automate deployments to recover from faults or roll out new system versions\nwithout direct human involvement\n• make use of feature flags, Blue/Green deployments, and canary releases as basis of\ndata-driven rollouts\n• design and execute A/B tests and chaos engineering experiments\ncompose common building blocks of scalable Web architectures, including cloud\nservices, (reverse) proxies, content delivery networks, and load balancers, to\nimprove non-functional properties of scale-out systems\n• plan and execute data-driven rollouts, and assess the outcome of such rollouts in a\nstatistically sound manner\nJudgement and approach\n• review and discuss current research contributions in the field of scale-out systems\nengineering\n• assess and improve the architecture of scale-out systems with regards to\nperformance and resilience",
    "Course content": "In this course, students learn the key concepts, architectural building blocks,\napproaches, and concrete tools that technology leaders, such as Microsoft or Google,\nuse to design, deploy, and operate large scale-out Web-based applications. We discuss,\nevaluate, and experiment with basic architectural building blocks of scale-out systems,\nenabling technologies and concepts (e.g., cloud computing and deployment\nautomation), advanced resilience engineering techniques (e.g., canary releases and chaos\nengineering), and current research results in the area of scale-out systems. Underlying\nthemes of the course will be a focus on infrastructure automation and data-driven\ndecision-making as the foundations of scale-out systems.",
    "Sub-courses": "1. Written hall examination (Skriftlig salstentamen), 3 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Assignments (Inlämningsuppgifter), 4.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The teaching consists of lectures, discussion workshops, exercises (both in-class and at\nhome), and examination parts. Additional learning support is provided through\nmandatory and optional reading.\nLanguage of instruction: English",
    "Assessment": "The course is examined by an individual written exam carried out in an examination hall\nand written assignments normally carried out in groups. The assignments part is\nexamined on the basis of individual contribution. Students are required to complete\nwritten self- and peer-assessment forms during the course which will be part of the\nassessment of the student's individual contribution to the assignments. Students who\nhave not contributed sufficiently to the assignments will be asked to complete an\nindividual task in order to receive a passing grade.\nA student who has taken two exams in a course or part of a course without obtaining a\npass grade is entitled to the nomination of another examiner. The student needs to\ncontact the department for a new examiner, preferably in writing, and this should be\napproved by the department unless there are special reasons to the contrary (Chapter 6\nSection 22 of the Higher Education Ordinance).\nIf a student has received a recommendation from the University of Gothenburg for\nspecial educational support, where it is compatible with the learning outcomes of the\ncourse and provided that no unreasonable resources are required, the examiner may\ndecide to allow the student to sit an adjusted exam or alternative form of assessment.\nIn the event that a course has ceased or undergone major changes, students are to be\nguaranteed at least three examination sessions (including the ordinary examination\nsession) over a period of at least one year, but no more than two years, after the course\nhas ceased/been changed. The same applies to placements and professional placements\n(VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nTo pass the course, all mandatory components must be passed. To earn a higher grade\nthan Pass, a higher weighted average from the grades of the components is required.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nAs an advanced course, it is expected that students have strong prior knowledge in\ncomputer programming, and at least basic knowledge of Web development (backend\ndevelopment, HTTP, REST) as well as distributed systems."
  }
}