{
  "metadata": {
    "source_document": "DIT461.pdf",
    "course_code": "DIT461",
    "course_title": "Game Development Project",
    "swedish_title": "Spelutvecklingsprojekt",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design",
    "specialization": "A1F, Second cycle, has second-cycle\ncourse/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2022-11-23",
    "valid_from_date": "2023-08-28",
    "programmes": [
      "Game Design & Technology Master's Programme (N2GDT)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2022-11-23 to be valid from 2023-08-28, autumn semester of 2023.",
    "Position in the educational system": "The course is compulsory within the Game Design & Technology Master's Programme.\nThe course can be part of the following programme: 1) Game Design & Technology\nMaster's Programme (N2GDT)\nMain field of studies\nInteraction Design\nSpecialization\nA1F, Second cycle, has second-cycle\ncourse/s as entry requirements",
    "Entry requirements": "To be eligible for this course, students must have completed one or more of the\nfollowing courses or equivalent:\n• Introduction to Game Research, or\n• Gameplay Design, or\n• Game Engine Architecture, or\n• Prototyping in Interaction Design, or\n• Interaction design methodology, or\n• Graphical Interfaces\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student should be able to:\nKnowledge and understanding\n• List best practice methodologies for development of computer games and game\nengines\n• Name standard concepts and terms for describing games, game engines, and game\ndevelopment projects\nCompetence and skills\n• Apply user evaluation methods in practical projects\n• Apply design & development methods systematically to create and critically\ncompare different possibilities in game development projects\n• Identify needs and requirements of specific intended user groups and stakeholders\nJudgement and approach\n• Motivate design choices in an game development process\n• Conduct an informed analysis of what ethical and societal effects technical\nsolutions can create in a game develop process",
    "Course content": "The game development project permits students an opportunity to develop a game of\ntheir choice and design. Each time the course runs a theme will be provided, and\nstudents will work together in groups to implement and deploy a game that fits into the\ntheme.\nThis course is primarily intended as an opportunity for students to hone the craft of\ngame development - some instruction is provided, but the course is primarily project and\nsupervision based.",
    "Sub-courses": "1. Portfolio (Portfolio), 7.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The course is primarily aimed at giving students the opportunity to build a portfolio\nelement through the focused development of a game-related product. Students will work\nin groups, with supervision, to conceptualise, develop and deploy a game around a\nparticular theme.",
    "Assessment": "The course is assessed from three aspects - a technical artefact, a presentation, and a\nwritten report. The overall grade is a weighted average of these units.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nTo pass the course, approved results on all exercises are required.\nThe final grade of the course is based on the project report and the individual report.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT460, 7.5 credits. The course cannot be included in a\ndegree which contains DIT460. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT460 is included.\nThe courses TIA108 Prototyping in interaction design, TIA106 Graphical interfaces,\nand TIA104 Interaction design methodology or equivalent are recommended."
  }
}