{
  "metadata": {
    "source_document": "DIT487.pdf",
    "course_code": "DIT487",
    "course_title": "Empirical methods for user experience",
    "swedish_title": "Empiriska metoder för användarupplevelser",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Design 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2022-12-09",
    "valid_from_date": "2024-01-15",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2022-12-09 to be valid from 2024-01-15, spring semester of 2024.",
    "Position in the educational system": "The course is provided as a part of several programs.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Applied Data Science Master's Programme (N2ADS) and 3)\nSoftware Engineering and Management Master's Programme (N2SOF)",
    "Entry requirements": "To be eligible to the course the student must have a Bachelor degree of 180 hec.\nAdditionally, the courses DIT095 Human Computer Interaction 7.5 credits and DIT104\nInteraction design methodology 7.5 credits, or the equivalent is required.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student should be able to:\nKnowledge and understanding\n• Describe key qualities of correctly designed qualitative, quantitative and mixed-\nmethod studies.\n• Explain the differences between different evaluation strategies and predict their\nimpact on the interaction design process.\nCompetence and skills\n• Apply standard evaluation methods to studies in the interaction design process\n• Plan and organize user requirements gathering and subsequent analysis in an\ninteraction design process\n• Test hypotheses in quantitative and mixed-method studies of interactive artefacts\n• Implement an effective and ethical evaluation strategy in a design process\n• Report and interpret results of studies according to academic professional\nstandards\nJudgement and approach\n• Select design alternatives based on interpreting study results\n• Assess designs of interactive artefacts based on study results\n• Explain the advantages and the limitations of different evaluation strategies in an\ninteraction design process\n• Design effective formative and summative evaluation studies\n• Formulate ethical requirements for empirical studies.\nThe course is sustainability-related, which means that at least one of the learning\noutcomes clearly shows that the course content meets at least one of the University of\nGothenburg's confirmed sustainability criteria.",
    "Course content": "The course is a practice-oriented learning experience in which students apply empirical\nmethods to effectively design and evaluate interactive systems. The course teaches the\npractical and theoretical means to study requirements and evaluate interactive artefacts\nthrough conducting user research, gathering data, analysing studies and interpreting\nresults. The course familiarises students both with methods widely implemented in the\nindustry and tools for academic research.\nThe course prepares students for professional and research tasks related to evaluation in\nthe interaction design profession. Through being familiar with a portfolio of methods,\nstudents will be comfortable planning their evaluation studies and interpreting study\nresults. Knowledge on conducting studies will enable students to assess the quality of\nstudies presented to them. The students will be empowered to make better design\ndecisions based on study results.\nThe curriculum covers basic and advanced study designs for requirements gathering and\nevaluation. The course addresses qualitative data gathering and analysis, understanding\nand designing experiments, quantitative data processing and interpretations. The\nstudents develop the skills to rapidly integrate effective evaluation in the interaction\ndesign process.\nStudents are introduced to tools for qualitative and quantitative data analysis. These\ntools are later applied to specific design cases. Interpreting the results, using real design\ncases, is a key activity. The students learn how to design an effective evaluation strategy\nfor an interactive system and how to curate an effective set of methods for a given design\ncase. The course actively discusses how to conduct studies ethically and integrate\nevaluation seamlessly in the interaction design process.",
    "Sub-courses": "1. Project (Projekt), 4.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Take home examination (Hemtentamen), 3 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The course features both practical and theoretical parts, as well as work in groups and\nindividual work. Lectures, literature and seminars give a theoretical foundation. Focus\nis also on exchange of thoughts, feedback, designs and ideas. Hence, the course requires\nactive participation. Students will spend a significant part of their study time reading\nliterature and working in groups. The course consists of non-mandatory lectures and\ndesign workshops, mandatory seminars and assignments, group project, and individual\nhome exam. It is strongly recommended that the students shall attend all the lectures\nbecause lectures can provide a basis for seminar discussion and home exam will consider\nthe contents of lectures, seminars and projects.\nLanguage of instruction: English",
    "Assessment": "The course is examined through two modules:\n• Home Exam (3 hec, fail, 3,4,5).\n• Project (4,5 hec, fail, 3,4,5).\nThe course grade is a weighted average of the two scores. The fulfilment of learning\nobjectives is examined through conducting a project were multiple versions of an\ninteractive systems are studied using the methods taught in the course. Students design,\nplan, conduct and analyse studies in groups. The work is documented in a written\nreport. The project is assessed based on methodological rigour, suitability of methods\nchosen and academic background. The students also write an individual reflection on\nthe project where they discuss alternative study designs and relate their work to current\nresearch in interaction design and technologies.\nIf a student, who has failed the same examined element on two occasions, wishes to\nchange examiner before the next examination session, such a request is to be submitted\nto the department in writing and granted unless there are special reasons to the contrary\n(Chapter 6, Section 22 of Higher Education Ordinance).\nIn the event that a course has ceased or undergone major changes, students are to be\nguaranteed at least three examination sessions (including the ordinary examination\nsession) over a period of at least one year, though at most two years after the course has\nceased/been changed. The same applies to work experience and VFU, although this is\nrestricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nTo pass the course, all mandatory components must be passed. To earn a higher grade\nthan 3, a higher weighted average from the grades of the components is required.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT486, 7.5 credits. The course cannot be included in a\ndegree which contains DIT486. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT486 is included."
  }
}