{
  "metadata": {
    "source_document": "DIT576.pdf",
    "course_code": "DIT576",
    "course_title": "Research-oriented course in Computer Science and Engineering",
    "swedish_title": "Forskningsinriktad kurs inom data- och informationsteknik",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Software Engineering\nInteraction Design\nData Science\nComputer Science",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2018-05-07",
    "valid_from_date": "2018-08-27",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Game Design & Technology Master's Programme (N2GDT)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2018-05-07 to be valid from 2018-08-27, autumn semester of 2018.",
    "Position in the educational system": "The course is offered within several programmes.\nThe course can be part of the following programmes: 1) Computer Science, Master's Programme (N2COS), 2) Applied Data Science Master's Programme (N2ADS), 3) Game Design & Technology Master's Programme (N2GDT) and 4) Software Engineering and Management Master's Programme (N2SOF)",
    "Entry requirements": "The student shall have a Bachelor's degree in Computer Science, Software Engineering,\nor another relevant area.\nIn addition, a mandatory pre-requisite to take this course is that the student has the\nnecessary knowledge to take the specific instance of this course.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student should be able to:\nKnowledge and understanding\n• Understand and explain the terminology, concepts and theories associated with the\nresearch area of the course\n• Describe and explain the research area of the course, and show insight into current\nresearch and development\n• Describe and explain research methods within the research area of the course\nCompetence and skills\n• Critically and systematically integrate knowledge and to analyse, assess, and deal\nwith complex issues in the research area of the course\n• Clearly communicate the key ideas, concepts and results in the area of the course\nboth orally and in writing\nJudgement and approach\n• Search for, and extract, necessary information from scientific publications in the\nresearch area of the course, with the purpose of identifying strengths and weakness\nof solutions, approaches and methodologies",
    "Course content": "This course will deal with an area of current interest within the general area of computer\nscience, software engineering, interaction design or data science.\nThe course gives students the chance to follow a graduate course or another research\ncentered course.",
    "Sub-courses": null,
    "Form of teaching": "The organisation of the course may include lectures, tutorials, seminars, and/or labs and\nsupervision in conjunction with these.",
    "Assessment": "The examination might vary on each instance of the course. It might consist of a written\nor take-home exam, assignments, presentation of work in a seminar, or a combination\nof these. Further information will be given on the home page for each instance of the\ncourse.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nTo pass this course with grade G the students needs to show a good knowledge of the\ncourse subject in all parts of the examination of the specific instance of the course.\nTo pass the course with distinction (VG) the student needs to demonstrate a deeper\nunderstanding of the course subject in all parts of the examination of the specific\ninstance of the course.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "It is the responsibility of the student to establish contact before the course starts with the\nexaminer of the course, and to show that they have the necessary knowledge to start the\ncourse.\nThe course is a joint course together with Chalmers.\nThe course literature might vary on each instance of the course. The course literature\nwill be given on the home page of each specific instance of this course.\nThe course replaces the course DIT575, 7.5 credits. The course cannot be included in a\ndegree which contains DIT575. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT575 is included."
  }
}