{
  "metadata": {
    "source_document": "DIT575.pdf",
    "course_code": "DIT575",
    "course_title": "Research-oriented special course",
    "swedish_title": "Research-oriented special course",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2010-10-01",
    "valid_from_date": "2011-01-17",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)",
      "No translation available (NDATM)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2010-10-01 to be valid\nfrom 2011-01-17.",
    "Position in the educational system": "This course is a single subject course primarily intended for students who want to read\nresearch-oriented courses at doctoral education level.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Computer Science, Bachelor's Programme (N1COS) and 3)\nNo translation available (NDATM)",
    "Entry requirements": "The student shall have completed at least four years of study in the area of computer\nscience and engineering. A mandatory prerequisite to take this course is that you have\nestablished a contact between yourself and the examiner of the course. It is up to the\nexaminer to decide whether you are accepted or not to the course.",
    "Learning outcomes": "1. Knowledge and understanding\n• Master the terminology, concepts and theories associated with the selected areas of\ncomputer science and engineering.\n2. Skills and abilities\n• Formulate purpose statements and research questions in the selected areas of\ncomputer science and engineering;\n3. Judgement and approach\n• Search for, and extract, necessary information from scientific publications in the\nselected areas of relevance to computer science and engineering, with the purpose of\nidentifying strengths and weaknesses of existing solutions, approaches and\nmethodologies.",
    "Course content": "Students will study a restricted set of research-oriented topics (theoretical or applied) of\nrelevance to computer science and engineering, either independently or in collaboration\nwith other students. The main outcome, and main basis for the grading, is either an oral\npresentation (given in English) or a written report (written in English), demonstrating\nthe students gained knowledge, skills and judgment in the selected areas of relevance to\ncomputer science and engineering.",
    "Sub-courses": "",
    "Form of teaching": "Language of instruction: English",
    "Assessment": "Depending of the selected topics the student is evaluated through either an oral\npresentation or a written report (7.5hecs). Whether to evaluate by means of an oral\npresentation or a written report is largely determined by the chosen aspect of the topic\nstudied. More inventive aspects of a topic (performing theoretical analysis or laboratory\nexperiments) are typically examined by means of a written report, while more general\naspects of a topic (performing surveys and comparing competing methods) are typically\nexamined by means of an oral presentation.\nA student who has failed a test twice has the right to change examiners, if it is possible.\nA written application should be sent to the Department.\nThe number of examinations and placements are limited to five occasions and the\nnumber of placements is to be limited to two occasions.\nIn cases where a course has been discontinued or major changes have been made a\nstudent should be guaranteed at least three examination occasions (including the\nordinary examination occasion) during a time of at least one year from the last time the\ncourse was given.",
    "Grades": "The grading scale comprises: Fail, Pass, Pass with distinction.\nThe grading scale comprises Fail, (U), Pass (G) and Pass with Distinction (VG).\nGranting a Pass with distinction requires approval of a second teacher entitled to be\nthesis examiner.",
    "Course evaluation": "After completion of the course the students are to be given the possibility of\nparticipating in course anonymously. The processed results of the course evaluations are\nto be made accessible to students and also made available to new students at the\nbeginning of the next course. Possible changes brought about as a result of course\nevaluations to be described.",
    "Additional information": ""
  }
}