{
  "metadata": {
    "source_document": "DIT831.pdf",
    "course_code": "DIT831",
    "course_title": "Research Methods in Software Engineering",
    "swedish_title": "Forskningsmetodik för Software Engineering",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "First Cycle",
    "main_field_of_study": "Software Engineering",
    "specialization": "G2F, First cycle, has at least 60 credits in first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2019-05-24",
    "valid_from_date": "2020-01-20",
    "programmes": [
      "Software Engineering and Management Bachelor's Programme (N1SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2019-05-24 to be valid from 2020-01-20, spring semester of 2020.",
    "Position in the educational system": "The course is compulsory within the N1SOF Software Engineering and Management Bachelor's Programme.\nThe course can be part of the following programme: 1) Software Engineering and Management Bachelor's Programme (N1SOF)",
    "Entry requirements": "To be eligible for this course, students must have successfully completed 110 higher education credits (hec) in Software Engineering (or other fields giving these skills), including DIT022 Mathematical Foundations for Software Engineering, 7.5 hec, or equivalent.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• create their owen scientific reports within software engineering following the\nIMRAD structure.\nCompetence and skills\n• formulate research questions\n• choose strategies and methods in accordance with research questions, and motivate\nand explain these choices\n• conduct literature reviews\n• plan surveys using questionnaire, collect survey data, and analyze survey data\n•\nuse statistical data analysis techniques to evaluate empirical data\nJudgement and approach\n• reflect on and evaluate phenomena and their relationships as dependent and\nindependent variables\n• reflect and critique on empircal research study design",
    "Course content": "The course prepares students for conducting their bachelor thesis project and for professions in the fields of software engineering and software management. It balances both theoretical and practical considerations of research. The course has the following sub themes: Strategies and methods for software engineering studies with design science, case study research, surveys, experiments, statistical analysis, systematic literature reviews, and systematic mapping studies. These items together constitute the course. Students will apply a subset of the themes in their final report to gain practical experience in designing research. The knowledge obtained is generally useful, and applicable in most professions that require an academic degree.",
    "Sub-courses": "",
    "Form of teaching": "The teaching consists of lectures and seminars.",
    "Assessment": "The course is examined by a compulsory written report based upon the topics covered in the course. Depending on their nature, reports are either individual, or carried out in groups of two.\nIf a student, who has failed the same examined component twice, wishes to change examiner before the next examination, a written application shall be sent to the department responsible for the course and shall be granted unless there are special reasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the student shall normally be guaranteed at least three examination occasions (including the ordinary examination) during a period of at least one year from the last time the course was given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nFor grade Pass (G), the compulsory written report should demonstrate achievement of specified learning goals. For grade Pass with Distinction (VG), the compulsory written report should demonstrate achievement of learning goals with noteworthy quality and critical reflections beyond specifications.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student representatives. Further, an anonymous questionnaire is used to ensure written information. The outcome of the evaluations serves to improve the course by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "Course literature to be announced the latest 8 weeks prior to the start of the course."
  }
}