{
  "metadata": {
    "source_document": "DIT820.pdf",
    "course_code": "DIT820",
    "course_title": "Aesthetics of Interaction",
    "swedish_title": "Aesthetics of Interaction",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science",
    "specialization": "Interaction Design",
    "language_of_instruction": "English",
    "confirmation_date": "2008-10-08",
    "valid_from_date": "2009-09-01",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "No translation available (NDATM)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2008-10-08 to be valid\nfrom 2009-09-01.",
    "Position in the educational system": "5 higher education credits, is a part of the Computer Science Masters Programme and\nan elective course at University of Gothenburg.\nThe course Aesthetics of Interaction, 7. The course is also a Ph. D course for Ph. D\nstudents within interaction design or related subjects.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS) and 2) No translation available (NDATM)",
    "Entry requirements": "To be eligible for the course:\nThe requirements for the course is to have successfully completed a Bachelors degree\nwithin Computer Science or equivalent or the following courses:* Man-Machine system\n7,5 higher education credits;* Graphical interfaces 7.5 higher education credits;*\nInteraction Design Methodology 7.5 higher education credits;* Interaction Design\nProject 15 higher education credits; or similar.Or similar means that the student must be\ntrained in practical design work within the disciplines of interaction design, multimedia\ndesign, product design or architecture, and that they have taken at least one course in\nHuman-Computer Interaction or Man-Machine system.",
    "Learning outcomes": "After completing the course the student is expected to be able to:\n• have an overarching knowledge of the history of aesthetics in general\n• have an overarching knowledge of the history of aesthetics in relation to industrial\nDesign\n• have a good knowledge of the ongoing discussion on aesthetics in relation to\ninteraction Design; i.e. interaction aesthetics\n• be aware of the importance and aesthetical effect of all kinds of expressions; not\nonly visual ones.\n• Know how to Analyze an interactive system or object from an aesthetical standpoint\n(own or others)\n• be able to apply certain aesthetic values to a Design\n• be trained in discussing and motivating your Design choices\n• be trained in giving and receiving constructive feedback on Design of interaction\naesthetics\nTo summarize: After the course the student should have a clear idea about what\ninteraction aesthetics is and what to consider when designing the various aspects of it.\nThus, you should be able to design an interactive object or system with a focus not only\non functionality but also on aesthetics, and be able to provide a valid rationale for this\ndesign.",
    "Course content": "The course aims to give an understanding of central views and problems within\naesthetics of interaction design; students will also explore it in practice. Content\nincludes, but is not limited to:\n• Overview of the history of aesthetics\n• Overview of the history of industrial Design\n• Current standpoints in interaction aesthetics\n• Gestalt; expressions and expression logic\n• expressions of form\n• Computational technology as a Design material\n• Temporal aspects of interaction Design\n• Analysis of various aesthetic aspects of an interactive system or object\n• the connection between Design objectives; Design rationale and aesthetic Design\ndecisions\nThe course features both practical and theoretical parts, as well as work in groups and\nindividual work. Lectures, literature and literature seminars give a theoretical\nfoundation, which is immediately put into practice in a series of small exercises and one\nlarger project. Focus is upon turning analysis and reflection into practical action. Focus\nis also on exchange of thoughts, feedback, designs and ideas. The course requires active\nparticipation; apart from work with the final project, participants will spend most of\ntheir study time at school, working in pairs or groups.",
    "Sub-courses": "",
    "Form of teaching": "Language of instruction: English\nThe course is given in English.",
    "Assessment": "The course is examined by means of exercises (pass only) and literature seminars (pass\nonly), and an individual design project + report (graded). Some of these parts are\ncarried out individually, some in groups of varying sizes. The student who has failed a\ntest twice has the right to change examiner, unless weighty argument can be adduced.\nThe application has to be in writing.",
    "Grades": "The grading scale comprises: Fail, Pass.",
    "Course evaluation": "null",
    "Additional information": ""
  }
}