{
  "metadata": {
    "source_document": "DIT837.pdf",
    "course_code": "DIT837",
    "course_title": "Bachelor Thesis in Software Engineering and Management",
    "swedish_title": "Kandidatarbete inom Software Engineering and Management",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "15",
    "cycle": "First Cycle",
    "main_field_of_study": "Software Engineering",
    "specialization": "G2E, First cycle, has at least 60 credits in\nfirst-cycle course/s as entry requirements,\ncontains degree project for BA/BSc",
    "language_of_instruction": "English",
    "confirmation_date": "2019-04-15",
    "valid_from_date": "2020-01-20",
    "programmes": [
      "Software Engineering and\nManagement Bachelor's Programme (N1SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2019-04-15 to be valid from 2020-01-20, spring semester of 2020.",
    "Position in the educational system": "The course is compulsory within Software engineering and Management Bachelor's\nProgramme.\nThe course can be part of the following programme: 1) Software Engineering and\nManagement Bachelor's Programme (N1SOF)",
    "Entry requirements": "To be eligible for this course, students must have successfully completed 110 higher\neducation credits (hec) in Software Engineering. In addition, students must have\nsuccessfully completed DIT831 Research Methods in Software Engineering, 7.5 hec.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• identify a research topic and research question within the software engineering\ndomain\n• explain the use of a research method for planning a research project\n• describe the current practice within the software engineering domain and the way in\nwhich practical problems and academic research may be related\nCompetence and skills\n• formulate a research question relevant in the software engineering domain\n•\nsystematically solve a research problem relevant in the software engineering domain\n•\napply a research method for solving a problem relevant to the topic\n• combine theories, models and/or methods relevant to the topic\n•\n• plan and conduct a research project and document this in a written thesis report\nintegrate knowledge in a systematic and critical way in order to achieve and present\nknowledge relevant to the software engineering domain\n• communicate this knowledge in an academic environment, i.e. to present the\nresearch results to an academic audience\nJudgement and approach\n•\n• discuss research areas relevant to the software engineering domain\n• reflect on the importance of how research can be communicated in an academic\nenvironment\nuse the knowledge from this course as a basis for entering the research community\nwithin the software",
    "Course content": "The course involves an investigation of a relevant problem in the Software Engineering\ndomain. The problem is identified by the students and shall have practical and/or\ntheoretical relevance for the SE domain. Students work individually or in pairs\npreferably within a company setting in which the problem they address is investigated.\nThe investigation shall be documented in the form of a written thesis report.",
    "Sub-courses": null,
    "Form of teaching": "Initiation\nThe students write a thesis proposal according to the guidelines on the study program\nsoftware engineering and management. The thesis proposal shall provide a detailed\ndescription of the problem/task. The thesis proposal must also contain the background,\npurpose, objective, scope, and method. The thesis proposal is submitted to the examiner\nfor approval.\nThe examiner will ensure that the proposed topic for the thesis meets the general\nlearning outcomes for theses.\nThe Head of the Programme ensures that the thesis falls within the software engineering\ndomain, and that the research question is academically relevant.\nSupervision\nThe students are entitled to regular supervision during the course of the their work.\nProgress report\nHalfway through the thesis work, the students must report the status of of their work to\nthe examiner through a progress report. The progress report shall describe the\nachievements within the thesis work up to the halfway point, and include a plan for\ncompleting the remainder of the thesis work.\nWritten thesis report\nThe thesis report must be written in English.\nThe thesis report must be checked for plagiarism, typically using anti-plagiarism\nsoftware.\nThe University of Gothenburg's policies regarding open access and confidentiality apply\nto the work on the thesis and to publishing the report.\nWhen two students work jointly on a thesis, the division of thw work must be clearly\nstated in the thesis report.\nOral presentation\nThe oral presentation begins with the students presenting their work. This is followed by\nopposition (guided by other students) and discussion (guided by the examiner).\nThe oral presentation must be made in English.\nAt the time of the oral presentation, the written thesis report must be completed but not\npublished. This is to make it possible to include viewpoints that arise during the oral\npresentation, from the written opposition report, and from the examiner, to be\nincorporated into the written thesis report.\nThe oral presentation and the opposition must be done at University of Gothenburg.\nOpposition report\nThe students must write an opposition report according to the guidelines on the study\nprogram software engineering and management. The opposition report is submitted to\nthe examiner for approval.",
    "Assessment": "For the thesis to be approved, the following stages must be completed:\n•\nan approved thesis proposal\n•\nan approved progress report\n•\nan approved written thesis report\n•\nan approved presentation and defense of the thesis during the oral presentation\n• an approved opposition of another thesis\n•\nan approved opposition report\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nA pass grade (G) for the entire course requires a pass grade for all stages in the course.\nThe requirement to Pass (G) the the written thesis report is that the student in the\nwritten thesis report demonstrates the ability to formulate and investigate a research\nproblem relevant to the software engineering domain. The student is expected to show\nabilities in systematically solving this problem by applying a research method and to\nplan and conduct a study in an appropriate way. The student has to be able to discuss\nthe research problem and the fundamentals of the topic in a relevant and critical way. In\nthe written thesis report, the student needs to use terminology common within the\nproblem domain and show the ability to apply theories and models relevant to the topic,\ni.e. related research that add to the investigation of the research problem. An attempt to\ncritically reflect on the research problem and the literature describing this is required.\nTo be awarded Pass with Distinction (VG) for the entire course, the student must, in\naddition, receive a VG on the written thesis report. The requirement to Pass with\nDistinction (VG) in the written thesis report is that the student in the written thesis\nreport demonstrates the ability to formulate and investigate a research problem relevant\nto the software engineering domain. The student is expected to show abilities in\nsystematically solving this problem by applying a research method and to plan and\nconduct a study in an appropriate way. Furthermore, the student has to be able to\ndiscuss the research problem and the fundamentals of the topic in an efficient and\nexhaustive way. In the written thesis report the student needs to critically reflect on the\nresearch topic, to critically reflect on theories and models, i.e. related literature and to\ncritically assess the strengths and weaknesses that characterize the study that is\nconducted. This includes using a wide range of highly relevant references to support an\nargument, to discuss and analyze potentially contradicting aspects and to illustrate a\ndeeper understanding of the complexities involved in the research problem by\nsynthesizing information relevant to solve the problem.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "Course literature to be announced the latest 8 weeks prior to the start of the course."
  }
}