{
  "metadata": {
    "source_document": "DIT846.pdf",
    "course_code": "DIT846",
    "course_title": "Project Management",
    "swedish_title": "Projektledning",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Software Engineering",
    "specialization": "AXX, Second cycle, in-depth level of the course cannot be classified",
    "language_of_instruction": "English",
    "confirmation_date": "2020-12-18",
    "valid_from_date": "2021-08-30",
    "programmes": [
      "Software Engineering and Management, Master's Programme (N2SEM)",
      "Software Engineering Master's Programme (N2SOM)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2020-12-18 to be valid from 2021-08-30, autumn semester of 2021.",
    "Position in the educational system": "The course is a part of the Software Engineering and Management Master's Programme.\nThe course can be part of the following programmes: 1) Software Engineering and Management, Master's Programme (N2SEM), 2) Software Engineering Master's Programme (N2SOM) and 3) Software Engineering and Management Master's Programme (N2SOF)",
    "Entry requirements": "To be eligible for this course, the student must be admitted to the Master's programme in Software Engineering.",
    "Learning outcomes": "After completing the course, a student will be able to\nKnowledge and understanding\n• Describe basic project management concepts and tools\nSkills and abilities\n• Apply project management theories to analyze the specific characteristics of industrial projects and based on this suggest appropriate ways to manage the projects\n• Structure and organize simple projects\nJudgement and approach\n• Frame, analyze and solve managerial problems in project settings using appropriate literature\n• Use literature to critically evaluate project management models",
    "Course content": "The course is about managing projects. This means that the course contains general knowledge on project management and reflects such knowledge in contingences occurring when dealing with projects in technology-based firms. The following themes could be identified in the course's subject area:\nOrganizing projects and organizational characteristics\nProject leadership and learning\nProject planning and control\nThe course consists of two parts (Project Management Basics and Mastering Project Management)\nPart one: The Project Management Basics\nThis part is aimed at a general understanding of project management. You will be provided with insight of the prevailing vocabulary and perspectives of the project management movement profession, and this is core to the second part of the course. The Project Management Basics consists of serveral intense lectures in the first reading weeks of the course, followed by a two-hour test. A re-test also is scheduled for the Exam week in the current study period.\nPart two: Mastering Project Management\nThe teaching of Mastering Project Management consists of lectures and four thematic cases. This part aims at providing you with an increased understanding of what mechanisms keep mankind from perfecting project management. In order to achieve this, Mastering Project\nManagement includes theories from different research disciplines outside of project management such as organization theory, leadership research, organizational politics, contract theory and organizational learning.",
    "Sub-courses": "1. Examination (Tentamen), 7.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "Language of instruction: English",
    "Assessment": "It is mandatory to participate in the case seminars and meet the deadlines for hand-ins. The course is examined by project management basics test, case seminar hand-ins and an individual written home exam.\nA student who has failed two examinations on the same material has the right to request a change of examiner. Such a request must be submitted to the Department in writing and shall be granted unless there are particular reasons not to do so.\nIn cases where a course has been discontinued or has undergone major changes, students must be guaranteed at least three examination opportunities (including the regular opportunity) based on the previous content of the course for a period of at least one year.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U).\nThe grading scale comprises Fail (U), 3, 4 or 5.\nTo pass the course, all mandatory components must be passed. To earn a higher grade than Pass, a higher weighted average from the grades of the components is required. Failing to meet the mandatory deadlines may influence overall markings",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between teachers and student representatives. Further, an anonymous questionnaire is used to ensure written information. The outcome of the evaluations serves to improve the course by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers."
  }
}