{
  "metadata": {
    "source_document": "DIT878.pdf",
    "course_code": "DIT878",
    "course_title": "Seminar Course in Data Science",
    "swedish_title": "Seminariekurs i Data Science",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Data Science",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2019-02-08",
    "valid_from_date": "2019-09-02",
    "programmes": [
      "N2ADS Applied Data Science"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2019-02-08 to be valid from 2019-09-02, autumn semester of 2019.",
    "Position in the educational system": "The course is offered within the Master's programme N2ADS Applied Data Science.\nMain field of studies\nData Science\nSpecialization\nA1F, Second cycle, has second-cycle course/s as entry requirements",
    "Entry requirements": "To be eligible to the course, the student should have a Bachelor's degree, and have successfully completed 30 credits of courses within the subject Data Science.\nThe subject of the proposed seminar course must be within the field of Data Science and have been approved by the Head of the Programme, who also decides whether or not the student has the required prerequisites within the subject area to follow the seminars.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• give an overview of the most important concepts and trends in a selected research field\nCompetence and skills\n• identify the most salient ideas in a research paper\n• present theoretical ideas clearly and understandably to a peer group\n• summarize the most important ideas in a research fields as a written survey report\nJudgement and approach\n• consider advantages and drawbacks of different approaches to the selected research problem\n• evaluate research articles critically",
    "Course content": "This course examines a selected set of current state-of-the-art, research-related topics in the general area of data science, including research fields such as statistical modeling, machine learning, large-scale algorithms, and visualization, as well as fields where data science is applied such as bioinformatics, natural language processing, digital humanities, and computational social or political science.",
    "Sub-courses": "1. Seminars (Seminarier), 4.5 credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)\n2. Written report (Skriftlig rapport), 3 credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)",
    "Form of teaching": "The course is organized around a set of seminars. In each seminar, students will present one or more research articles. They will then introduce a number of reflections and questions for discussion related to the topics presented in the articles. This leads to an open discussion, where all students in the group participate.",
    "Assessment": "The course is examined by seminars (4.5 credits) and a written report (3 credits).\nTo pass the seminar sub-course, the student needs to present a number of research articles and participate actively in discussions. To pass the report sub-course, the student needs to submit a written survey of the selected research field, discussing the most important research and techniques within the field.\nFor both the sub-courses, a VG grade is awarded for work of exceptional clarity and insight.\nIf a student, who has failed the same examined component twice, wishes to change examiner before the next examination, a written application shall be sent to the department responsible for the course and shall be granted unless there are special reasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the student shall normally be guaranteed at least three examination occasions (including the ordinary examination) during a period of at least one year from the last time the course was given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nA Pass grade (G) for the entire course requires at least a Pass grade for all sub-courses.To be awarded Pass with Distinction (VG) for the full course, the grade VG must be obtained for both the sub-courses.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student representatives. Further, an anonymous questionnaire is used to ensure written information. The outcome of the evaluations serves to improve the course by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "The course is given in an on-demand basis. Students approach the programme responsible and suggest topics. The seminar course will then be initiated if there are enough participants to form a group, and the programme responsible finds the topic relevant.\nThe choice of the course material depends on the chosen research field and will be determined jointly by the students and the programme responsible at the beginning of the course.\nCourse literature to be announced the latest 8 weeks prior to the start of the course."
  }
}