{
  "metadata": {
    "source_document": "DIT920.pdf",
    "course_code": "DIT920",
    "course_title": "Master's Thesis in Computer Science and Engineering",
    "swedish_title": "Masteruppsats i Data- och informationsteknik",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "60",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design, Computer Science, Software Engineering",
    "specialization": "A2E, Second cycle, contains degree project for Master of Arts/Master of Science (120 credits)",
    "language_of_instruction": "English",
    "confirmation_date": "2017-12-19",
    "valid_from_date": "2019-09-02",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Game Design & Technology Master's Programme (N2GDT)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2017-12-19 and was last revised on 2019-02-08 to be valid from 2019-09-\n02, autumn semester of 2019.",
    "Position in the educational system": "The course is compulsory within several Master's programmes.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Game Design & Technology Master's Programme (N2GDT)\nand 3) Software Engineering and Management Master's Programme (N2SOF)",
    "Entry requirements": "To be eligible for this course, 60 credits of completed courses on the advanced levelis\nrequired, not counting credits from an earlier, first cycle (Bachelor) degree. At least 45\ncredits of these 60 credits must come from completed courses within the main field of\nstudy. A first cycle Bachelor degree is required.\nThe subject of the proposed thesis must be within the chosen main field of study and\nhave been approved by the Head of the Programme. The thesis proposal must have been\napproved by an examiner appointed by the department.\nThe examiner decides whether or not the student has the required prerequisites within\nthe subject area to carry out the particular thesis project.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student should be able to:\nKnowledge and understanding\n• give a thorough overview of the most relevant previous research and commonly used\nmethods in the technical field of the thesis project\nCompetence and skills\n• plan an extensive and research-related project, and carry out the project according\nto the plan\n• discuss the design and implementation of complex solutions to problems in the main\nfield of study\n• present and discuss their conclusions, as well as the knowledge and arguments these\nare based upon, in spoken and written English\nJudgement and approach\n• in their project use essential in-depth knowledge of the major subject/field of study\nand, in a scientifically correct way, relate to current research and development work\n• contribute to research and development work, and be able to relate their work to\nrelevant scientific contexts\n• demonstrate deeper methodological knowledge in the main field of study\n• select and apply resarch-oriented, technical and experimental methods, and motivate\nthese choices\n• thoroughly analyse and critically evaluate different technical solutions\n• relate their work to relevant technical or industrial contexts\n• based on a holistic view, critically and independently identify, formulate and deal\nwith complex issues\n• critically and systematically integrate knowledge\n• within the framework for the specific project, identify which issues need to be\naddressed for relevant societal, ethical and ecological factors to be observed\n• observe and discuss ethical aspects of research and development work, both\npertaining to how the work is carried out as well as what it explores or develops\n• identify and discuss needs for further elucidation of different project aspects before\ndecision-making or project realisation, when relevant",
    "Course content": "The purpose of a Master's thesis project is to enable the student to develop deeper\nknowledge, understanding, capabilities and attitudes in the context of the programme of\nstudy. For a 60 credits degree project, this should be done in a research-related context.\nThe thesis project should be carried out at the end of the programme and offers the\nopportunity to delve more deeply into and synthesise knowledge acquired in previous\nstudies. A thesis for a Master of Science within an area of Computer Science and\nEngineering should place emphasis on the technical and scientific aspects of the subject\nmatter.\nDuring the course, the students investigate an academically interesting problem in the\nmain field of study. The student perform research, theoretical or applied, independently\nunder the supervision of an academic supervisor.",
    "Sub-courses": "1. Interim report (Delredovisning), 30 credits\nGrading scale: Pass (G) and Fail (U)\n2. Master's thesis (Masteruppsats), 30 credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)",
    "Form of teaching": "Initiation\n• The thesis project is to be carried out by a single student or two students working\ntogether.\n• Student(s) write a thesis proposal according to the guidelines of the study\nprogramme in their chosen main field of study.\n• The department appoints an examiner for the project. The examiner will ensure that\nthe students meet the requirements for general and specific prerequisites for the\nthesis and that the proposed topic for the thesis meets the general intended learning\noutcomes for theses.\n• The Head of the Programme ensures that the thesis falls within the main subject of\nthe Master's programme, and that the research question is academically relevant.\nPlanning\n• The students must write a planning report providing a detailed description of the\nproblem/task. The planning report must contain the background, purpose,\nobjective, scope, method and timetable for completion of the thesis. The planning\nreport is submitted to the examiner for approval.\nSupervision\n• The students are entitled to regular supervision during the course of their work.\nInterim report\n• After twenty working weeks, the students must report the status of their work to the\nexaminer and the Head of the Programme. This report should describe the\nachievements within the project up to the halfway point, and include a plan for\ncompleting the remainder of the project.\nWritten report\n• The thesis report must be written in English.\n• The report must be checked for plagiarism, typically using anti-plagiarism software.\n• The University of Gothenburg's policies regarding open access and confidentiality\napply to the work on the thesis and to publishing the report.\n• When two students work jointly on a thesis, the division of the work must be clearly\nstated in the thesis report.\nOral presentation\n• The oral presentation begins with the students describing their work. This is\nfollowed by a defense of their findings, guided by the opposing examiners (other\nstudents), and a discussion.\n• The oral presentation must be made in English.\n• At the time of the oral presentation, the written thesis must be completed but not\npublished. This is to make it possible to include viewpoints that arise during the oral\npresentation to be incorporated into the thesis.\n• The oral presentation, including a defense of the thesis, must be done at the\nUniversity of Gothenburg. Any additional presentations can be made at a company\nor other external organisation, if necessary. In exceptional cases, for example, if\nthesis research has been conducted abroad, the examiner may grant a dispensation\nfrom the requirement for an oral presentation, defense of the findings in the thesis\nand presence at other presentations at the University of Gothenburg.\n• The presentation of the thesis must be announced at the department at least two\nweeks prior to the date of the presentation.",
    "Assessment": "For a thesis to be approved, the following stages must be completed:\n• an approved planning report\n• an approved interim report; this is the examination of the subcourse Interim report\n• an approved thesis report\n• an approved presentation and defense of the thesis\n• approved opposition of another thesis\n• attendance of the presentation and defense of two other theses\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nA Pass grade (G) for the entire course requires at least a Pass grade for all sub-courses.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The choice of the course material depends on the chosen project and will be determined\njointly by the students and their supervisor at the beginning of the work.\nThe course replaces the course DIT555, 60 credits. The course cannot be included in a\ndegree which contains DIT555. Neither can the course be included in a degree which is\nbased on another degree in which the courses DIT555 is included."
  }
}