{
  "metadata": {
    "source_document": "LT2318.pdf",
    "course_code": "LT2318",
    "course_title": "Artificial Intelligence: Cognitive Systems",
    "swedish_title": "Artificiell intelligens: kognitiva system",
    "department": "Department of Philosophy, Linguistics and Theory of Science",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Language Technology",
    "specialization": "A1F, Second cycle, has second-cycle\ncourse/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2023-05-29",
    "valid_from_date": "2023-08-28",
    "programmes": [
      "Applied Data Science Master's Programme (N2ADS)",
      "Master in Language Technology (One year or Two years) (H2MLT)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Philosophy, Linguistics and\nTheory of Science on 2018-05-29 and was last revised on 2023-05-29 to be valid from\n2023-08-28, autumn semester of 2023.",
    "Position in the educational system": "The course can be part of the following programmes: 1) Applied Data Science Master's\nProgramme (N2ADS) and 2) Master in Language Technology (One year or Two years)\n(H2MLT)",
    "Entry requirements": "Admission to the course requires either successful completion of the following courses:\n• LT2001 Introduction to programming 7.5 credits\n• LT2002 Introduction to formal linguistics 7.5 credits\n• LT2003 Natural Language Processing 15 credits (or LT2123 Basic skills for\nlanguage technology, 7.5 credits together with LT2124 Themes in NLP and\nlanguage technology, 7.5 credits)\n• LT2213 Computational semantics 7.5 credits\nor courses giving equivalent skills and knowledge. The course equivalence is evaluated\nby an area expert in language technology. If necessary, candidates may be required to\nsupply additional information.\nEnglish 6 or equivalent is also required.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• Define the relation between language, action, and perception in human interaction.\n• Describe the existing resources, approaches and applications in the field of\ncomputational modelling of language, action, and perception: corpora,\nexperimental methods, and computational implementations.\n• Read and describe scientific literature and understand programming code.\n• Identify ethical considerations.\nCompetence and skills\n• Explain the existing computational resources, approaches, and applications.\n• Discuss scientific literature and write programming code.\n• Plan, perform, and present an experiment / programming project.\n• Perform work according to a predetermined schedule.\nJudgement and approach\n• Analyse how language, action, and perception are modelled in computational\nresources, approaches, and applications.\n• Recognise problems and formulate new questions for their computational\nmodelling.\n• Make an informed choice of appropriate techniques.\n• Critically evaluate different models, including their own.",
    "Course content": "The course gives a survey of theory and practical implementations on how to build\nartificial systems that approximate intelligent human behaviour by connecting natural\nlanguage with the physical world through action and perception. We will look at topics\nsuch as semantic and computational approaches to modelling natural language, action\nand perception (grounding), situated dialogue systems, integrated robotic systems,\ngeneration and interpretation of scene descriptions from images and videos,\ncomputational modelling of spatial cognition, and others.",
    "Sub-courses": "",
    "Form of teaching": "The course consists of (i) lectures, (ii) seminar discussions, (iii) practical tutorials, and\n(iv) individual project work and supervision.",
    "Assessment": "The course is assessed by participation in seminars and a course project.\nObligatory attendance may be required for some components. Students will be given a\nchance to compensate the missed sessions with additional tasks and assignments during\nthe course if possible but otherwise they will have to take them the next time the course\nruns.\nA student who has failed an examination twice has the right to change examiners if it is\nfeasible. A written application should be sent to the board of the department. The\nnumber of examination opportunities is limited to five. Grading teachers can request\ncompletion of examined student work.\nIf a student has received a recommendation from the University of Gothenburg for\nspecial pedagogical support, the examiner may, in case it is compatible with the course\nobjectives and provided that unreasonable resources are not required, decide to give the\nstudent an adapted examination or alternative examination form.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).",
    "Course evaluation": "Students participating in, or having completed the course, are given an opportunity to\nanonymously convey their experiences of and suggestions for the course in a course\nevaluation. A summary of the course evaluation and reflections of the teacher\nresponsible for the course, is made available to the students within a reasonable time\nafter the course has completed. A summary of the course evaluation and any potential\nimplemented measures are presented the next time the course is given.",
    "Additional information": "The course requires access to a computer (or similar) with internet access.\nThe course may not be included in a degree together with LT2918."
  }
}