{
  "metadata": {
    "source_document": "TIA110.pdf",
    "course_code": "TIA110",
    "course_title": "Mobile Computing - Design and Implementation",
    "swedish_title": "Mobile Computing - Design and Implementation",
    "department": "Dep of Applied Information Technology",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design, Computer Science-Interaction Design",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements, AIN, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2010-12-21",
    "valid_from_date": "2016-09-01",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2010-12-21 and was\nlast revised on 2016-02-23 by Department of Applied Information Technology to be\nvalid from 2016-09-01, autumn semester of 2016.",
    "Position in the educational system": "The course is offered as a single subject course.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS) and 2) Computer Science, Bachelor's Programme (N1COS)\nMain field of studies\nInteraction Design\nComputer Science-Interaction Design\nSpecialization\nA1N, Second cycle, has only first-cycle\ncourse/s as entry requirements\nAIN, Second cycle, has only first-cycle\ncourse/s as entry requirements",
    "Entry requirements": "To be eligible for the course the student must have a Bachelor degree of 180 credits.\nSpecial requirements are DIT011 Object-oriented Software Development 7.5 credits\nand at least one of the courses TIG095 Human Computer Interaction 7.5 credits or\nTIG091 Design and construction of graphical interfaces 7.5 credits or the equivalent.\nTo be eligible for this course as a programme student in Science Bachelors Programme\nN1COS, the student must have passed at least 90 credits in programme courses\nincluding one of the courses TIG095 Human Computer Interaction 7.5 credits or\nTIG091 Design and construction of graphical interfaces 7.5 credits, or the equivalent.",
    "Learning outcomes": "After completion of the course the student should be able to:\nKnowledge and understanding\n• describe how mobile applications differ from traditional desktop applications, both\nin terms of challenges and possibilities,\n• exemplify important trends in the use of mobile computing,\n• list important guidelines for design on small screens,\n• list relevant frameworks simplifying implementation.\nSkills and abilities\n•\nuse important guidelines for design on small screens,\n•\nuse relevant frameworks simplifying implementation,\n• design the entire user experience for a mobile platform including both the interface\nand the interaction use and modify standard components for user interface design,\n• select an appropriate architecture and a set of frameworks to implement an\napplication,\n• work with state-of-the-art tools for development and user interface design.\nJudgement and approach\n• analyse existing mobile applications with focus on presentation and interaction,\n• choose and motivate design strategies in relation to the goals mentioned above,\n• choose and motivate appropriate implementation methods and frameworks for a\ngiven design.",
    "Course content": "The course deals with design and implementation for mobile computing. The focus is on\nsmart phones using touch screens for input. Both design principles, various application\nareas for mobile computing and an example framework for development using state-of-\nthe-art tools and methods will be covered.",
    "Sub-courses": "",
    "Form of teaching": "The course consists of lectures, exercises made in groups, and a final project carried out\nin groups where the aim is to invent, design and implement a mobile computing\napplication making use of the interaction possibilities available on a modern mobile\ncomputing device.\nLanguage of instruction: English",
    "Assessment": "The course is examined through two modules:\n1. Exercises and a group project, 4 credits and\n2. Individual written home exam, 3.5 credits.\nThe group project is examined by a written report and a demonstration of the project\nand the exercises are examined with written assignments. If the project fails, the student\ngets one chance to improve it to get the grade Pass.\nIn case a student misses the home exam, the student will have to retake a new home\nexam.\nA student who has failed a test twice has the right to change examiners, if it is possible.\nA written application should be sent to the Department.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nTo receive the grade Pass all parts of the course must be completed with a passing grade.\nTo receive the grade Pass with distinction, Pass with distinction is required on the home\nexam and at least the grade Pass is required on the exercises and the project.",
    "Course evaluation": "After completion of the course the students are to be given the possibility of\nparticipating in course anonymously. Continuous evaluation will be used, including\nthree meetings between teacher(s) and student representatives. Additionally, the course\nwill be evaluated with a course questionnaire, and discussed with the student\nrepresentatives.",
    "Additional information": ""
  }
}