{
  "metadata": {
    "source_document": "TIA150.pdf",
    "course_code": "TIA150",
    "course_title": "Communication: Communication among professionals",
    "swedish_title": "Kommunikation: Kommunikation bland professionella",
    "department": "Department of Applied Information Technology",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Communication",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2011-08-11",
    "valid_from_date": "2020-03-26",
    "programmes": [
      "Master in Communication (N2CMN)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2011-08-11 and was last revised on 2019-11-22 by Department of Applied Information Technology to be valid from 2020-03-26, spring semester of 2020.",
    "Position in the educational system": "The course is a compulsory course within the programme Master in Communiction.\nThe course can be part of the following programmes: 1) Master in Communication (N2CMN), 2) Applied Data Science Master's Programme (N2ADS) and 3) Software Engineering and Management Master's Programme (N2SOF)",
    "Entry requirements": "To be eligible for the course the student must have a Bachelor degree, 180 credits, of which a minimum of 90 credits in a major subject.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• identify characteristics and analyze implications of discourse and framing in organizations in and between different professional areas;\nCompetence and skills\n• independently formulate relevant research proposals combining appropriate theoretical approaches with suitable methods to empirically investigate organizational communication phenomena;\n• systematically investigate cases of different types of organizations in different professional areas;\nJudgement and approach\n• critically reflect the value and limitations of theoretical approaches to organizational discourse and framing in the wake of changing organizational environments.",
    "Course content": "Communication guides how we perceive and make sense of events and organizational developments. It is also used strategically to shape the meaning of these events and developments. This advanced course on organizational communication centers on organizational discourse and organizational framing. It focuses on the use of written and oral communication in professional settings as well as its implications for processes of identity building and identification, socialization, developing workplace relations, exercising power and control within and outside of organizations as well as shaping the perception of organizations. Moreover, it introduces discourse analysis as an approach to empirically investigate these phenomena.\nThe course encompasses communication within and between organizations in different established and emergent professional areas as well as between members of organizations and external stakeholders. It dedicates special attention to discourse and framing in changing organizational environments characterized by a higher degree of diversity and flexibility as well as an increased use of information and communication technologies.",
    "Sub-courses": "Module 1: Individual oral presentation and active participation in a seminar setting (3,5 credits).\nModule 2: Individually written assignment and oral presentation of this assignment (4 credits).",
    "Form of teaching": "The course education is provided through workshops, seminars as well as case- and problem-based learning. Special emphasis is put on interaction and learning in peer groups. Obligatory attendance may apply for certain parts of the course (especially seminars). When this is the case, it is stated in the course schedule that the students receive at the start of the course.",
    "Assessment": "Module 1: Individual oral presentation and active participation in a seminar setting (3,5 credits).\nModule 2: Individually written assignment and oral presentation of this assignment (4 credits).\nIf a student, who has failed the same examined component twice, wishes to change examiner before the next examination, a written application shall be sent to the department responsible for the course and shall be granted unless there are special reasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the student shall normally be guaranteed at least three examination occasions (including the ordinary examination) during a period of at least one year from the last time the course was given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nModule 1 is graded either Pass or Fail.\nModule 2 is graded either Pass with Distinction, Pass or Fail.\nIn order to receive Pass on the entire course, Pass is required in both modules.\nIn order to receive Pass with Distinction on the entire course, Pass is require in Module 1 and Pass with Distinction in Module 2.",
    "Course evaluation": "Students are to be given the opportunity to communicate their experience and views regarding the course in an anonymous course evaluation. The results of the course evaluation are to be made accessible to the students. Processed results of the latest evaluation, including changes made or planned, are also to be made available to participants in the next round of the course.\nAdditionally, the course instructor will conduct a qualitative interim evaluation during the course. The interim evaluation provides the course instructor with the opportunity of incorporating students' feedback in the second half of the course.",
    "Additional information": ""
  }
}