{
  "metadata": {
    "source_document": "TIA105.pdf",
    "course_code": "TIA105",
    "course_title": "Interaction Design of Social Media",
    "swedish_title": "Interaction Design of Social Media",
    "department": "Dep of Applied Information Technology",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design, Computer Science-Interaction Design",
    "specialization": "AIN, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2010-12-10",
    "valid_from_date": "2012-01-19",
    "programmes": [
      "Computer Science Master's Programme N2COS",
      "Computer Science Bachelors Programme N1COS"
    ]
  },
  "sections": {
    "Confirmation": "The course syllabus was confirmed by The IT Faculty Board on 2010-12-10 and was last revised by The IT Faculty Board on 2011-01-31 to be valid from 2012-01-19.\nField of education: Science 100%\nDepartment: Dep of Applied Information Technology",
    "Position in the educational system": "The course is provided as a part of the Computer Science Master's Programme N2COS. The course is also offered as a programme course in the Computer Science Bachelors Programme N1COS. Please note the entrance qualifications for programme students in N1COS below for this course. The course is also offered as a single subject course.\nMain field of studies\nInteraction Design\nComputer Science-Interaction Design\nSpecialization\nAIN, Second cycle, has only first-cycle course/s as entry requirements\nAIN, Second cycle, has only first-cycle course/s as entry requirements",
    "Entry requirements": "To be eligible for the course the student must have a Bachelor degree of 180 credits. Additionally, the course Human Computer Interaction (TIG095) 7.5 credits, or the equivalent is required. In addition, students need to have successfully completed a course in Graphical Interfaces (TIA106), 7.5 credits, at advanced level.\nTo be eligible for this course as a programme student in Science Bachelor's Programme, N1COS, the student must have passed at least 90 credits in programme courses and the additional courses Human Computer Interaction (TIG095) 7.5 credits and Graphical Interfaces (TIA106), 7.5 credits, at advanced level.",
    "Learning outcomes": "After having completed the course, the students should be able to design different types of social media, and be able to analyze (and thus to some extent foresee) the full implications of their design choices in doing so.\nAfter completion of the course the student is expected to be able to\nKnowledge and understanding\n•Understand how different types of social media (friend-based networks, sharing communities, professional networks, games) work, and why they work (i.e. why do they have users?)\n•Understand that a change in design can lead to changed in interaction with, relation to, use of, and impact of a social media.\n•List a rich set of examples demonstrating how differences in design result in different outcomes related to interaction with, relation to, use of, and impact of a social media.\n•List a rich set of different examples of how user input data can be used, judged and presented.\n• Understand how ones online personality can be changed using social media.\nSkills and abilities\n•Design or redesign social media towards goals like many connections, creation of small tight groups, supporting friendship, exchange of information and spreading of opinions\n•Design to afford input and output of valid and relevant data.\n•Design to safeguard integrity vs. design to utilize all that is known/can be known about a person in order to create a better service.\n•Create a strategy for changing, maintaining and creating a persons digital presence.\nJudgement and approach\n•Choose and motivate design strategies in relation to the abovementioned goals\n•Judge and foresee critically the implications of ones design choices\n•Choose and motivate design strategies related to input, relevance, validity and presentation of information.",
    "Course content": "The course aims to explore how the design of social media has implications on its users and on society as a whole. How is social media designed? Which consequences do certain design choices have? How can social media be used to affect society? How can content be collected, sorted, weighed? How can use be promoted? How do we deal with that at the same time as net-presence is becoming increasingly important, it is also becoming harder and harder to control the online information about ourselves; not only information about us, but also our behaviours and preferences are logged. How can we design for or against that?",
    "Sub-courses": "The course consists of three modules, namely 1. Literature Assignments 1 credit, 2. Design Exercises 2.5 credits, 3. Home Exam 4 credits.",
    "Form of teaching": "The course consists of a series of lectures, literature seminars and exercises.",
    "Assessment": "The course consists of a series of lectures, literature seminars and exercises.\nThe course consists of three modules, namely 1. Literature Assignments 1 credit, 2. Design Exercises 2.5 credits, 3. Home Exam 4 credits. In order to pass the course, the students must deliver:Literature assignments 1 credit (pass/fail) all must be passed Design exercises 2.5 credits (pass/fail) all must be passed Individual Written Home exam 4 credits (pass with distinction/pass/fail); This is a combination of a written exam and design task(s).\nIn case a student misses the home exam, the student will have to retake a new home exam. A student who has failed a test twice has the right to change examiner, if it is possible. A written application should be sent to the Department.\nThe number of examinations is to be limited to five occasions. In cases where a course has been discontinued or major changes have been made a student should be guaranteed at least three examination occasions (including the ordinary examination occasion) during a time of at least one year from the last time the course was given.",
    "Grades": "The grading scale comprises Fail (U), Pass (G), Pass with Distinction (VG).\nIn order to receive Pass on the entire course, a student must receive pass on all modules. In order to receive Pass with Distinction on the entire course, a student must receive Pass with Distinction on Individual Written Home Exam and Pass on the other two modules.",
    "Course evaluation": "",
    "Additional information": "Language of instruction: English."
  }
}