{
  "metadata": {
    "source_document": "DIT095.pdf",
    "course_code": "DIT095",
    "course_title": "Human-Computer Interaction",
    "swedish_title": "Människa-datorinteraktion",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "First Cycle",
    "main_field_of_study": "Computer Science-Interaction Design, Interaction Design",
    "specialization": "G1F, First cycle, has less than 60 credits in first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2020-11-25",
    "valid_from_date": "2022-01-17",
    "programmes": [
      "Applied Data Science Master's Programme (N2ADS)",
      "Computer Science, Bachelor's Programme (N1COS)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2020-11-25 to be valid from 2022-01-17, spring semester of 2022.",
    "Position in the educational system": "The course is provided as a part of the Computer Science and Engineering Bachelor's\nProgramme. It is also a single subject course at the University of Gothenburg.\nThe course can be part of the following programmes: 1) Applied Data Science Master's\nProgramme (N2ADS), 2) Computer Science, Bachelor's Programme (N1COS) and 3)\nSoftware Engineering and Management Master's Programme (N2SOF)",
    "Entry requirements": "The requirement for the course is to have successfully completed a course in\nprogramming.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• Describe stages of the design process\n• Describe methods for working with human-computer interaction\n• Describe the similarities and differences of designing for different user groups\n• Describe considerations for involving users in the design process\nCompetence and skills\n• Create designs specifically adapted for certain user groups\n• Design with regards to users\n• Modify design methods to fit the context and needs of users\n• Identify needs and requirements for users\nJudgement and approach\n• Analyze designs taking into account the needs of users\n• Make an informed evaluation of the ethical and societal impacts of a design\n• Criticize designs and design processes with respect to the needs of users",
    "Course content": "Human-computer interaction (HCI) is a discipline concerned with the design,\nevaluation, and implementation of interactive systems for human use and with the study\nof phenomena surrounding them.\nThe main objective in the course is to learn about the human centered design process:\n• understand the context of use and analysis,\n• establish requirements,\n•\ngenerate several design solutions and\n• evaluate prototypes with respect to the user.\nThe course consists of both theoretical and practical parts, where students will apply the\ndifferent stages of a human centered design process, and relevant methodologies to\ndesign for users. Overall, the course will cover a broad area of HCI knowledge on\ndesigning interactive systems, different types of interfaces and interaction modalities.",
    "Sub-courses": "1. Take home examination (Hemtentamen), 4.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Project (Projekt), 3 credits\nGrading scale: Pass (G) and Fail (U)",
    "Form of teaching": "The course is based on lectures, exercises, project, and individual take-home exams. The\nexercises and the project are conducted in groups.\nLanguage of instruction: English",
    "Assessment": "The examination consists of two modules, namely:\n• Individual take-home exams, 4.5 credits (Fail, 3,4,5)\n• Exercises and project report, 3 credits (pass / fail)\nIf a student, who has failed the same examined element on two occasions, wishes to\nchange examiner before the next examination session, such a request is to be submitted\nto the department in writing and granted unless there are special reasons to the contrary\n(Chapter 6, Section 22 of Higher Education Ordinance).\nIn the event that a course has ceased or undergone major changes, students are to be\nguaranteed at least three examination sessions (including the ordinary examination\nsession) over a period of at least one year, though at most two years after the course has\nceased/been changed. The same applies to work experience and VFU, although this is\nrestricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nTo pass the course, students must receive a passing grade in both modules. The grade\nfor the entire course will be determined by the take-home exams.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course TIG095, 7.5 credits. The course cannot be included in a\ndegree which contains TIG095. Neither can the course be included in a degree which is\nbased on another degree in which the course TIG095 is included."
  }
}