{
  "metadata": {
    "source_document": "DIT279.pdf",
    "course_code": "DIT279",
    "course_title": "Industrial Project in Software Engineering",
    "swedish_title": "Industriellt projekt i Software Engineering",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "15",
    "cycle": "Second Cycle",
    "main_field_of_study": "Software Engineering",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "Swedish and English",
    "confirmation_date": "2017-12-19",
    "valid_from_date": "2018-08-19",
    "programmes": [
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2017-12-19 to be valid from 2018-08-19, autumn semester of 2018.",
    "Position in the educational system": "The course is offered within the Software Engineering and Management Master's\nProgramme.\nThe course can be part of the following programme: 1) Software Engineering and\nManagement Master's Programme (N2SOF)",
    "Entry requirements": "To be eligible for the course, at least 45 credits must come from courses on the advanced\nlevel withing the area of software engineering, including the following courses: DIT276\nRequirements Engineering, DIT847 Software Quality, DIT278 Empirical Software\nEngineering, and DIT844 Project Management, or equivalent.\nTo be admitted to the course the student must\n1. demonstrate by a signed letter of support that there is interest in a company to\ncollaborate with the student under conditions described in the course objectives,\n2. identify an academic supervisor who is committed to supervise the student and\nmonitor the progress towards the learning goals,\n3. provide a planning report that clearly defines the project goals, the project\nexecution, and how the project relates to the learning goals.\nStudents get admitted on approval of the planning report.\nThe subject of the proposed project should be in the field of software engineering. The\nplanning report should describe:\n• which company offers the practice placement to the student, including the contact\npersons and written consent/invitation from the company,\n• which academic supervisor will monitor the progress towards the learning goals,\n• project assumptions in the form of initial problem formulation,\n• forms of project work, including the timeframe,\n• deliverables from the student project to the company,\n• how potential questions about intellectual property rights should be resolved.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After the course the student should be able to:\nKnowledge and understanding\n• describe the differences between the theoretical and practical principles (and\nassumptions) of how software engineering methods are or should be used\n• identify a number of software engineering methods applicable to solve the problem\nat hand and point to the appropriate empirical research showing their capability to\nsolve the industrial problem\n• distinguish software engineering problems from other types of problems, e.g. those\nrelated to hardware\nCompetence and skills\n• solve the problem at hand using the chosen methods\n• apply the knowledge from courses in the area of software engineering to contribute\nto the development of the host company\n• choose the most appropriate method under the circumstances which are relevant for\nthe host company\nJudgement and approach\n• reflect over the theoretical assumptions of the applied software engineering methods\n• evaluate the contribution of the project to the development of the host company\nboth in the short and in the long run",
    "Course content": "The course aims to apply theoretical knowledge in practice to learn about\nconsiderations and trade-offs between theory and practice, and to build an in-depth\nunderstanding of a selected problem area in software engineering.\nThis course is formed mainly by an individual project placed at a software development\ncompany. The project contains parts which in practice test whether the knowledge\nobtained in the program is applicable in the practice.\nThe students in this course are expected to apply in practice their knowledge and\ncontribute to the normal operations of the hosting company. The students have to show\nthat they are capable to identify industrial problems where advanced knowledge in\nsoftware engineering can be applied. The problem should also be solved.\nThe project should include comparison of different methods which could potentially be\nused to solve the problems. The comparison should include a reflection over theoretical\nprinciples and assumptions of the methods and their relation to the industrial\nconstraints and practices.",
    "Sub-courses": "",
    "Form of teaching": "Language of instruction: Swedish and English",
    "Assessment": "The course is assessed through an individual written final report, and a demonstration\nof the project results.\nThe final report is a written document which describes how the learning outcomes of the\ncourse were achieved and in which way the project contributed to the development of\nthe company. The report should be accompanied by a demonstration of the main results\nof the project to the examiner.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nIn order to pass the course both the final report and the demonstration have to be\napproved.\nThe final grade in the course is decided from the grade of the final report.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT277, 15 credits. The course cannot be included in a\ndegree which contains DIT277. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT277 is included."
  }
}