{
  "metadata": {
    "source_document": "DIT410.pdf",
    "course_code": "DIT410",
    "course_title": "Artificial Intelligence",
    "swedish_title": "Artificial Intelligence",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science-Algorithms and Logic, Computer Science-Interaction Design",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2009-10-15",
    "valid_from_date": "2016-01-17",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Software Engineering Master's Programme (N2SOM)",
      "Complex Adaptive Systems, Master's Programme (N2CAS)",
      "Computer Science, Bachelor's Programme (N1COS)",
      "No translation available (NDATM)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2009-10-15 and was\nlast revised on 2014-10-24 by Department of Computer Science and Engineering to be\nvalid from 2016-01-17, spring semester of 2016.",
    "Position in the educational system": "The course is offered within the framework of several degree programmes. The course is\nalso a single subject course at the University of Gothenburg.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Software Engineering Master's Programme (N2SOM), 3)\nComplex Adaptive Systems, Master's Programme (N2CAS), 4) Computer Science,\nBachelor's Programme (N1COS) and 5) No translation available (NDATM)",
    "Entry requirements": "To be eligible for the course students should have successfully completed 90 hec of\nstudies within the subject Computer Science, or equivalent. Furthermore, students\nshould have successfully completed the following courses: Advanced programming\n(DIT950 or DIT260 or equivalent) and Data structures (DIT960 or equivalent).\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completing the course the student is expected to be able to:\nKnowledge and understanding\n• exemplify and describe some chosen application areas that can benefit from using\nAI technologies and methodologies.\n• state and describe the most important technologies and methodologies used in\ndifferent subfields of AI, such as search, automatic reasoning and planning, natural\nlanguage processing; including the fundamental AI algorithms in these areas and\nhow they are used.\n• define, explain and discuss the fundamental AI algorithms in at least one of the\nsubareas of AI, gained by a supervised group project.\n• design, program, document, and evaluate an AI-based software system so that it has\nacceptable performance.\nSkills and abilities\n• interpret and analyse research literature, and apply it for solving AI-related\nproblems.\n• apply the knowledge gained from this course to new problems in the AI domain.\n• write scientific reports.\nJudgement and approach\n• judge what can be achieved by AI technology and what is not possible.\n• judge when it is feasible to use AI technology, and when it is not useful.\n• summarize and relate different ethical arguments in favour of or against AI.",
    "Course content": "Artificial Intelligence (AI) studies how computers can accomplish tasks that were\ntraditionally thought to require human intelligence. The aim of this course is to give a\ndeepened understanding of the possibilities and the limitations of AI methods.\nThe following topics will be treated in the course:\nOverview of AI\n• introduction to AI\n• history, philosophical foundations and ethical issues of AI\n• application areas where AI technologies are used, such as natural language\nprocessing, bioinformatics, robotics etc.\nAI techniques and methodologies\n• uninformed and informed search\n• logic and deduction\n• probabilistic reasoning\n• automated planning",
    "Sub-courses": "1. Written assignment (Skriftlig inlämningsuppgift), 2.5 higher education credits\nGrading scale: Pass (G) and Fail (U)\n2. AI Project (AI Projekt), 5 higher education credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)",
    "Form of teaching": "The course is project-oriented and divided into two parts. The smaller part is theoretical\nand consists of lectures and exercises covering basic AI topics. The bigger part consists\nof supervised project work in groups to complete one programming project, to write one\nessay, and to read and comment upon the work made by other groups in the course. The\nstudents form project groups, and each group is assigned a programming project and an\nessay subject.\nLanguage of instruction: English",
    "Assessment": "The course is examined by an individual written assignment (2.5 hec) and a AI project (5\nhec) carried out in groups. The AI project consist of three parts: a programming project\ncovering some of the AI techniques presented in the lectures, a written report on the\nprogramming project, and a written essay covering a historical, philosophical or ethical\nissue within AI whose content will be presented at the end of the course. The quality of\nthe final program, the written material, the participation during supervision and the\nfinal presentation are important for the assessment of the project part. In addition, in\norder to pass the course the student needs to actively participate during supervision, as\nwell as read and comment upon reports presented by other groups in the course.\nA student who has failed two examinations on the same material has the right to request\na change of examiner. Such a request must be submitted to the Department in writing\nand shall be granted unless there are particular reasons not to do so.\nIn cases where a course has been discontinued or has undergone major changes, students\nmust be guaranteed at least three examination opportunities (including the regular\nopportunity) based on the previous content of the course for a period of at least one\nyear.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nTo be awarded Pass (G) for a full course, the student must pass both the AI project and\nthe written assignment with at least grade (G). The student must in addition have\nparticipated actively during the supervision.\nTo be awarded Pass with Distinction (VG) for a full course, the student must, in\naddition, Pass with Distinction (VG) on the AI project.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nIt is helpful, but not mandatory, if the student has taken courses such as:\n• Algorithms (e.g., DIT600)\n• Automata theory (e.g., DIT321)\n• Machine learning (e.g., DIT380)\n• Programming language technology, (e.g., DIT231)"
  }
}