{
  "metadata": {
    "source_document": "DIT411.pdf",
    "course_code": "DIT411",
    "course_title": "Introduction to Artificial Intelligence",
    "swedish_title": "Introduktion till artificiell intelligens",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2016-12-20",
    "valid_from_date": "2017-08-20",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Game Design & Technology Master's Programme (N2GDT)",
      "Computer Science, Bachelor's Programme (N1COS)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2016-12-20 and was last revised on 2017-06-07 to be valid from 2017-08-\n20, autumn semester of 2017.",
    "Position in the educational system": "The course is part of the Computer Science Master's Programme. The course is also a\nsingle subject course at the University of Gothenburg.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Applied Data Science Master's Programme (N2ADS), 3)\nGame Design & Technology Master's Programme (N2GDT) and 4) Computer Science,\nBachelor's Programme (N1COS)",
    "Entry requirements": "To be eligible for the course students should have successfully completed courses\ncorresponding to 90 hec within the subject Computer Science, or equivalent, including a\nsecond 7.5 hec programming course (DIT952 or DIT260 or equivalent) and a 7.5 hec\ncourse in data structures (DIT960 or equivalent).\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\nKnowledge and understanding\n• Explain basic concepts and algorithms for cost-based search, planning and\nconstraint satisfaction problems (CSP).\n• Compare advantages and disadvantages with different algorithms for search,\nplanning and CSP.\n• Account for the historical development, current situation and future prospects for\nsome subarea of AI.\n\nCompetence and skills\n• Choose appropriate algorithms for search, planning and CSP to solve given AI\nproblems in a memory- and time-efficient manner.\n• Implement efficient algorithms for search, planning and CSP in a suitable\nprogramming language.\n• Summarise scientific progress and ethical issues.\n• Write scientific texts.\n\nJudgement and approach\n• Analyse and critically discuss ethical issues within AI.\n• Review and constructively criticise scientific texts.",
    "Course content": "Artificial Intelligence (AI) studies how computers can accomplish tasks that were\ntraditionally thought to require human intelligence. This course gives an introduction to\nthe subject and has two main purposes.\n\nThe first purpose is to give an understanding of which sub-areas there are within AI,\ntheir historical development and which ethical issues that can arise within different sub-\nareas. This is done by reading literature within different AI areas, by summarising and\ndiscussing the literature in writing, and by reviewing essays by other students.\n\nDetta görs genom att läsa litteratur inom olika AI-områden, att sammanfatta och\ndiskutera litteraturen skriftligt, och att granska uppsatser av andra studenter.\n\nThe second purpose is to teach basic concepts and algorithms for heuristic search,\nplanning and problem solving, including their usage, and how they can be used to solve\ninteresting AI problems. The following algorithms and concepts are included:\n\n• general search problems – weighted and unweighted graphs, graph search, tree\nsearch, search trees\n• different classes of search and planning problems – complete and incomplete\ninformation, deterministic and nondeterministic problems\n• standard algorithms for deterministic search and planning with perfect information\n– uninformed search, informed search, local search\n• search with incomplete information, nondeterministic problems, and problems with\nmultiple agents\n• constraint satisfaction problems (CSP)\n• heuristics for informed search and for CSP",
    "Sub-courses": "1. Written exam (Skriftlig tentamen), 2.5 higher education credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)\n2. Project (Projekt), 3.5 higher education credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)\n3. Essay (Uppsats), 1.5 higher education credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)",
    "Form of teaching": "The students form project groups of 3-5 persons, and every group is assigned a\nsupervisor, a programming project and an essay topic. The forms of teaching are group\nsupervision, essay writing, program development in groups, and peer review on essays\nby other groups. Furthermore there are theoretical lectures, practical assignments and\nwritten examination.\n\nLanguage of instruction: English",
    "Assessment": "The course is examined by:\n•\nan individual written examination (2.5 hec)\n•\na programming project carried out in groups of 3–5 students, with oral presentation\n(3.5 hec)\n•\na written essay in groups of 3–5 students, with peer review (1.5 hec)\n\nTo pass the group sub-courses, the student must participate actively during supervision,\npresentation and in the group's internal planning, and must make essential and\nmeasurable contributions to the final outcome (the program and the essay). To pass the\nessay sub-course, the student must furthermore read and actively discuss essays written\nby other project groups.\n\nIf the student is failed on a group sub-course, despite participating in the group work,\nthey will get a task to complete individually instead of in a group. If the student also\nfails this, they have to redo the whole sub-course in a new project group.\n\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\n\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nA Pass grade (G) for the entire course requires at least a Pass grade for all sub-courses.\n\nA Pass with Distinction grade (VG) for the entire course requires a Pass with\nDistinction on two of the three sub-courses, in addition to at least a Pass grade for other\nsub-courses.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\n\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\n\nThe course replaces the DIT410 Artificial Intelligence 7.5 hec course. The course cannot\nbe included in a degree which contains DIT410. Neither can the course be included in a\ndegree which is based on another degree in which the course DIT410 is included."
  }
}