{
  "metadata": {
    "source_document": "DIT550.pdf",
    "course_code": "DIT550",
    "course_title": "Master Thesis in Computer Science, 30 higher education credits",
    "swedish_title": "Master Thesis in Computer Science, 30 högskolepoäng",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "30",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science",
    "specialization": "A2E, Second cycle, contains degree project for Master of Arts/Master of Science (120 credits)",
    "language_of_instruction": "English",
    "confirmation_date": "2008-02-08",
    "valid_from_date": "2016-01-18",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2008-02-08 and was last revised on 2015-10-01 by Department of Computer Science and Engineering to be valid from 2016-01-18, spring semester of 2016.",
    "Position in the educational system": "This course, 30 higher education credits, is given as part of the Master's programme in\nComputer Science at the University of Gothenburg, and constitutes the final thesis work\nfor that programme. Level for the course in relation to degree requirements is Master's\ndegree, code A2E.\nThe course can be part of the following programme: 1) Computer Science, Master's\nProgramme (N2COS)\nMain field of studies\nComputer Science\nSpecialization\nA2E, Second cycle, contains degree project\nfor Master of Arts/Master of Science (120\ncredits)",
    "Entry requirements": "To be eligible for this course, the equivalent of 75 hec is required, not counting credits\nfrom an earlier, first cycle (Bachelor) degree. At least 60 hec (or more) of these must\nmust come from courses on the advanced level, out of which 45 hec (or more) must\ncome from courses within the Computer Science area. A first cycle Bachelor degree is\nrequired. The theses subject must have been approved by the Head of the Programme\nand the thesis proposal must have been approved by the examiner. Futhermore, the\nexaminer decides whether or not the student has the required prerequisites within the\nsubject area to start the particular thesis project.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof and internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "Knowledge and understanding\nAfter completing the course the student is expected to be able to:\n• design solutions to problems in the area of computer science and computer systems,\naimed at the realisation of new or modified systems of a more complex nature, with\nthe intention of creating value in accordance with predefined requirements.\n• systematically develop and use theories and models, with a critical attitude, and\nconsciously choosing between alternative approaches.\nSkills and abilities\nAfter completing the course the student is expected to be able to:\n• deal with the changeability of requirements through external circumstances or\nadvancing insight.\n• document and present in a satisfactory manner, both in terms of the new\ncontribution, the design choices taken, the basis of the work, and related work.\nJudgement and approach\nAfter completing the course the student is expected to be able to:\n• acquire new scientific knowledge through research, i.e., to develop new insights, of a\nmore complex nature, in a purposeful and methodical way, while choosing the right\nlevel of abstraction.",
    "Course content": "The course consists in a thesis work, performed individually or in pairs, under\nsupervision of a teacher. The subject of thesis must lie within the area of Computer\nScience. Students will perform research, theoretical or applied, in parts in collaboration\nwith supervision, and in parts independently. The degree of independence increases\nduring the course. The main outcome, and main basis for the grading, is a report,\nwritten in English, describing the problem, assumptions, methods, choices, results,\nevaluation of the work, including the comparison to relevant work external to the thesis.\nThe thesis is also presented in a talk, given in English.",
    "Sub-courses": "",
    "Form of teaching": "Language of instruction: English",
    "Assessment": "For passing the course, the following is required:\n• An accepted report written in English.\n• An accepted presentation and defense during the thesis presentation seminar held in\nEnglish.\n• Accepted opposition for another Master thesis.\n• Attending two other Master thesis presentations.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nGranting Pass with distinction requires approval of a second teacher (entitled to be\nthesis examiner).",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.",
    "Additional information": ""
  }
}