{
  "metadata": {
    "source_document": "DIT632.pdf",
    "course_code": "DIT632",
    "course_title": "Development of Embedded and Real-Time Systems",
    "swedish_title": "Utveckling av inbyggda- och realtidssystem",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "First Cycle",
    "main_field_of_study": "Software Engineering",
    "specialization": "G1F, First Cycle, has less than 60 credits in first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2017-12-19",
    "valid_from_date": "2018-08-19",
    "programmes": [
      "Software Engineering and Management Bachelor's Programme (N1SOF)",
      "Software Engineering and Management, Bachelor's Programme (N1SEM)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2017-12-19 to be valid from 2018-08-19, autumn semester of 2018.",
    "Position in the educational system": "The course is compulsory within the Software Engineering and Management Bachelor's\nProgramme. It is also a single subject course at the University of Gothenburg.\nThe course can be part of the following programmes: 1) Software Engineering and\nManagement Bachelor's Programme (N1SOF) and 2) Software Engineering and\nManagement, Bachelor's Programme (N1SEM)",
    "Entry requirements": "To be eligible to the course, the student should have successfully completed 30 credits of\ncourses within Software Engineering, Computer Science, or equivalent, including a 7.5\ncredits course in programming (e.g., DIT042 Object-Oriented Programming, DIT012\nImperative Programming with Basic Object-Oriantation, or equivalent).\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• exemplify characteristics of embedded systems and of real time systems\n• explain the basic theory of exceptions, interrupts, and timers\n• illustrate an overall view of a compilation process\n• explain cross compilation\n• clarify the differences between a desktop application and an embedded application\n• state the concepts of transferring a binary to a target system\n• define the concepts of tasks, scheduling, semaphores, message queues,\nsynchronization and communication\n• exemplify methods of abstracting the underlying hardware\nCompetence and skills\n• implement an embedded application using a system programming language, such as\nC for some given hardware, using a cross compiler\n• carry out a test strategy for an embedded application\n• manage rudimentary real time applications\nJudgement and approach\n• analyse and participate in discussions of an embedded real-time system's basic\nmodularity\n• estimate the need for and suggest how to perform software tests for an embedded\nreal-time system",
    "Course content": "Embedded and real-time software is often closely interacting with hardware. Typically,\nthis software is written in a language like C on either a real-time operating system or a\nstripped Unix/Linux version. The course contains an introduction to embedded and\nreal-time systems, programming for an embedded environment and tools used to\ndevelop embedded systems, use of IDEs as well as command line programs (compilers,\nlinkers etc.).\nThe course also contains an introduction to the principal of program execution and the\ninterrupt manage process, general operating systems and real-time operating systems,\nconcepts, mainly, used in the real-time and embedded systems.",
    "Sub-courses": "1. Written examination (Skriftlig tentamen), 4.5 higher education credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)\n2. Assignments (Inlämningsuppgifter), 3 higher education credits\nGrading scale: Pass (G) and Fail (U)",
    "Form of teaching": "The teaching consists of lectures, exercises and examination parts, as well as supervision\nin connection to the exercises.\nLanguage of instruction: English",
    "Assessment": "The course is examined by an individual written exam carried out in an examination hall\nand written assignments normally carried out in groups of normally 2-3 students. The\nassignments part is examined on the basis of solutions to compulsory problems handed\nin during the course and on the basis of individual contribution to the group work.\nStudents are required to complete written self- and peer-assessment forms during the\ncourse which will be part of the assessment of the student's individual contribution to\nthe group work.\nRetake examinations of the assignments part consist of additional individual\nassignments.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nA Pass grade (G) for the entire course requires at least a Pass grade for all sub-courses.\nTo be awarded Pass with Distinction (VG) for a full course, the student must, in\naddition, receive a VG on the sub-course Written examination.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "Course literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT165, 6.0 credits. The course cannot be included in a\ndegree which contains DIT165. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT165 is included."
  }
}