{
  "metadata": {
    "source_document": "DIT638.pdf",
    "course_code": "DIT638",
    "course_title": "Cyber Physical Systems and Systems of Systems",
    "swedish_title": "Cyberfysiska system och system av system",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "15",
    "cycle": "First Cycle",
    "main_field_of_study": "Software Engineering",
    "specialization": "G1F, First Cycle, has less than 60 credits in first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2017-12-19",
    "valid_from_date": "2018-08-19",
    "programmes": [
      "Software Engineering and Management Bachelor's Programme (N1SOF)",
      "Software Engineering and Management, Bachelor's Programme (N1SEM)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2017-12-19 to be valid from 2018-08-19, autumn semester of 2018.",
    "Position in the educational system": "The course is compulsory within the Software Engineering and Management Bachelor's\nProgramme.\nThe course can be part of the following programmes: 1) Software Engineering and\nManagement Bachelor's Programme (N1SOF) and 2) Software Engineering and\nManagement, Bachelor's Programme (N1SEM)",
    "Entry requirements": "To be eligible for this course, students must have successfully completed the following\ncourses, or equivalent:\n• DIT022 Mathematical Foundations for Software Engineering, 7.5 credits,\n• DIT344 Fundamentals of Software Architecture, 7.5 credits,\n• DIT112 Mini Project: Systems Development, 7.5 credits, and\n• DIT632 Development of Embedded and Real-Time Systems, 7.5 credits.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• conclude and describe overall system requirements and design, including the system-\nof-systems aspect\n• elaborate on sub-system requirements and design\n• describe reasons to ensure traceability and select appropriate strategies\n• define incremental development in practice\n• separate and compare different levels and types of testing\n• explain trouble reporting and requirements change routines\nCompetence and skills\n• plan, conduct, and evaluate software/hardware integration (and is able to show this\nin terms of code)\n• describe (in terms of code) how system (or sub-system) requirements and system (or\nsub-system) design has been realized\nJudgement and approach\n• reflect on integration work that is done in a project\n• discuss how formal reviewing of artifacts is conducted, recorded and made use of\n• exemplify and elaborate on personnel management, knowledge transfer activities\nand risk management,\n• exemplify and reflect on daily routines and work-practices that are used in projects",
    "Course content": "Many industries today use cyber-physical systems (CPS) as (part of) their products. In\nthis project, students are acquainted with typical development challenges for such CPS.\nThey learn how to design and implement a CPS common to the entire class by dividing\nit into subsystems. This places high demands on the students on appropriate functional\nand nonfunctional requirements, effective design, quality assurance and testing,\ndocumentation, and artifact traceability.\nIn addition, the project may place particular demands on effective integration and\ninteraction between the groups as well as internally within each group. Skills ranging\nfrom requirements management to designing and testing, as well as from collaboration\nto knowledge transfer and conflict management are tested.\nThe course enables the students to develop a thorough understanding of the added\ncomplexity that comes from integrating hardware and software. The additional level of\ninteraction and coordination that results from each group potentially depending on the\nother groups, adds a further level of experience that will be very valuable to the students\nin their future professional careers.",
    "Sub-courses": "",
    "Form of teaching": "The teaching consists of lectures that may contain presentations from students,\nexercises, project work, and examination parts, as well as supervision in connection to\nthe exercises.",
    "Assessment": "The course is examined through artifact review and oral examination based on the\ncourse learning outcomes. The course is assessed by a demonstrable system and project\ndocumentation, which form the basis for an examination where questions are asked\nabout the submitted artifacts.\nFurthermore, in order to assure individual grading, each student is required to traceably\n(i.e. with visible support that is possible to grade) show and argue for his or her:\n• artifact contributions to the project and subgroup he/she was a member of\n• role in the project group,\n• fulfillment of responsibilities for this role in terms of artifacts and activities,\n• interaction and knowledge transfer activities with others, and\n• how this contributed to the project as a whole.\nStudents might be required to complete self- and peer-assessment forms during the\ncourse.\nIn case a student fails the project, one individual re-examination is provided. In case of\nfailing that re-examination, the student has to join a new project group.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nThe final grades are given after reviewing the artifacts and oral examination results.\nTo receive the grade Pass with Distinction (VG), the emphasis is on constructive\nownership on a group and/or project level throughout the entire project course.\nOwnership implies documented expertise or integration contribution that is vital for\ngroup and/or project success.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "Course literature to be announced the latest 8 weeks prior to the start of the course. It is\nalso up to the students to identify and address such needs based on their particular\nproject focus.\nThe course replaces the course DIT168, 15 credits. The course cannot be included in a\ndegree which contains DIT168. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT168 is included."
  }
}