{
  "metadata": {
    "source_document": "DIT862.pdf",
    "course_code": "DIT862",
    "course_title": "Statistical Methods for Data Science",
    "swedish_title": "Statistiska metoder för Data Science",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Data Science",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2018-02-02",
    "valid_from_date": "2018-11-05",
    "programmes": [
      "Applied Data Science Master's Programme (N2ADS)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2018-02-02 and was last revised on 2018-09-27 to be valid from 2018-11-\n05, autumn semester of 2018.",
    "Position in the educational system": "The course is compulsory within the Applied Data Science Master's Programme. It is\nalso a single subject course at the University of Gothenburg.\nThe course can be part of the following programme: 1) Applied Data Science Master's\nProgramme (N2ADS)",
    "Entry requirements": "To be eligible to the course, the student should have a Bachelor's degree in any subject,\nor have successfully completed 90 credits of studies in computer science, software\nengineering, or equivalent. Specifically, the course requires the following:\n• at least 15 credits of successfully completed courses in programming,\n• one of the courses DIT851 Introduction to Data Science, 7.5 credits, or\nDIT856 Applied Mathematical Thinking, Master course, 7.5 credits, alternatively at\nleast 7.5 credits of mathematics.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student should be able to:\nKnowledge and understanding\n•\naccount for basic notions of probability theory and statistical theory, with an\nemphasis on applications and experiments in data science\n• give examples of how probabilistic models are applied in data science applications\nCompetence and skills\n•\n•\ncompute descriptive statistics and visualizations using statistical software libraries\n• implement a number of probabilistic models and apply them in data science\napplications\napply statistical tests for evaluating data science applications\nJudgement and approach\n• justify which type of statistical method is applicable for the most common types of\nexperiments in data science applications\n• discuss advantages and drawbacks of different types of probabilistic models that can\nbe applicable for a given data science application\n• discuss how the misuse of statistical techniques can lead to dubious conclusions",
    "Course content": "The course gives an introduction to the theory of probability and statistics, data analysis\nusing descriptive statistics and data visualization, and applications of probabilistic\nmodeling in data science.\nIn the course, the following broad areas will be covered:\n• data analysis including descriptive statistics and data visualization\n• probability theory including basic probability calculations, random variables,\ndistributions\n• statistical methods including point and interval estimates, hypothesis testing,\nregression\n• probabilistic models in data science applications, for instance, Naive Bayes\nclassifiers and topic models for text or Hidden Markov Models for sequences",
    "Sub-courses": "1. Take-home examination (Hemtentamen), 4 credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)\n2. Assignments (Inlämningsuppgifter), 3.5 credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)",
    "Form of teaching": "Lectures, exercise sessions, computer lab sessions.",
    "Assessment": "The course is examined by an individual written take-home exam, as well as mandatory\nwritten assignments submitted as written reports, some of which will be carried out\nindividually and others in groups of normally 2-4 students.\nThere will be non-obligatory individual assignments which grant bonus points for the\nwritten exam. These bonus points are valid for the whole academic year.\nLate submission of the take-home exam results in the grade Fail (U), unless special\nreasons exist. A failed take-home exam is reexamined by a new take-home exam.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nA Pass grade (G) for the entire course requires at least a Pass grade for all sub-courses.\nTo be awarded Pass with Distinction (VG) for the full course, the grade VG must be\nobtained on both the sub-courses.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "Course literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT861, 7.5 credits. The course cannot be included in a\ndegree which contains DIT861. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT861 is included."
  }
}