{
  "metadata": {
    "source_document": "DIT841.md",
    "course_code": "DIT841",
    "course_title": "Project Management",
    "swedish_title": "Projektledning",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "cycle": "Second cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-11-08",
    "valid_from_date": "Autumn term 2025",
    "programmes": [
      "Software engineering and management, masters programme (N2SOF)"
    ]
  },
  "sections": {
    "Position in the educational system": "The course can be part of the following programmes:\n\n1. Software engineering and management, masters programme (N2SOF)",
    "Entry requirements": "To be eligible for this course, the student must be admitted to the Master’s programme in Software Engineering (N2SOF).\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n_Knowledge and understanding_\n\n- Explain basic project management concepts and tools.\n\n_Competence and skills_\n\n- Apply project management theories to analyze complex industrial project environments and based on this suggest appropriate ways to plan and execute projects\n- Formulate, plan, execute and terminate projects of a not too complicated nature.\n\n_Judgement and approach_\n\n- Frame, analyze and solve managerial problems in project settings showing an advanced analytical understanding of project management.",
    "Course content": "The course is about managing projects. This means that the course provides general knowledge on project management and reflects such knowledge in contingencies occurring when dealing with projects in technology-based firms.\n\nThe course contains both a basic and an advanced component. The basic component provides an understanding about basic concepts and management methods related to project work. The advanced component is based on up-to-date research about complex dynamics and challenges affecting projects, such as self-organizing teams and goal-seeking project environments, political processes and company culture, corporate social responsibility and stakeholder management in projects, collaborations with suppliers and clients in development projects, or knowledge integration and knowledge transfer from project to project.\n\nMany of the course’s themes and topics take their starting point in innovation and development projects.",
    "Sub-courses": "Sub-courses\n\n1. Assignments, 6 credits\n\n\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Assignments, 1,5 credits\n\n\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The course is divided in two phases; the first phase is an overview of the basics of project management, while the second focus on a selected number of problematic areas within project management.\n\nThe teaching activities include lectures and seminars. The seminars require active participation and preparation.\n\n_Undervisningsspråk_: engelska",
    "Assessment": "The course is examined through indiviual case seminar hand-ins, an examination after the completion of the first module, and a written examination at the end of the course. It is mandatory to participate in the case seminars.\n\nIf a student who has been failed twice for the same examination element wishes to change examiner before the next examination session, such a request is to be granted unless there are specific reasons to the contrary (Chapter 6 Section 22 HF).\n\nIf a student has received a certificate of disability study support from the University of Gothenburg with a recommendation of adapted examination and/or adapted forms of assessment, an examiner may decide, if this is consistent with the course’s intended learning outcomes and provided that no unreasonable resources would be needed, to grant the student adapted examination and/or adapted forms of assessment.\n\nIf a course has been discontinued or undergone major changes, the student must be offered at least two examination sessions in addition to ordinary examination sessions. These sessions are to be spread over a period of at least one year but no more than two years after the course has been discontinued/changed. The same applies to placement and internship (VFU) except that this is restricted to only one further examination session.\n\nIf a student has been notified that they fulfil the requirements for being a student at Riksidrottsuniversitetet (RIU student), to combine elite sports activities with studies, the examiner is entitled to decide on adaptation of examinations if this is done in accordance with the Local rules regarding RIU students at the University of Gothenburg.",
    "Grades": "Sub-courses\n\n1. Assignments, 6 credits\n\n\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Assignments, 1,5 credits\n\n\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n\nThe overall course grade is graded with the grading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U).\n\nTo pass the course, both modules need to be passed. Results for the second module (6.0 hp) determine the course grade. Additional bonus points or mandatory activities can be possible if included in the Course PM.\n\nSee more detailed information in the Course PM (available at the latest one week before the start of the course).",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between teachers and student representatives. Further, an anonymous questionnaire is used to ensure written information. The outcome of the evaluations serves to improve the course by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\n\nThe course replaces the course DIT846, 7.5 credits. The course cannot be included in a degree which contains DIT846. Neither can the course be included in a degree which is based on another degree in which the course DIT846 is included."
  }
}