{
  "metadata": {
    "source_document": "DIT857.pdf",
    "course_code": "DIT857",
    "course_title": "Applied Mathematical Thinking, Master course",
    "swedish_title": "Tillämpat matematiskt tänkande, masterkurs",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Data Science",
    "specialization": "AIN, Second cycle, has only first-cycle\ncourse/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2021-11-15",
    "valid_from_date": "2022-08-29",
    "programmes": [
      "Applied Data Science Master's Programme (N2ADS)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2021-11-15 to be valid from 2022-08-29, autumn semester of 2022.",
    "Position in the educational system": "The course is compulsory within the Applied Data Science Master's Programme.\nThe course can be part of the following programme: 1) Applied Data Science Master's\nProgramme (N2ADS)",
    "Entry requirements": "To be eligible to the course, the student should have a Bachelor's degree in any subject.\nSpecifically, at least 7,5 credits of successfully completed courses in programming are\nrequired.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• Explain different aspects of mathematical thinking: mathematical reasoning,\nproblem solving, modelling.\n• Explain how mathematical thinking can be applied in different areas.\n• Explain common mathematical knowledge and how it can be used (including\nfunctions, equations, derivatives and integrals, probability, sets, graphs).\nCompetence and skills\n• Show familiarity with mathematical concepts such as definitions, theorems, as well\nas different kinds of mathematical reasoning and proofs (mathematical reasoning).\n• Solve complex and unknown problems with a structured and investigative approach\n(mathematical problem solving).\n• Investigate real problems, determine if they can be seen from a mathematical\nperspective and translate to mathematical problems, and adapt mathematical\nconclusions to the real problem (mathematical modelling).\n• Communicate about and with the help of mathematics.\n• Use different computational tools and independently write computer programs as a\nnatural part of working mathematically.\nJudgement and approach\n• A good ability to reflect on the nature of mathematical thinking and how it is used\nin different areas.\n• Identify how own thinking can be used to solve a problem, and to what extent\nprevious knowledge can be used.\n• Show a reflective attitude to the course contents and to their own thinking.\n• Show precision, quality and maturity in all work.",
    "Course content": "The course is mainly intended to strengthen the students' mathematical thinking, and\ntheir ability to apply such thinking in applications, and in their continued studies. The\nfocus is not on mathematical knowledge in the traditional sense, but on the often\nimplied abilities needed to effectively be able to apply the mathematics you already\nknow, and efficiently be able to learn new mathematics. The most important parts are\nmathematical reasoning, problem solving and modelling. Important aspects such as\nusing the computer as a part of your mathematical thinking, and to be able to\ncommunicate with and about mathematics are also integrated in the course.\nThe course also in a natural way introduces basic mathematical knowledge useful in\ncomputer science and other areas, including a selection of Swedish upper secondary\ncourses Mathematics 4 and 5.\nBy developing the ability to think mathematically, the course complements other more\ntraditional courses in mathematics, and by providing the student with experience of\ndifferent areas of application, the gap between mathematical theory and relevant\napplications is bridged.\nThe core of the course is a number of carefully selected problems, used as starting points\nfor the student's own learning, where student by working in an investigative way\ndevelop their own abilities. We also have lectures which provide a broader\nunderstanding, follow-up and perspective. The problems illustrate many different areas\nof application, and their level of difficulty is adapted to efficiently practice the abilities\nto think and work mathematically in different situations.\nIn connection with the exercises, we also discuss different problem solving strategies,\nreflect on solutions, and compare different ways to solve the same problem. We also\ngive an orientation about the role of mathematics in various applications and\ndemonstrate the importance of mathematical computer models.\nEvery module includes an extended reflective part where the students reflect and reason\nabout their problem solving in each problem, in order to improve their ability to reflect\nand evaluate, as well as their problem solving skills.\nThe course also includes independent programming tasks.",
    "Sub-courses": "1. Assignments (Inlämningsuppgifter), 7.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The course is mainly organized in modules. For every module there is an introductory\nlecture and a compulsory follow-up lecture providing feedback on the problems of the\nmodule.\nThe learning is supported by an interactive way of teaching with a lot of contact\nbetween students and teachers. This occurs during supervision hours where students\nwork with the problems and regularly discuss with the supervisors. They will then\nreceive individual feedback and guidance in their own problem solving, and develop\ntheir independent abilities.\nLanguage of instruction: English",
    "Assessment": "The course is examined through written assignments and with a final report, where the\nstudents are encouraged to summarize and reflect over the course in a personal way. The\nassignments and the final report are normally written in groups of two persons. In\naddition, each group reads reports from other groups, and discusses them in a final\nseminar.\nTo pass the course, attendance of selected lectures is also required.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nTo pass the course, the assignments and the final report must pass. To get the a higher\ngrade than Pass, a weighted average is required both for the assignments and for the\nfinal report. To pass the final report, the student needs to show a good understanding of\nthe course contents, and the presentation and the content of the report must be correct\nand well written.\nTo get a higher grade than Pass on the report, the student must show a good (for grade\n4) or very good (for grade 5) understanding of the subject, describing own insights and\nshowing particular attention to quality. To pass the assignments the reasoning must be\ncorrect, and of good quality.\nTo get a higher grade than Pass on the assignments, the student must show a good (for\ngrade 4) or very good (for grade 5) understanding of the subject, describing own insights\nand showing particular attention to quality.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "As the exercises are the most important in the course, there is no course literature in the\ntraditional sense. For handouts and further reading, see the course's website.\nThe course replaces the course DIT856, 7.5 credits. The course cannot be included in a\ndegree which contains DIT856. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT856 is included.\nThe course cannot be included in a degree which contains DIT993 or DIT026. Neither\ncan the course be included in a degree which is based on another degree in which the\ncourse DIT993 or DIT026 is included."
  }
}