{
  "metadata": {
    "source_document": "DIT828.pdf",
    "course_code": "DIT828",
    "course_title": "Software Innovation",
    "swedish_title": "Mjukvaruinnovation",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "15",
    "cycle": "First Cycle",
    "main_field_of_study": "Software Engineering",
    "specialization": "G1F, First cycle, has less than 60 credits in first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2022-11-23",
    "valid_from_date": "2023-08-28",
    "programmes": [
      "Software Engineering and Management Bachelor's Programme (N1SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2022-11-23 to be valid from 2023-08-28, autumn semester of 2023.",
    "Position in the educational system": "The course is offered within the Software Engineering and Management Bachelor's Programme.\nThe course can be part of the following programme: 1) Software Engineering and Management Bachelor's Programme (N1SOF)",
    "Entry requirements": "To be eligible for this course, students must have at least 75 hp in software engineering and have successfully completed at least a 7.5 credits project course and DIT633 (or equivalent).\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student is expected to:\nKnowledge and understanding\n• explain a project's working practices and scheduling, and reporting of the\ninnovation challenge\n• describe the context of research or industrial innovation problems\n• explain how the project relates to Sustainable Development Goals\nCompetence and skills\n• apply and use software development knowledge and skills to develop a solution for\na research or industrial problem\n• collaborate with external stakeholders on an innovation challenge\n• create a demo or a prototype of a product, service, or other innovation, using agile\ndevelopment practices, design, and product research methods\n• present project outcomes orally and in writing\nJudgement and approach\n• reflect on the challenges and opportunities of working in a context of research or\nindustrial innovation\n• reflect on the project's (and its results) impact on sustainable development (e.g.\nSustainable Development Goals)",
    "Course content": "In this project course, the students are given the opportunity to work on innovation\nideas provided by industrial companies or research projects.\nStudents normally work together in groups to design and implement a product (or\nservice) prototype. The project is challenging, and requires the students to collaborate\nand organize their work efficiently. There is little external steering in this project, the\nstudents are responsible for the overall planning and setting their own internal deadlines\nin order to finish the project on time.",
    "Sub-courses": "1. Project (Projekt), 15 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The teaching consists of introductory lectures, weekly meetings, seminars, as well as\nsupervision in connection to the meetings.\nLanguage of instruction: English",
    "Assessment": "The course is examiner through a written report in group, oral presentation in group and oral examination. Every student has to provide an individual report/account which shows:\n• student's contribution to the artefacts in the project and to the group's work\n• role in the project,\n• description of his/her responsibility with respect to the role in the project, its artefacts and activities,\n• interaction and knowledge transfer activities with others, as well as\n• how the she/he contributed to the project in general\nTo pass the course, the students has to provide self-assessment and the assessment of the colleagues from the group either during the course or at the examination seminar. This assessment is part of the examination in the course.\nIn the case when a student fails the examination, the student can do an individual re-exam. In the case of failing the re-exam, the student must start in another group.\nIf a student, who has failed the same examined component twice, wishes to change examiner before the next examination, a written application shall be sent to the department responsible for the course and shall be granted unless there are special reasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the student shall normally be guaranteed at least three examination occasions (including the ordinary examination) during a period of at least one year from the last time the course was given.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U).\nTo obtain 3, the student must show acceptable solution to the problem addressed in the project, acceptable contribution to the group and he/she needs to be able to answer the majority of questions in the examination.\nTo obtain 4, the student must (in addition to the above) show good knowledge of both the solution and design/architecture choices; the student needs to show that he/she took more than just one role in the project and that he/she is able to reason about the role of innovation in the project and in the surrounding society.\nTo obtain 5, the student must (in addition to the above) show exceptional skills related to innovation that are used in the project, the impact of the innovation on the society and sustainability as well as show technical or project-related leadership in the project.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course. It is also up to the students to identify and address such needs based on their particular project focus.\nThe course replaces the course DIT827, 7.5 credits. The course cannot be included in a degree which contains DIT827. Neither can the course be included in a degree which is based on another degree in which the course DIT827 is included."
  }
}