{
  "metadata": {
    "source_document": "DIT930.pdf",
    "course_code": "DIT930",
    "course_title": "Advanced databases",
    "swedish_title": "Avancerade databaser",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science, Data Science",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2020-11-13",
    "valid_from_date": "2022-01-17",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2020-11-13 to be valid from 2022-01-17, spring semester of 2022.",
    "Position in the educational system": "The course is part of several programs and is also a single-subject course at Gothenburg University.\n\nThe course can be part of the following programmes: 1) Computer Science, Master's Programme (N2COS), 2) Applied Data Science Master's Programme (N2ADS) and 3) Software Engineering and Management Master's Programme (N2SOF)",
    "Entry requirements": "To be eligible to the course, the student should have a Bachelor's degree in any subject, or have successfully completed 90 credits of studies in computer science, software engineering, or equivalent. Specifically, at least 15 credits of successfully completed courses in programming or equivalent are required. The student also needs to have attended a course in databases of at least 7.5 credits (e.g. DIT621 Databases or DIT032 Data management).\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\nKnowledge and understanding\n• describe concepts relating to the implementation of database management systems\n• compare and contrast features of relational and non-relational database management systems\n\nCompetence and skills\n• construct Web ontology language statements corresponding to an Entity- Relationship diagram\n• construct RDF (Resource Description Framework) triples that contain data for a given domain\n• implement a graph database for a given domain\n• retrieve data using declarative query languages for graph databases\n\nJudgement and approach\n• discuss advantages and disadvantages of different database design decisions\n• discuss advantages and disadvantages of alternative query plans\n• discuss suitability of different database management systems for various tasks",
    "Course content": "Course contents:\n\n• database management system architecture and implementation\n• concurrency and recovery\n• indexes\n• query processing and optimization\n• Semantic Web; RDF; RDF Schema; SPARQL\n• ontologies - NoSQL systems; aggregation-orientation; CAP theorem\n• querying graph databases\n• database applications",
    "Sub-courses": "1. Written hall examination (Skriftlig salstentamen), 4.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n\n2. Assignments (Inlämningsuppgifter), 3 credits\nGrading scale: Pass (G) and Fail (U)",
    "Form of teaching": "The course consists of weekly lectures and exercise sessions, as well as supervised lab sessions.\n\nLanguage of instruction: English",
    "Assessment": "Written individual exam given in an examination hall and programming assignments. The programming assignments are normally carried out in pairs.\n\nA student who has taken two exams in a course or part of a course without obtaining a pass grade is entitled to the nomination of another examiner. The student needs to contact the department for a new examiner, preferably in writing, and this should be approved by the department unless there are special reasons to the contrary (Chapter 6 Section 22 of the Higher Education Ordinance).\n\nIf a student has received a recommendation from the University of Gothenburg for special educational support, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources are required, the examiner may decide to allow the student to sit an adjusted exam or alternative form of assessment.\n\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years, after the course has ceased/been changed. The same applies to placements and professional placements (VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U).\nTo pass the course, students must receive a passing grade in both modules. The grade for the entire course will be determined by the written exam.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between teachers and student representatives. Further, an anonymous questionnaire is used to ensure written information. The outcome of the evaluations serves to improve the course by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\n\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\n\nThe course cannot be included in a degree which contains DIT346, DIT873, DIT872 or DIT871. Neither can the course be included in a degree which is based on another degree in which the course DIT873, DIT872 or DIT871 is included."
  }
}