{
  "metadata": {
    "source_document": "DIT982.pdf",
    "course_code": "DIT982",
    "course_title": "Domain Specific Languages of Mathematics",
    "swedish_title": "Matematikens domänspecifika språk",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "First Cycle",
    "main_field_of_study": "Computer Science",
    "specialization": "G2F, First Cycle, has at least 60 credits in first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2018-03-26",
    "valid_from_date": "2019-01-21",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Mathematical Sciences, Master's Programme (N2MAT)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Bachelor's Programme in Mathematics (N1MAT)",
      "Computer Science, Bachelor's Programme (N1COS)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2014-12-16 and was last revised on 2018-03-26 to be valid from 2019-01-\n21, spring semester of 2019.",
    "Position in the educational system": "The course is offered within the framwork of several degree programmes. The course is\nalso a single subject course at the University of Gothenburg.\n\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Mathematical Sciences, Master's Programme (N2MAT), 3)\nApplied Data Science Master's Programme (N2ADS), 4) Bachelor's Programme in\nMathematics (N1MAT) and 5) Computer Science, Bachelor's Programme (N1COS)",
    "Entry requirements": "The student should have successfully completed:\n- 7.5 hec in discrete mathematics, for example DIT980 Introductory Discrete\nMathematics for Computer Scientists\n- 15 hec in mathematics, for example MMGD20 Linear Algebra D and MMGD30\nCalculus D\n- 15 hec in computer science, for example DIT440 Introduction to Functional\nProgramming or MVG300 Programming with Matlab and DIT012\nImperative Programming with Basic Object-orientation\nAdditional 22.5 hec of any mathematics or computer science courses.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\nKnowledge and understanding\n- design and implement a DSL (Domain Specific Language) for a new domain\n- organize areas of mathematics in DSL terms\n- explain main concepts of elementary real and complex analysis, algebra, and linear\nalgebra\n\nCompetence and skills\n- develop adequate notation for mathematical concepts\n- perform calculational proofs\n- use power series for solving differential equations\n- use Laplace transforms for solving differential equations\n\nJudgement and approach\n- discuss and compare different software implementations of mathematical concepts",
    "Course content": "The course will present classical mathematical topics from a computing science\nperspective: giving specifications of the concepts introduced, paying\nattention to syntax and types, and ultimately constructing DSLs of some\nmathematical areas mentioned below.\n\nThe lecture topics are:\n- Introduction to functional programming and calculational proofs\n- Introduction to Domain Specific Languages (DSLs): case study linear algebra\n- DSLs and mathematics: case study category theory\n- Real analysis: mean value theorems, Taylor formulas\n- Real analysis: a DSL for power series\n- More linear algebra: eigenvalues and optimization",
    "Sub-courses": "1. Written exam (Tentamen), 4 higher education credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)\n2. Written Assignments (Inlämningsuppgifter), 3.5 higher education credits\nGrading scale: Pass (G) and Fail (U)",
    "Form of teaching": "The main forms of instruction are lectures, seminars, case studies and group work\n\nLanguage of instruction: English",
    "Assessment": "The course is examined by an individual written exam which is carried out in an\nexamination hall at the end of the course and by written assignments carried out in\ngroups of normally 3-4 students.\n\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\n\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nIn order to be awarded the grade Pass for the whole course the student needs to get the\ngrade Pass on both the sub-courses.\nTo be awarded the grade Pass with Distinction for the whole course the student needs to\nget the grade Pass with Distinction on the sub-course written exam and the grade Pass\non the sub-course written assignments.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.\nThe results of and possible changes to the course will be shared with students who\nparticipated in the evaluation and students who are starting the course.",
    "Additional information": "The course is a joint course toghether with Chalmers.\n\nCourse literature to be announced the latest 8 weeks prior to the start of the course."
  }
}