{
  "metadata": {
    "source_document": "DIT978.pdf",
    "course_code": "DIT978",
    "course_title": "Advanced Software Engineering for AI/ML-Enabled Systems",
    "swedish_title": "Avancerad programvaruteknik för AI/ML-aktiverade system",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Software Engineering",
    "specialization": "AIN, Second cycle, has only first-cycle\ncourse/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2021-11-02",
    "valid_from_date": "2023-01-16",
    "programmes": [
      "Applied Data Science Master's Programme (N2ADS)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2021-11-02 to be valid from 2023-01-16, spring semester of 2023.",
    "Position in the educational system": "The course can be included in several programs. It is also given as a single subject course\nat the University of Gothenburg.\nThe course can be part of the following programmes: 1) Applied Data Science Master's\nProgramme (N2ADS) and 2) Software Engineering and Management Master's\nProgramme (N2SOF)",
    "Entry requirements": "To be eligible for the course, the student should have a bachelor's degree in Software\nEngineering, Computer Science, Computer Engineering, Information Technology,\nInformation Systems, or equivalent.\nIn addition, the student should have completed courses in:\n• Programming (e.g. DIT042 Object-oriented Programming, DIT012 Imperative\nProgramming with Basic Object-orientation, DIT143 Functional Programming or\nequivalent)\n• A basic course in machine learning (e.g. DIT406 Introduction to data science and\nAI, DIT821 Software Engineering for AI Systems, DIT824 Software Engineering\nfor Data-Intensive AI Applications, or equivalent)\n• A general Software Engineering course (e.g. DIT593 Software engineering principles\nfor complex systems or equivalent) or 6 credits in one or more of the following areas\nof Software Engineering: Software processes and agile development, Software\narchitecture, Software Quality Assurance or Testing, Requirements Engineering\n(e.g. DIT257, DIT347, DIT193, DIT344, DIT291, DIT083, DIT843, DIT046,\nDIT285 or equivalent).\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• Explain processes and engineering practices for developing AI/ML-enabled systems,\nfrom requirements engineering to testing\n• Explain typical roles in software engineering of AI/ML enabled systems as well as\nchallenges in interdisciplinary teams consisting of Data Scientists and Software\nEngineers\n• Explain typical requirements for AI/ML components, such as non-functional\nrequirements, requirements on data, and contextual requirements\n• Explain architectures and patterns for AI/ML-enabled systems\n• Describe existing techniques to verify and explain decisions made by AI/ML-\nenabled systems\n• Give an overview of recent research on SE for AI/ML-enabled systems\nCompetence and skills\n• Read a research paper on software engineering for AI/ML-enabled systems, present\nit's content, and critically discuss the presented research design\n• Demonstrate a software engineering approach for AI/ML-enabled systems with\nappropriate examples\n• Assess new engineering knowledge for AI/ML-enabled systems and relate it to the\nknowledge presented in this course\nJudgement and approach\n• Judge the extent to which an AI/ML component needs to be safe-guarded\n• Judge what verification methods are appropriate when developing an AI/ML-\nenabled system given the requirements o that system\n• Judge whether a model has systematic biases and discuss the consequences of these\nbiases\n• Judge fairness and potential other ethical issues of an AI/ML-enabled system\n• Judge user's information needs to work with an AI-enabled system\n• Judge limitations of a state-of-the-art software engineering approach for AI/ML\ngiven evidence presented in research papers",
    "Course content": "The course will comprise a number of themes with respect to Software engineering of\nAI/ML-Enabled Systems:\n• Processes, Engineering Practices, and Interdisciplinary Teams\n• Requirements Engineering\n• Architectures\n• Verification and Testing\n• Analysis of Failure Cases and Debugging\n• Fairness, Bias, and Ethics\n• User Management and Explaining AI Decisions",
    "Sub-courses": "1. Literature seminars (Litteraturseminarier), 7.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The course is provided in the form of a literature seminar, which combines reading\npapers, student presentations, and discussions. Students will explore one of the topics in\ndetail and gain more summative knowledge in the other topics. An individual report is\nthe final element of the course.\nLanguage of instruction: English",
    "Assessment": "The examination consists of an individual presentation. In addition an active\nparticipation and contribution to discussions is required as well as an individual report.\nA student who has taken two exams in a course or part of a course without obtaining a\npass grade is entitled to the nomination of another examiner. The student needs to\ncontact the department for a new examiner, preferably in writing, and this should be\napproved by the department unless there are special reasons to the contrary (Chapter 6\nSection 22 of the Higher Education Ordinance).\nIf a student has received a recommendation from the University of Gothenburg for\nspecial educational support, where it is compatible with the learning outcomes of the\ncourse and provided that no unreasonable resources are required, the examiner may\ndecide to allow the student to sit an adjusted exam or alternative form of assessment.\nIn the event that a course has ceased or undergone major changes, students are to be\nguaranteed at least three examination sessions (including the ordinary examination\nsession) over a period of at least one year, but no more than two years, after the course\nhas ceased/been changed. The same applies to placements and professional placements\n(VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nTo pass the course, all mandatory components must be passed. To earn a higher grade\nthan Pass, a higher weighted average from the grades of the components is required.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course."
  }
}