{
  "metadata": {
    "source_document": "TIA013.pdf",
    "course_code": "TIA013",
    "course_title": "Organizing for Digital Transformation",
    "swedish_title": "Organisering för digital omvandling",
    "department": "Department of Applied Information Technology",
    "field_of_education": "Science 100%",
    "credits": "15",
    "cycle": "Second Cycle",
    "main_field_of_study": "Informatics",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2018-01-30",
    "valid_from_date": "2021-03-25",
    "programmes": [
      "Applied Data Science Master's Programme (N2ADS)",
      "Digital Leadership Master's Programme (N2DIG)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Applied Information Technology on 2018-01-30 and was last revised on 2021-01-21 to be valid from 2021-03-25, spring semester of 2021.",
    "Position in the educational system": "The course is a compulsory course in the Digital Leadership Master's Programme and an elective course in the other programmes specified below.\nThe course can be part of the following programmes: 1) Applied Data Science Master's Programme (N2ADS), 2) Digital Leadership Master's Programme (N2DIG) and 3) Software Engineering and Management Master's Programme (N2SOF)",
    "Entry requirements": "Bachelor Degree 180 credits. Additionally English proficiency should be equivalent to the level of English 6/English Course B from Swedish Upper Secondary School.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• (1) describe and discuss how new technology and digital transformation impacts organizations, organizing and leadership;\n• (2) explain main concepts and theories related to organizational change and digital transformation;\nCompetence and skills\n• (3) analyze challenges and possibilities related to organizational change and digital transformation;\n• (4) apply relevant frameworks and models to real world cases of digital transformation;\n• (5) formulate organizational change initiatives that enable digital transformation, with a special focus on the human dimensions of change processes;\nJudgement and approach\n• (6) evaluate the social and technological implications of digital transformation;\n• (7) critically evaluate existing theories and concepts related to digital transformation;\n• (8) assess the ethical implications of organization change and digital transformation.\nThe course is sustainability-related, which means that at least one of the learning outcomes clearly shows that the course content meets at least one of the University of Gothenburg's confirmed sustainability criteria.",
    "Course content": "Leading digital change requires leadership that reaches beyond formulaic IT management and ‘best practice' recipes. Preparing for the changes that digitalisation means, demands an ability to understand the relationship between leadership, employees, structure, culture and vision, ie the human aspects of organizing.\nThis course provides students with a broad understanding of technological changes, digital transformation and organizational change, as well as how change can be managed. Theory is compared and contrasted with case studies from industry and public sector. The focus is on the practical application of theory, where students are trained to independently analyze theory and concrete situations of ongoing activities and their individual experiences of change. An underlying aim of this course is to develop the students' capabilities to effectively analyze and jointly solve complex challenges related to digital transformation and change.",
    "Sub-courses": "The course is structured around two modules:\n• Theory and concepts: Lectures, seminars, case analysis and guest lectures exploring theories of digital disruption, transformation and change management.\n• Change Project: Apply theory on a real context problem/challenge. This includes visualization, team work and theoretical embeddedness.",
    "Form of teaching": "The teaching includes lectures, seminars and supervised group work.\nLanguage of instruction: English",
    "Assessment": "The module 'Concepts and theory' is examined through a number of seminars with associated assignments (2,5 credits) as well as an individual take home exam (5 credits). This examination is linked to learning outcomes 1, 2 and 7.\nThe module 'Change Project' is examined with a written group report and oral presentation of the project results (7,5 credits). This examination is linked to learning outcomes 3, 4, 5, 6 and 8.\nAbsence from a compulsory activity is replaced with similar activity or alternative task that corresponds to the content of the activity.\nA student who has taken two exams in a course or part of a course without obtaining a pass grade is entitled to the nomination of another examiner. The student needs to contact the department for a new examiner, preferably in writing, and this should be approved by the department unless there are special reasons to the contrary (Chapter 6Section 22 of the Higher Education Ordinance).\nIf a student has received a recommendation from the University of Gothenburg for special educational support, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources are required, the examiner may decide to allow the student to sit an adjusted exam or alternative form of assessment.\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years, after the course has ceased/been changed.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nThe seminars and assignments will be graded Pass (G) or Fail (U).\nThe individual written exam will be graded Pass with Distinction (VG), Pass (G), or Fail (U).\nThe written group report and presentation will be graded Pass with Distinction (VG), Pass (G), or Fail (U).\nFor the grade Pass on the course, Pass is required on the assignments covered in the two modules. To receive the grade Pass with Distinction on the course, Pass with Distinction is required on the individual written exam, and Pass is required on the remaining assignments.",
    "Course evaluation": "Students are to be given the opportunity to communicate their experience and views on the course in an anonymous course evaluation. Evaluations are to be completed electronically. The results of the course evaluation are to be made accessible to students. Processed results of the latest evaluation, including changes made or planned, are also to be made available to participants in the next round of the course. The results of and possible changes to the course will be shared with students who participated in the evaluation and students who are starting the course.",
    "Additional information": ""
  }
}