{
  "metadata": {
    "source_document": "TIA082.pdf",
    "course_code": "TIA082",
    "course_title": "Communication: Interpersonal Communication",
    "swedish_title": "Communication: Interpersonal Communication",
    "department": "Department of Applied Information Technology",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Communication",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2020-06-01",
    "valid_from_date": "2020-08-31",
    "programmes": [
      "Master in Communication (N2CMN)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2010-03-18 and was last revised on 2020-06-01 by Department of Applied Information Technology to be valid from 2020-08-31, autumn semester of 2020.",
    "Position in the educational system": "The course is a compulsory course within the Master in Communication programme. It is an introductory course in the second cycle.\nThe course can be part of the following programmes: 1) Master in Communication (N2CMN), 2) Applied Data Science Master's Programme (N2ADS) and 3) Software Engineering and Management Master's Programme (N2SOF)",
    "Entry requirements": "To be eligible for the course the student must have a university education of 180 hec, of which a minimum of 90 hec in a major subject.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• analyse aspects of spoken and non-verbal human communication;\n\nCompetence and skills\n• understand and produce written transcriptions of embodied communicative events;\n• apply relevant theories and theoretical concepts to a real-world problem in a discussion within the field of specialisation;\n\nJudgement and approach\n• draw on the analysis of spoken and non-verbal human communication in order to evaluate relational aspects of meaning;\n• appreciate and reflect on the value and the challenges of adopting multiple different perspectives to the study of human communication.",
    "Course content": "Like the field of interpersonal communication research, this course's primary object-of-study are bodily forms of communication (e.g. speech, gaze, gesture, facial expression, proxemics) used to communicate relational meanings (e.g. familiarity, emotional disposition, power) in face-to-face, non-mediated, non-institutionalized, small-group communicative contexts. Various types of relation are considered in the course (e.g. familial relations, friend relations, romantic relations, co-worker relations). A particular focus is on relational-development and relational-decay and phenomena central to these (e.g. self-disclosure). In a smaller part, the course reflects a recent development in the interpersonal communication field, considering the effects of technology on interpersonal relationships and contexts, and their important societal consequences (e.g. cyber-bullying and online harassment, identity and 'face', long-distance romantic relationships). An eclectic range of approaches and perspectives is adopted in the course (e.g. linguistics, non-verbal studies, social psychology, ethnography) so as to give as rich as possible consideration to the object-of-study.",
    "Sub-courses": "Module 1. Contribution to a seminar discussion (2.5 credits)\nModule 2. An individually written hall examination (5 credits).",
    "Form of teaching": "The course education is provided through lectures, seminars and hands-on workshops.\nLanguage of instruction: English",
    "Assessment": "The course is examined through two modules:\nModule 1. Contribution to a seminar discussion (2.5 credits)\nModule 2. An individually written hall examination (5 credits).\nA student who has taken two exams in a course or part of a course without obtaining a pass grade is entitled to the nomination of another examiner. The student needs to contact the department for a new examiner, preferably in writing, and this should be approved by the department unless there are special reasons to the contrary (Chapter 6 Section 22 of the Higher Education Ordinance).\nIf a student has received a recommendation from the University of Gothenburg for special educational support, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources are required, the examiner may decide to allow the student to sit an adjusted exam or alternative form of assessment.\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years, after the course has ceased/been changed. The same applies to placements and professional placements (VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nThe grading scale for Module 1 (seminar contribution) is: Pass (G) or Fail (U).\nThe grading scale for Module 2 (individually written hall examination) is: Pass with Distinction (VG), Pass (G) or Fail (U).\nTo get a Pass for the whole course a student should get Pass (G) on both modules. To get a Pass with Distinction (VG) for the whole course a student should get Pass (G) for Module 1 and a Pass with Distinction (VG) for Module 2.",
    "Course evaluation": "After completion of the course the students are to be given the possibility of participating in a course evaluation anonymously. The processed results of the course evaluations are to be made accessible to students and also made available to new students at the beginning of the next course. Possible changes brought about as a result of course evaluations are to be described.",
    "Additional information": ""
  }
}