{
  "metadata": {
    "source_document": "TIA015.pdf",
    "course_code": "TIA015",
    "course_title": "Innovation and entrepreneurship in the digital society",
    "swedish_title": "Innovation och entreprenörskap i det digitala samhället",
    "department": "Department of Applied Information Technology",
    "field_of_education": "Science 100%",
    "credits": "15",
    "cycle": "Second Cycle",
    "main_field_of_study": "Informatics",
    "specialization": "A1N, Second cycle, has only first-cycle\ncourse/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2015-03-19",
    "valid_from_date": "2018-09-03",
    "programmes": [
      "Applied Data Science Master's Programme (N2ADS)",
      "IT Management, Master's Programme (N2ITM)",
      "Digital Leadership Master's Programme (N2DIG)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Applied Information Technology\non 2015-03-19 and was last revised on 2018-06-12 to be valid from 2018-09-03, autumn\nsemester of 2018.",
    "Position in the educational system": "The course is given as a freestanding course.\n\nThe course can be part of the following programmes: 1) Applied Data Science Master's\nProgramme (N2ADS), 2) IT Management, Master's Programme (N2ITM) and 3)\nDigital Leadership Master's Programme (N2DIG)",
    "Entry requirements": "• Degree of Bachelor (180 credits) or\n• The documented professional experience of at least seven years related to IT-\ndevelopment and/or business development or innovation/research and development.\n• English 6/B or the equivalent",
    "Learning outcomes": "The course aims to increase the students' theoretical and practical knowledge of\ninnovation and entrepreneurship in the digital society. On successful completion of the\ncourse the student will be able to:\n\nKnowledge and understanding\n•\naccount for relevant theories of innovation and entrepreneurship;\n•\n•\naccount for which role entrepreneurship and innovation can play in the national\neconomy in general and in the digital society in particular;\naccount for the meaning of sustainable innovation, social entrepreneurship and\nvalue adding from social, economic and ecological perspectives;\n\nCompetence and skills\n•\n• analyse new and established innovation phenomena by demonstrating the ability to\napply theories of entrepreneurship and innovation;\ngenerate, evaluate and develop ideas for innovative economic or nonprofit activities;\n• ability to concretise and communicate creative ideas;\n\nJudgement and approach\n• critically reflect on ethical and social aspects of entrepreneurship and innovation;\n• show analytical ability as well as reflexive and critical thinking in relation to\nestablished theory and practice in innovation and entrepreneurship.",
    "Course content": "The course focuses on the challenges and possibilities met by entrepreneurs and\ninnovators, particularly with regard to digital infrastructures and the radical\ndigitalisation of society. The course gives an overview of classical and modern theories\nof entrepreneurship and innovation in the light of the digitalisation. It also comprises\nelements of practical application in the form of an innovation project that ranges from\nidea to utilisation. The course also draws attention to alternative perspectives on\ninnovation such as gender, sustainability and social entrepreneurship.",
    "Sub-courses": "1. Theory (Teori), 8 higher education credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)\n\n2. Practice (Tillämpning), 7 higher education credits\nGrading scale: Pass (G) and Fail (U)",
    "Form of teaching": "The teaching consists of lectures, seminars and supervision individually or in groups.\nLanguage of instruction: English",
    "Assessment": "Module 1 Theory is assessed based on active participation in compulsory seminars plus\nchairmanship at one seminar, as well as an individual written assignment.\nModule 2 Application is assessed through a written report and an oral presentation.\n\nIf a student, who has failed the same examination component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and it shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\n\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nFor the grade Pass in the course is required that both the modules are passed.\nFor the grade Pass with distinction in the course is required that the module Theory has\nbeen assessed with Pass with distinction and module of Application with Pass.",
    "Course evaluation": "After completion of the course the students are to be given the possibility of\nparticipating in an electronic course evaluation. The result and any changes to the\ncourse will be communicated to the students who carried out the evaluation and to the\nstudents who are to start the course.",
    "Additional information": ""
  }
}