{
  "metadata": {
    "source_document": "TIA066.pdf",
    "course_code": "TIA066",
    "course_title": "Communication: Communication Technology",
    "swedish_title": "Communication: Communication Technology",
    "department": "Department of Applied Information Technology",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Communication",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2010-03-19",
    "valid_from_date": "2019-03-27",
    "programmes": [
      "Master in Communication (N2CMN)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2010-03-19 and was last revised on 2018-11-23 by Department of Applied Information Technology to be valid from 2019-03-27, spring semester of 2019.",
    "Position in the educational system": "The course is a compulsory course within the Master in Communication programme.\nThe course can be part of the following programmes: 1) Master in Communication (N2CMN), 2) Applied Data Science Master's Programme (N2ADS) and 3) Software Engineering and Management Master's Programme (N2SOF)",
    "Entry requirements": "To be eligible for the course the student must have a Bachelor's degree, 180 hec, of which a minimum of 90 hec should be in a major subject.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\nKnowledge and understanding\n• account for the development of human behavior and social experience in relation to communication media;\n• distinguish different communication technologies and relate them to different historical periods;\n• explain key concepts and theories in communication technology;\n\nCompetence and skills\n• apply theoretical concepts and approaches to analyse and compare the practical uses of different communication technologies in various social activities;\n\nJudgement and approach\n• reflect upon the way technology changes;\n• discuss how technology aids human communication in various social activities;\n• constructively criticize methodologies and approaches to the study of communication technology.",
    "Course content": "The course provides students with knowledge of the historical development and social significance of communication technology. The course also familiarizes the students with academic laboratory work in communication technology, and motivates students for future studies within communication technology. The content includes:\n• introduction to the historical development of communication technology and different types of communication technology;\n• description and discussion of the relation between technology, communication and social activities;\n• laboratory experience of communication technology;\n• theoretical and empirical analysis of communication technology in personal and professional communication contexts.",
    "Sub-courses": null,
    "Form of teaching": "The course includes lectures, seminars, workshops, as well as case studies and exercises for problem based learning. Obligatory attendance may be required for certain parts of the course (especially for laboratory work and seminars). When this is the case, it is stated in the course schedule that the students receive at the start of the course.",
    "Assessment": "The course is examined through two modules: Module 1 a group work in oral and written form (3 credits) and Module 2 an individual written assignment (4,5 credits).\nIf a student, who has failed the same examined component twice, wishes to change examiner before the next examination, a written application shall be sent to the department responsible for the course and shall be granted unless there are special reasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the student shall normally be guaranteed at least three examination occasions (including the ordinary examination) during a period of at least one year from the last time the course was given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nModule 1 will be graded Pass (G) or Fail (U). Module 2 will be graded Pass with Distinction (VG), Pass (G) or Fail (U). For the grade Pass (G) on the course, Pass (G) is required on both modules. For the grade Pass with Distinction (VG) on the course, Pass (G) is required on Module 1, and Pass with Distinction (VG) is required on Module 2.",
    "Course evaluation": "After completion of the course the students are to be given the possibility of carrying out an evaluation of the course anonymously. The processed results of the course evaluations are to be made accessible to students and also made available to new students at the beginning of the next course. Possible changes brought about as a result of course evaluations should be described.",
    "Additional information": null
  }
}