{
  "metadata": {
    "source_document": "TIA010.pdf",
    "course_code": "TIA010",
    "course_title": "Innovation Strategy for the Digital Economy",
    "swedish_title": "Innovationsstrategi i det digitala industrisamhället",
    "department": "Department of Applied Information Technology",
    "field_of_education": "Science 100%",
    "credits": "15",
    "cycle": "Second Cycle",
    "main_field_of_study": "Informatics",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2014-06-25",
    "valid_from_date": "2018-01-30",
    "programmes": [
      "Applied Data Science Master's Programme (N2ADS)",
      "IT Management, Master's Programme (N2ITM)",
      "Digital Leadership Master's Programme (N2DIG)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Applied Information Technology\non 2014-06-25 and was last revised on 2018-01-30 to be valid from 2018-01-30, spring\nsemester of 2018.",
    "Position in the educational system": "The course can be given as a free-standing course.\n\nThe course can be part of the following programmes: 1) Applied Data Science Master's\nProgramme (N2ADS), 2) IT Management, Master's Programme (N2ITM) and 3)\nDigital Leadership Master's Programme (N2DIG)",
    "Entry requirements": "• Bachelor degree (180 hp) or\n• At least seven years documented work experience from IT development and/or\nbusiness development.\n• English proficiency should be equivalent to the level of English Course B from\nSwedish Upper Secondary School.",
    "Learning outcomes": "After passing the course the student should be able to:\nKnowledge and understanding\n• Describe and explain the rationale and logic behind traditional industrial\ninnovation.\n• Describe and explain fundamental material properties of digital technology\nand analyze how these properties interfere with the logic of traditional industrial\ninnovation.\n\nCompetence and skills\n• Develop sustainable innovation strategies for digital products.\n• Analyze the implications of digitalization on markets, organizations, and\ntechnological design.\n\nJudgement and approach\n• Compare and differentiate industrial innovation and digital innovation.\n• Evaluate sustainable innovation strategies for digital products.",
    "Course content": "This course focus on the different challenges facing industrial organizations as they seek\nto capitalize on digital technology. The course provides in-depth knowledge of inherent\ntensions, similarities and differences that exists between traditional industrial innovation\nand digital innovation and also the understanding of fundamental properties of digital\ntechnology. Furthermore, the course also provides skills and ability to analyze, design\nand evaluate alternative strategies for building sustainable digital innovation practices in\nindustrial settings.\n\nThe course consists of two sub-courses structured in blocks.",
    "Sub-courses": "1. Theory (Teori), 7.5 higher education credits\nGrading scale: Pass (G) and Fail (U)\n• Industrial innovation\n• Digitalization\n• Digital innovation\n• Innovation strategy\nThe sub-course have lectures and seminars with related discussions in the course's\nelectronic learning platform and workshops to communicate, monitor and\nstimulate the student's understanding of the theoretical contents of the blocks.\n\n2. Application (Tillämpning), 7.5 higher education credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)\n• Industrial case study\n• Writing assignment\nThe sub-course provides tutoring in analyzing the consequences of digitalization\nand development and evaluations of sustainable innovation strategies for digital\nproducts. The students will be doing a case study and will take part in an poster\nexhibition.",
    "Form of teaching": "The course will apply formative assessment as a tool for learning in all forms of\nteaching. Therefor the student is expected to contribute actively to their own and others'\nlearning in all parts of teaching.\n\nThe teaching is taught through lectures, seminars, workshops, discussions in the course's\nelectronical platform, tutoring and taking part in an poster exhibition.",
    "Assessment": "The sub-course Theory is assessed through individual minute papers, active\nparticipation in the related seminar, discussion in a digital forum and with an oral\nexamination in group that is recorded.\nA minute paper describes a particularly interesting term or concept that has been\ndiscussed during a session and identifies a yet unexplored topic. The course contains up\nto 20 minute papers, submitted online after the session. In cases where students have not\nattended a session, the minute papers shall be written with explicit references to the\ncourse literature.\n\nThe sub-course Application is assessed through an industrial case study, a written\nassignment reflecting on the case study, examination of two other students written\nassignments and participation in a poster exhibition.\n\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\n\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\n\nThe sub-course Theory is graded with Pass (G) or Fail (U). The sub-course Application\nis graded Pass with distinction (VG), Pass (G) or Fail (U).\nIn order to receive Pass on the whole course, Pass is required for both sub-courses. In\norder to receive Pass with distinction on the whole course, Pass is required for the sub-\ncourse Theory and Pass with distinction (VG) is required for the sub-course\nApplication.",
    "Course evaluation": "After completion of the course the students are to be given the opportunity to\nparticipate in a course evaluation electronically. The result of the course evaluation is to\nbe made accessible to the students. The next time the course is given the processed result\nof the course evaluation is to be presented to the students including possible changes\nbrought about as a result of the course evaluation.",
    "Additional information": "The course is given at half speed."
  }
}