{
  "metadata": {
    "source_document": "TIA114.pdf",
    "course_code": "TIA114",
    "course_title": "Tabletop Computing",
    "swedish_title": "Tabletop Computing",
    "department": "Dep of Applied Information Technology",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design, Computer Science-Interaction Design",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2014-03-13",
    "valid_from_date": "2014-03-13",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Applied Information Technology\non 2014-03-13 to be valid from 2014-03-13, spring semester of 2014.",
    "Position in the educational system": "The course is provided as a part of the Computer Science Master's Programme N2COS.\nThe course is also offered as a programme course in the Computer Science Bachelors\nProgramme N1COS. Please note the entrance qualifications for programme students in\nN1COS below for this course. The course is also offered as a single subject course.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS) and 2) Computer Science, Bachelor's Programme (N1COS)",
    "Entry requirements": "To be eligible for the course the student must have a Bachelor degree of 180 credits.\nSpecial requirements are Object-\noriented Software Development 7.5hp and at least one of the\ncourses TIG095 Human Computer Interaction 7.5hp and TIG091\nDesign and construction of graphical interfaces 7.5hp. To be eligible for this course as a\nprogramme student in Science Bachelors Programme N1COS, the student must have\npassed at least 90 credits in programme courses including one of the courses Human\nComputer Interaction (TIG095) 7.5 credits and TIG091\nDesign and construction of graphical interfaces 7.5hp.",
    "Learning outcomes": "After completion of the course the student is expected to be able to\nKnowledge and understanding\n• Describe how computional technology can be used as a material for design of\ninteractive systems\n• Describe how knowledge about human cognition and motor skills can guide the\ndesign and evaluation of tabletop user interfaces\n• Describe and draw on theory and history of tabletop interaction.\nSkills and abilities\n• Design and realize interactive prototypes using tabletop interface components\n• Reflect on the relation between spatiality, form, and temporality in tabletop\ninteraction design.\nJudgement and approach\n• Criticize and discuss computer-based tabletop artifacts\n• Question in what way tabletop user interfaces are shaping our present and future\nsociety and way of life.",
    "Course content": "Tabletop interaction deals with computational technology and services offered in\ninteractive, horizontal tables. The course offers both theoretical and practical\neducational modalities. Lectures will present theory and development of Tabletop\nintraction and draws from research and commercial practice.",
    "Sub-courses": null,
    "Form of teaching": "Language of instruction: English",
    "Assessment": "Educations is performed through exercises, group project and a written individual essay.\nAssessment is based on a group project performed in the studios, as well as an individual\nhome essay.\nThe project is examined through a demo and a written report.",
    "Grades": "The grading scale comprises: Fail (U), Pass (G), Pass with Distinction (VG).\nTo get Pass with distiction for the whole course that the student should get Pass with\ndistinction (VG) for the both project assignment, and written and oral assignments.",
    "Course evaluation": "After completion of the course the students are to be given the possibility of\nparticipating in course anonymously. The processed results of the course evaluations are\nto be made accessible to students and also made available to new students at the\nbeginning of the next course. Possible changes brought about as a result of course\nevaluations to be described.",
    "Additional information": ""
  }
}