{
  "metadata": {
    "source_document": "TIA360.md",
    "course_code": "TIA360",
    "course_title": "Work",
    "swedish_title": "Arbete",
    "department": "Department of Applied Information Technology",
    "credits": "7.5",
    "cycle": "Second cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-06-11",
    "valid_from_date": "Autumn Semester 2024",
    "programmes": [
      "Digital Leadership Master's Programme (N2DGL)"
    ]
  },
  "sections": {
    "Position in the educational system": "The course is an optional course in Digital Leadership Master's Programme (N2DGL).",
    "Entry requirements": "Bachelor’s degree 180 credits and English 6/English B from Swedish Upper Secondary School or equivalent.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n_Knowledge and understanding_\n\n1\\. describe the key developments in digital transformation in the workplace, and how digital transformation changes what we do at work and how we do it;\n\n2\\. explain concepts and theories relevant to digital work, and how they are related to practice;\n\n_Competence and skills_\n\n3\\. analyze and evaluate the design of digital technology for work and its impact on the workplace;\n\n4\\. evaluate different modes of human-technology collaboration at work and their significance on the work process;\n\n_Judgement and approach_\n\n5\\. critically assess the applicability of different digital transformation approaches to work in various contexts;\n\n6\\. critically reflect on choices of technology and approaches to implement it in the workplace.",
    "Course content": "In this course, students will learn about key developments related to digital work including work technology, new forms of work, work design, and digital workplace management. Digital technology has a profound impact on work. Recent technological advances facilitated globally distributed workplaces, automation of increasingly complex cognitive work, and profound changes in how we see the content of work, employment relationships, and the concept of the workplace itself. Amidst these tectonic shifts, it is critical to understand how technology and management practices shape the direction of the workplace of tomorrow. This is the central focus of the course. Students will learn the current developments in the digital transformation of work, key concepts and theories to comprehend and evaluate these developments, and industrial best practices used to deal with the transformation. The students will also engage in central debates related to the future direction of digital work.",
    "Sub-courses": "Work, 7.5 Credits",
    "Form of teaching": "The course includes interactive lectures, seminars, and group work to facilitate in-depth analysis of complex issues related to digital work.\n\nLanguage of instruction: English",
    "Assessment": "An overall assessment is made based on two major components:\n\n1\\. Individual exam\n\n2\\. Weekly tasks - Students will be given tasks to complete related to the content andactivities of the week.\n\nIf a student who has twice received a failing grade for the same examination component wishes to change examiner ahead of the next examination session, such a request should be made to the department in writing and should be approved by the department unless there are special reasons to the contrary (Chapter 6 Section 22 of the Higher Education Ordinance).\n\nIf a student has received a recommendation from the University of Gothenburg for study support for students with disabilities, the examiner may, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources are required, decide to allow the student to sit an adjusted exam or alternative form of assessment.\n\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years after the course has ceased/been changed. The same applies to internships and professional placements (VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass (G) and Fail (U).\n\nIn order to pass the course, students are required to pass each of the two components.",
    "Course evaluation": "After completion of the course the students are to be given the opportunity to participate in a course evaluation electronically. The result of the course evaluation is to be made accessible to the students. The next time the course is given the processed result of the course evaluation is to be presented to the students including possible changes brought about as a result of the course evaluation.",
    "Additional information": null
  }
}