{
  "program_code": "N1SOF",
  "number_of_credits": 180,
  "confirmation": "This programme syllabus was confirmed by the IT Faculty Board on 05-10-2020 (GU 2020/2333) and was last revised on 16-06-2023 (GU 2023/1727) to be valid from 02-09-2024, Autumn semester 2024. Responsible Department/equivalent: Department of Computer Science and Engineering",
  "purpose": "By designing smart and efficient IT-solutions we can influence the future of peoples' lives. People who – with the help of technology and management – create innovative products are sought after around the world. The aim of the programme in Software Engineering and Management is to provide students with theoretical knowledge and practical skills required in a knowledge-intensive and changing IT industry. The Software Engineering and Management programme is about methods and techniques for developing computer applications, asking the right questions to the customer, translating customer answers into design and managing projects, organizations and development teams. The programme will help students to develop good technical skills, the capability to analyze a problem, the ability to estimate time and cost for a larger development project and the capacity to communicate and interact with customers and other partners in a big software development project. Students will be confronted with engineering and management problems from all areas of software engineering: 'how do large organizations specify software?', 'how can they ensure sound architectures?', 'what language tools and platforms are available to realize software?', 'how is quality obtained and managed?', 'what are the challenges of decade long software lifetimes?', and 'how to act in an industrial development context?'. The programme is international and open to students from around the world. The programme offers the students a technical and social environment in which they apply and develop both theoretical knowledge and practical skills. The programme has tight relationship to the IT industry and the students are introduced to realistic problems experienced in the IT industry. Within the courses and projects we collaborate with practitioners from industry and the students are introduced to guest lecturers, supervisors and workshops from industry. The close relationship to industry is an important profile of the programme. Our students are offered an academic environment in which theoretical knowledge is important – and at the same time an environment in which they grow as professional practitioners. After completing the programme the student is suited for working in the IT industry in professions as for example system developers, programmers or testers.",
  "entry_requirements": {
    "general_requirements": "General entrance requirements for university studies and the Swedish upper secondary courses English 6, Mathematics 3b/3c or equivalent.",
    "specific_entry_requirements": "Within the study programme there can be specific entry requirements for admission to individual courses. These specific entry requirements are documented in each course syllabus and state which entry requirements are necessary to be registered on a course within the study programme.",
    "selection": "Selection is according to the Higher Education Ordinance and the University of Gothenburg admission regulations for education on first and second cycle."
  },
  "main_field_of_study": "Software Engineering",
  "outcomes": {
    "general_outcomes": {
      "knowledge_and_understanding": "For a Degree of Bachelor the student shall demonstrate knowledge and understanding in the main field of study, including knowledge of the disciplinary foundation of the field, knowledge of applicable methodologies in the field, specialised study in some aspect of the field as well as awareness of current research issues.",
      "competence_and_skills": "For a Degree of Bachelor the student shall demonstrate the ability to search for, gather, evaluate and critically interpret the relevant information for a formulated problem and also discuss phenomena, issues and situations critically; demonstrate the ability to identify, formulate and solve problems autonomously and to complete tasks within predetermined time frames; demonstrate the ability to present and discuss information, problems and solutions in speech and writing and in dialogue with different audiences, and demonstrate the skills required to work autonomously in the main field of study.",
      "judgement_and_approach": "For a Degree of Bachelor the student shall demonstrate the ability to make assessments in the main field of study informed by relevant disciplinary, social and ethical issues; demonstrate insight into the role of knowledge in society and the responsibility of the individual for how it is used, and demonstrate the ability to identify the need for further knowledge and ongoing learning."
    },
    "local_outcomes": {
      "knowledge_and_understanding": "For a Degree of Bachelor of Science with a major in Software Engineering the student shall explain the basic concepts of programming languages, understand the various factors affecting the success of a software development project, know about project and time management techniques, which may be used to achieve software engineering objectives, know about effective methods, techniques, and tools to design and implement software projects, explain the role of team work in software development, describe the various phases of software development life cycles, explain, analyze, and discuss how central concepts/models within leadership theory can be applied in software development teams/organizations, and understand the importance and role of ethics in software engineering.",
      "competence_and_skills": "For a Degree of Bachelor of Science with a major in Software Engineering the student shall apply problem-solving and analytical skills to software development, express and assess computer programs algorithmically, work effectively in different phases of software development life cycle, be able to analyze requirements of computing problems and design solutions, construct, test and document software systems, be effective member of a software development team, use appropriate programming languages and diagramming techniques to develop high quality software systems using a variety of software tools and technologies, establish and apply metrics to determine the readiness, quality, and operability of software, systems and products, develop high quality products and solutions in various domains such as embedded systems, web, and distributed systems, work effectively on open-ended software development problems using suitable theories and methods, and identify, investigate and critically assess published work in software engineering.",
      "judgement_and_approach": "For a Degree of Bachelor of Science with a major in Software Engineering the student shall demonstrate theoretical and practical knowledge of designing, developing and assessing software systems against their design requirements, and demonstrate knowledge and understanding of programming fundamentals, software development methods and tools, development environments, and human factors of software development."
    }
  },
  "content_and_structure": {
    "general_overview": "The programme consists of courses in Software Engineering and Software Management. The programme includes a total of 180 credits. Of these are 150 credits compulsory courses within the main field of study Software Engineering, including 15 credits independent project (degree project). Furthermore, the programme includes a maximum of 30 credits of optional courses. A key element of the curriculum is the focus on problem-based and project-based learning. Students work on broad and complex problem definitions and they learn to structure and solve bigger problems by dividing them into smaller tasks. All students are trained in taking responsibility for their learning and the teachers, supervisors and the educational environment are all resources in this process. Each term students break out into groups to work on a project that develops or applies IT to a significant social or organizational problem. This approach allows students to work on large projects that provide them with the opportunity to create a realistic, team-oriented work environment in which they learn different roles such as, for example, project manager, software architect, quality manager and system developer. An important skill that our students are trained in is the ability to work in groups and to find their role in a project group. The education is given in English at full time and is conducted in the form of lectures, seminars, teacher-led exercises, and supervision in connection to the exercises as well as projects in which students apply and deepen their knowledge. All literature and communication is in English. The curriculum is taught over six academic terms spanning three years. Each academic year includes two terms. The extent of each term is 30 credits. Each term is divided into two study periods, each of 15 credits. In most study periods, students attend two courses in parallel. Each of the six terms has a specific theme that influences both the courses and the term project.",
    "study_process": "The first two years of the programme consist of compulsory courses in Software Engineering. During the third year the student can choose optional courses within or outside the main field of study. Progression in the programme is based on the results in previous courses and projects. To graduate from the programme in the main field of study students must successfully complete all compulsory programme courses. The following compulsory courses are included in the programme: Discrete Mathematics, 7.5 credits; Fundamentals of Programming, 7.5 credits; Object-Oriented Programming, 7.5 credits; Project: Agile Software Project Management, 7.5 credits; Data Management, 7.5 credits; Requirements Engineering, 7.5 credits; Data Structures and Algorithms, 7.5 credits; Project: Systems Development, 7.5 credits; Fundamentals of Software Architecture, 7.5 credits; Distributed Systems, 7.5 credits; Human-Computer Interaction, 7.5 credits; Project: Web Engineering, 7.5 credits; Development of Embedded and Real Time Systems, 7.5 credits; Software Quality and Testing, 7.5 credits; Project: Data-Driven Software Engineering for Cyber Physical Systems, 7.5 credits; Advanced Programming, 7.5 credits; Management and Leadership, 7.5 credits; Research Methods in Software Engineering, 7.5 credits; Bachelor Thesis in Software Engineering and Management, 15 credits",
    "optional_courses": "Within the programme, students can study optional courses within or outside the main field of study to an extent of 30 credits. The curriculum includes the following optional courses within the main field of study Software Engineering: Software Innovation, 15 credits; Change Management in Software Development Organizations, 7.5 credits; AI Engineering, 7.5 credits; Software Engineering for Data-Intensive AI Applications, 15 credits",
    "language_of_instruction": "The education is given in English at full time and is conducted in the form of lectures, seminars, teacher-led exercises, and supervision in connection to the exercises as well as projects in which students apply and deepen their knowledge. All literature and communication is in English."
  },
  "guaranteed_admission": "Students who follow the study programme at the prescribed pace have guaranteed admission to compulsory and optional courses provided that specific entry requirements are fulfilled and the student applies to the course within the study programme within the prescribed application period. Admission to the course Project: Software Innovation depends on the availability of project topics and the availability of a supervisor from the faculty. For optional courses outside the study programme local admission regulations are valid and there is no guaranteed admission.",
  "other_information": {
    "credit_transfer": "In some cases, the student has the right to be given credit for former higher education according to the legislative regulations of the Higher Education Ordinance.",
    "evaluation": "The study programme will be followed up and evaluated in accordance with the applicable Policy för kvalitetssäkring och kvalitetsutveckling av utbildning vid Göteborgs universitet (Policy for the Quality assurance and Quality Development of Education at the University of Gothenburg).",
    "revision_of_syllabus": "This syllabus is a revision of the syllabus confirmed by the IT Faculty Board on 17-06-2016 (reg. no. G 2016/178)."
  },
  "program_page": {
    "source_information": {
      "course_page_url": "https://www.gu.se/en/study-gothenburg/software-engineering-and-management-bachelors-programme-n1sof",
      "syllabus_url": "https://www.gu.se/sites/default/files/2023-09/GU2023-1727_faststa%CC%88lld_utbildningsplan_N1SOF_220616_eng%5B2%5D.pdf",
      "last_modified": "26 May 2025"
    },
    "application_information": {
      "autumn_2025": {
        "study_pace": "100%",
        "time": "Day",
        "location": "Göteborg",
        "study_form": "Campus",
        "language": "English",
        "duration": "1 Sep 2025 - 4 Jun 2028",
        "application_periods": [
          {"period": "15 Oct 2024 - 15 Jan 2025", "application_code": "GU-86010", "status": "Application closed"},
          {"period": "17 Mar 2025 - 15 Apr 2025", "application_code": "GU-86000", "status": "Application closed"}
        ]
      }
    },
    "tuition_and_fees": {
      "full_education_cost": "426 060 SEK",
      "first_payment": "71 010 SEK",
      "fee_exemptions": "No fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students"
    },
    "summary": "Software engineers and software managers will have a key role in all aspects of society, from using AI to provide customer service and financial advice, to developing self-driving cars, to creating apps in the health and biotech sphere. We are among the largest software engineering groups in the world, and our researchers have worldwide impact. Our programme gives you the opportunity to complete collaborative projects, work with partners in industry, and participate in hackathons, gaining the skills necessary to improve the world with software.",
    "about": "The development of software and smart, efficient information technology solutions is changing the way we live our lives. From developing self-driving cars to smart devices and social media, people who have the skills to create innovative products utilizing technology and management are increasingly in demand. The bachelor's programme in Software Engineering and Management will develop your social, technical, and management skills, all important for a successful career in any domain. You will practice working in teams to gain experience in various roles important to your future career and to gain an understanding of the strength of a cohesive team. A well-rounded, collaborative, project-based education. The programme addresses methods and techniques for developing software, asking the right questions to customers, translating customer answers into design, and managing projects, organizations, and development teams. You will develop technical skills, the capability to analyse problems, the ability to estimate time and cost for development projects, and the capacity to communicate and interact with customers and other partners in software development projects. A strength of our programme compared to others is the dual focus on software engineering and management skills. The programme has a tight relationship to the software industry, which is an important aspect of the programme. Within the courses and projects, we collaborate with practitioners from industry and you are introduced to realistic problems experienced in the software industry through guest lecturers and supervisors from industry. A key element of the curriculum is the focus on problem-based and project-based learning. You will work on broad and complex problem definitions and learn to structure and solve them. Preparing you for a successful career. You will be trained to take responsibility for your learning, and the teachers, supervisors, and the educational environment are all resources in this process. The programme is open to students from around the world, and we embrace the influence of this international group of students. We take pride in standing out among other bachelor's programmes by offering ours completely in English, and our international environment—with teachers and students from all over the world—will prepare you for master's studies in various fields or a career in industry, in Sweden or internationally. Practice your learning in hackathons. In a hackathon, students and professionals come together in teams to create and build software solutions to cases provided by the organizer. You can participate in hackathons as an extracurricular activity, providing you an opportunity to practice and test your knowledge on real-world cases in collaboration with companies and non-profit organizations.",
    "program_structure": "Our programme has a clear management profile, with group project work that creates and develops software in various real-world contexts, giving you the opportunity to hone your creativity and develop and prove your skills. This allows you to work on projects with the opportunity to create realistic, team-oriented work, gaining experience in various roles. The curriculum is taught over six academic terms, each with a specific theme. Term 1: Team Programming, Term 2: Systems Development, Term 3: Distributed Systems Development, Term 4: Cyber Physical Systems and Systems of Systems, Term 5: Software Engineering for AI Systems, Term 6: Software Engineering Research and Practice.",
    "who_should_apply": "Do you want to explore how AI can provide customer service and even financial advice? Are you interested in being part of developing self-driving vehicles? Do you want a key role in developing a sustainable future? If you want to develop your team leadership, project planning, and communication skills, setting you apart from other software engineers, join our applicants from all backgrounds and from over 90 countries and apply for the bachelor's programme in Software Engineering and Management.",
    "after_graduation": "Graduates of the programme receive the Degree of Bachelor of Science with a major in Software Engineering. Our former students are working as: software developer, software tester, system engineer, product owner, project manager, SCRUM master, business analyst, business intelligence developer, data scientist, UX designer, software architect, software quality engineer, mobile application developer, team leader, SAFe product owner, software engineering analyst, and process engineer. Companies employing our graduates include: Apple, Google, IBM, Volvo Cars, Microsoft, Ericsson, Swedbank, Volvo Trucks, Electronic Arts, CISCO, Handelsbanken, Astra Zeneca, Scania Group, Jeppesen, Danske Bank, Volvo Buses, Volvo IT, Klarna, Vodafone, Skatteverket, Stena AB, Zenuity, TIBCO Software, Västtrafik, Sigma IT Consulting, Semcon, Creative Assembly, and Aptiv.",
    "facilities": "The programme is given by the Department of Computer Science and Engineering, Division of Software Engineering, which is located in the middle of Sweden's leading technology hub, Lindholmen Science Park, close to the city center in Gothenburg.",
    "exchange_opportunities": "There is an opportunity in term five to study abroad in Europe, Asia, or the US. All other term courses are mandatory."
  }
}