{
  "program_code": "N2COS",
  "number_of_credits": 120,
  "confirmation": "Valid from Spring semester 2024, Registration number GU 2024/2069, Date of entry into force 2024-08-20, Decision date 2024-08-20, Valid from semester Autumn semester 2025, Decision maker Dean of the Faculty",
  "purpose": "The purpose of the education is to give the students the knowledge, skills and abilities that they need for a successful career in computer science. The programme is characterised by a large freedom of choice, and the students have both the opportunity and the responsibility to design their own profiles within the area of computer science. This programme leads to a Degree of Master of Science (120 credits) with a major in Computer Science (Filosofie masterexamen med huvudområdet Datavetenskap).",
  "entry_requirements": {
    "general_requirements": "A bachelor's degree of 180 credits within the field of computer science or equivalent, including a thesis or project of at least 6 credits. At least 120 credits in total in computer science and mathematics, of which at least 7.5 credits discrete mathematics, and 10 additional credits in mathematics, 7.5 credits imperative or object oriented programming, and 7.5 additional credits in programming, as well as 7.5 credits data structures (or equivalent). Applicants must prove their knowledge of English: English 6 / English B from Swedish Upper Secondary School or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "specific_entry_requirements": "Within the study programme there can be specific entry requirements for admission to individual courses. These specific entry requirements are documented in each course syllabus and state which entry requirements are necessary to be registered on a course within the study programme.",
    "selection": "Selection is according to the Higher Education Ordinance and the University of Gothenburg admission regulations for education on first and second cycle."
  },
  "main_field_of_study": "Computer Science",
  "outcomes": {
    "general_outcomes": {
      "knowledge_and_understanding": "General outcomes for Degree of Master (120credits); see Annex 2 of the Higher Education Ordinance.",
      "competence_and_skills": "General outcomes for Degree of Master (120credits); see Annex 2 of the Higher Education Ordinance.",
      "judgement_and_approach": "General outcomes for Degree of Master (120credits); see Annex 2 of the Higher Education Ordinance."
    },
    "local_outcomes": {
      "knowledge_and_understanding": "For a Degree of Master of Science (120 credits) with a major in Computer Science the student shall be generally competent in the computer science discipline, be familiar with the major computer science areas, have the ability to increase and develop this competence through independent study, have a considerable degree of knowledge about theories and methods in parts of the field, and be able to relate to research and development work in parts of the field.",
      "competence_and_skills": "For a Degree of Master of Science (120 credits) with a major in Computer Science the student shall be able to critically and systematically integrate knowledge from the field, be able to analyse and critically evaluate different technical solutions in the field, be able to critically and independently identify, formulate and deal with complex issues in the field, be able to plan and carry out advanced tasks in the field, within set time frames, and evaluate this work, be able to report and discuss knowledge and conclusions related to computer science both orally and in writing, and be able to contribute to research and development work in parts of the field.",
      "judgement_and_approach": "For a Degree of Master of Science (120 credits) with a major in Computer Science the student shall be able to argue, reflect, and form independent conclusions, be able to contribute to discussions both in the scientific community and in society at large, be aware of the role computer science plays in society, have understanding of possible societal consequences of different decisions, and the ability to take this understanding into account, and be able to discuss ethical consequences of information technology."
    }
  },
  "content_and_structure": {
    "general_overview": "The programme is characterised by freedom of choice and offers a large number of courses in computer science. At present there are courses on topics such as algorithms, computer architecture, computer systems and networks, cyber-physical systems, data science, graphics, interaction design, logic, machine learning, programming, programming languages, security, and verification. Study counsellors are available for the students, and the department recommends the students to contact the counsellors when planning their education. The academic year is divided into two semesters and four study periods. A semester includes two study periods, each of 15 credits. Students normally attend two courses in parallel in each study period. The education is conducted in the form of lectures, seminars, teacher-led exercises, and tutoring as well as projects in which students apply and deepen their knowledge.",
    "study_process": "The programme constrains the freedom through certain rules: To complete the degree a student must complete 120 credits. At least 60 credits, excluding the thesis project, must come from second cycle courses. At least 45 of those 60 credits must come from courses with Computer Science as a main field of study. Furthermore, at least 7.5 of those 45 credits must come from courses for which the entry requirements include at least 7.5 credits within advanced courses with Computer Science as a main field of study. The following course is compulsory: The Computer Scientist in Society, 7.5 credits. A master's thesis project of at least 30 credits has to be completed within the main field of study Computer Science, through one of the following two courses: Master's Thesis in Computer Science and Engineering, 30 credits, or Master's Thesis in Computer Science and Engineering, 60 credits.",
    "optional_courses": "The programme offers a large number of elective courses in computer science with topics such as algorithms, computer architecture, computer systems and networks, cyber-physical systems, data science, graphics, interaction design, logic, machine learning, programming, programming languages, security, and verification. The flexibility of the programme includes the opportunity to take courses outside of computer science as part of your degree, letting you create your own unique computer science profile according to your interests.",
    "language_of_instruction": "The language of tuition is English."
  },
  "guaranteed_admission": "Students are guaranteed admission to all compulsory courses in the programme, as well as a number of elective courses, if they satisfy the courses' entry requirements and apply to the courses in prescribed ways and within prescribed application periods. The department announces for which courses there is guaranteed admission. For other optional courses local admission regulations apply and there is no guaranteed admission.",
  "other_information": {
    "credit_transfer": "In some cases, the student has the right to be given credit for former higher education according to the legislative regulations of the Higher Education Ordinance.",
    "evaluation": "The courses of the study programme are evaluated according to each course syllabus. The result will be used for planning and implementation of upcoming courses. A summary is given to students at the start of the courses. The study programme will be followed up and evaluated in accordance with the applicable Policy för kvalitetssäkring och kvalitetsutveckling av utbildning vid Göteborgs universitet (Policy for the Quality assurance and Quality Development of Education at the University of Gothenburg).",
    "revision_of_syllabus": "This syllabus is a revision of the syllabus confirmed by the IT Faculty Board, University of Gothenburg, on 10-10-2018 (reg. no. G 2018/510), revised on 02-09-2021 (reg. no. GU 2021/2277) and 20-08-2024 (reg. no GU 2024/2069) to be valid from Autumn semester 2025."
  },
  "program_page": {
    "source_information": {
      "course_page_url": "https://www.gu.se/en/study-gothenburg/computer-science-masters-programme-n2cos",
      "syllabus_url": "https://www.gu.se/en/study-gothenburg/computer-science-masters-programme-n2cos/syllabus/f9915049-2d48-11ef-a2a0-4c1db4504bb5",
      "last_modified": "26 May 2025"
    },
    "application_information": {
      "autumn_2025": {
        "study_pace": "100%",
        "time": "Day",
        "location": "Göteborg",
        "study_form": "Campus",
        "language": "English",
        "duration": "1 Sep 2025 - 6 Jun 2027",
        "application_periods": [
          {"period": "15 Oct 2024 - 15 Jan 2025", "application_code": "GU-86009", "status": "Application closed"},
          {"period": "17 Mar 2025 - 15 Apr 2025", "application_code": "GU-86003", "status": "Application closed"}
        ]
      }
    },
    "tuition_and_fees": {
      "full_education_cost": "284 040 SEK",
      "first_payment": "71 010 SEK",
      "fee_exemptions": "No fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students"
    },
    "summary": "The master's programme in Computer Science offers freedom and flexibility to choose among a wide range of courses. Computer science is a broad topic that spans everything from theory of computation to the practice of designing software systems. Our master's programme utilizes the University of Gothenburg's research-focused Department of Computer Science and Engineering to provide a comprehensive programme. As a student, you will explore the whole spectrum of computer science and specialize according to your interests.",
    "about": "Computers are everywhere in society, with both beneficial and detrimental influence. With increasing connection and communication, however, the possibilities of misinformation, cyber-attacks, and breaches of privacy grow. On the other hand, aspects of life such as travel have never been more accessible, from air travel to self-driving cars. Algorithms steer our lives, influencing where we shop and what we buy, how we learn and how we communicate. At its core, computer science is the science of programming, studying the general powers and limitations of computing, the design and characteristics of hardware and software, and the solving of problems in applications of computers. A full-spectrum master's programme. We have strong, internationally recognized research groups driving our programme, addressing a wide range of questions including the properties of electronic devices, the character of human reasoning, individual design components, globally distributed systems, fundamental understanding of computation, and highly pragmatic, applied research. You can choose courses from a wide range of areas: algorithms and machine learning, interaction design, computer graphics, and game design, distributed computing and networks, digital systems, computer architecture, and hardware verification, security and privacy, programming languages, formal logic, and dependent types, real-time systems and dependability, functional programming and parallel computing, software engineering and program analysis, natural language processing. A unique opportunity for freedom and flexibility. Our programme is distinguished among others by offering you the opportunity to carve your own path through computer science. In contrast, other programmes often impose many mandatory courses and a rigid structure. In our programme, you will have only one mandatory course that will prepare you to start your master's thesis. We have an exchange programme that allows you the opportunity to do half a year abroad at one of our partner universities, providing even more chances to broaden your experiences and studies. A diverse learning environment. The Department of Computer Science and Engineering is shared between the University of Gothenburg and Chalmers University of Technology and spans the two campuses, easily accessible by public transportation and integrated with the city. Our classroom environment is as flexible as your course options. Depending on the courses you choose, you will experience group and individual assignments, seminars, and project-focused work. A solid foundation in computer science from which you can go anywhere. You will be equipped with the knowledge, skills, and attitudes required for a successful professional career in a large variety of information technology areas, both in industry and academia. In particular, the programme enables you as a future professional to conceive, design, and implement systems which work correctly, are maintainable, and reliable.",
    "program_structure": "The only mandatory course, The Computer Scientist in Society (designed to be taken in your second year), prepares you to start your master's thesis. In this course, you practise academic writing and have the opportunity to use this time to complete your master's thesis proposal if you wish. The flexibility of the programme includes the opportunity to take courses outside of computer science as part of your degree, letting you create your own unique computer science profile according to your interests. The last half-year is dedicated to your master's thesis project, which is completed individually or in pairs. You may choose to collaborate with a company, though the focus should be on deepening what you have learned over the course of the master's programme.",
    "who_should_apply": "Would you like to combine thorough thinking with rapid experimentation? Do you want to explore the principles behind computer systems? Do you want a wide variety of choice and to build your own path in computer science? Then apply to the master's programme in Computer Science.",
    "after_graduation": "Graduates of the programme receive the Degree of Master of Science with a major in Computer Science. After graduation, you will be highly qualified to work as a programmer, systems architect, system developer, and project leader, or to undertake research in computer science. Our emphasis on modelling, design, and on conceptual abilities will provide you with flexibility, so you can adapt to emerging and evolving job markets. International and local industry appreciate the high skills and broad profile of our graduates, some of whom have gone to work at large companies such as Ericsson, Apple, and Google, while others have been part of start-ups.",
    "facilities": "The Department of Computer Science and Engineering is shared between the University of Gothenburg and Chalmers University of Technology and spans the two campuses, easily accessible by public transportation and integrated with the city.",
    "exchange_opportunities": "We have an exchange programme that allows you the opportunity to do half a year abroad at one of our partner universities, providing even more chances to broaden your experiences and studies."
  }
}