{
  "program_code": "N2GDT",
  "number_of_credits": 120,
  "confirmation": "This programme syllabus was confirmed by the IT Faculty Board on 10-10-2018 (G 2018/470) and was last revised on 13-09-2022 (GU 2022/2361) to be valid from 28-08-2023, Autumn semester 2023. Responsible Department/equivalent: Department of Computer Science and Engineering",
  "purpose": "The aim of the study programme is to educate professional developers within the areas of programming which are central to advanced game engine development. The programme provides a competitive set of skills for both professional roles related to the development of game technology – for example graphics engine architect, physics engine architect, AI developer, and network architect – and for continued studies at PhD level. The profile of the study programme is characterized by a combination of advanced technological knowledge and a development methodology that allows the creation of large and technologically complex system in interdisciplinary development teams where the requirement specification are mutable and strongly dependent on the user experience of the intended end users. The study programme applies a battery of different perspectives and approaches that combine to educate highly qualified developers that can both design and implement game engines and equivalent systems (e.g. interactive simulations) to high levels of quality. Further, it allows students to continue their studies at PhD level and become researchers that can innovate and conduct advanced technological experiments within the areas of computer graphics, physics simulation, network optimization, and gameplay design. A central stance in the study programme is to be close to the current research in all the technical areas within the study programme, and to connect the development of technology to the design of user experiences.",
  "entry_requirements": {
    "general_requirements": "Bachelor's degree 180 credits including 7.5 credits project or equivalent within the field of Software Engineering, Computer Science, Information Technology, Information Systems, or equivalent. 4.5 credits in mathematics. 15 credits of programming, of which 7.5 credits is object oriented programming. Applicants must prove their knowledge of English: English 6/English B from Swedish Upper Secondary School or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "specific_entry_requirements": "Within the study programme there can be specific entry requirements for admission to individual courses. These specific entry requirements are documented in each course syllabus and state which entry requirements are necessary to be registered on a course within the study programme.",
    "selection": "Selection is according to the Higher Education Ordinance and the University of Gothenburg admission regulations for education on first and second cycle."
  },
  "main_field_of_study": "Interaction Design",
  "outcomes": {
    "general_outcomes": {
      "knowledge_and_understanding": "For a Degree of Master (120 credits) the student shall demonstrate knowledge and understanding in the main field of study, including both broad knowledge of the field and a considerable degree of specialised knowledge in certain areas of the field as well as insight into current research and development work, and demonstrate specialised methodological knowledge in the main field of study.",
      "competence_and_skills": "For a Degree of Master (120 credits) the student shall demonstrate the ability to critically and systematically integrate knowledge and analyse, assess and deal with complex phenomena, issues and situations even with limited information; demonstrate the ability to identify and formulate issues critically, autonomously and creatively as well as to plan and, using appropriate methods, undertake advanced tasks within predetermined time frames and so contribute to the formation of knowledge as well as the ability to evaluate this work; demonstrate the ability in speech and writing both nationally and internationally to clearly report and discuss his or her conclusions and the knowledge and arguments on which they are based in dialogue with different audiences, and demonstrate the skills required for participation in research and development work or autonomous employment in some other qualified capacity.",
      "judgement_and_approach": "For a Degree of Master (120 credits) the student shall demonstrate the ability to make assessments in the main field of study informed by relevant disciplinary, social and ethical issues and also to demonstrate awareness of ethical aspects of research and development work; demonstrate insight into the possibilities and limitations of research, its role in society and the responsibility of the individual for how it is used, and demonstrate the ability to identify the personal need for further knowledge and take responsibility for his or her ongoing learning."
    },
    "local_outcomes": {
      "knowledge_and_understanding": "For a Degree of Master of Science (120 credits) with a major in Interaction Design the student shall exhibit deep knowledge about the primary technology areas important for developing game engine and similar systems, as well as the current research questions within these areas, display knowledge and understanding of the complexity of handling requirements in software development projects which depend on both advanced technological development and strict requirements on what user experiences these provide, display knowledge and understanding regarding theories and methods related to the development, improvement, and verification of rendering systems, the development, improvement, and verification of physics simulations, the development, improvement, and verification of real-time network systems, the development, improvement, and verification of AI systems, the design and evaluation of game experiences, including tools to measure and analyze user experiences of systems that are to be deployed on large scales, the design and evaluation of game engines and similar system that make use of the parts above as components, and specifically how these can be continued to be developed, and, dedicated tools for the areas above and how these can be developed and verified.",
      "competence_and_skills": "For a Degree of Master of Science (120 credits) with a major in Interaction Design the student shall be able to design new game engines and modules modified to the requirements present in modern games and interactive simulations, be able to design tools to support the testing and verification of game engines as well as tools to ease the development of game content to these systems, be able to plan and communicate design suggestions and development processes for the above system given mutable development contexts, and show theoretical knowledge and practical ability related to the research methodology relevant to software development of game engines and expansions of these.",
      "judgement_and_approach": "For a Degree of Master of Science (120 credits) with a major in Interaction Design the student shall analyze the advantages and disadvantages with various approaches to develop game engines and expansions of game engines, modify the development of complicated software systems based on requirements specifications that partly build upon intended user experiences and gameplay, and independently handle mutable development contexts and be active in seeking new knowledge and skills related to development processes."
    }
  },
  "content_and_structure": {
    "general_overview": "The education consists of courses related to the development and testing of software that is part of game engines and interactive simulations. The study programme consists of 120 credits in total, of which 75 credits are in terms of compulsory courses within the main field of Interaction Design, including 30 credits independent work (the master thesis). In addition, there is a possibility of including a maximum of 30 credits optional courses within or outside the main field of study. Students wishing to follow a course within the main field of study, but where the course is not part of the programme, shall consult the programme management. The courses are given in a progressive order so they both independently and together develop the students' competences and abilities within the main field, with the overarching aim of ensuring that the examination goals are met. A foundational understanding of the main field is provided through the compulsory courses during the first semester. Further compulsory courses continue to develop this understanding until the master thesis, while the optional courses provide incremental deepening or broadening of the students' skill sets. This structure provides the students with an academic and theoretical foundation within the fields that characterize game engine development. The education is implemented through lectures, seminars, teacher led exercises, labs, and supervision, as well as projects where students apply and deepen their knowledge. The study year is divided into two semesters and four study periods. A semester contains two study periods of 15 credits each. Normally, a student attends two courses in parallel each study period.",
    "study_process": "The first semester consists only of compulsory courses and introduces important parts and characteristics of the game engine development field. The second and third semester contains one compulsory course each study period and the possibility for students to choose between deepening and broadening their education through optional courses. The study programme consists of the following compulsory courses: An introduction to Game Research, 7,5 hp; Computer Graphics, 7,5 hp; Gameplay Design, 7,5 hp; Game Engine Architecture, 7,5 hp; Game Development Project, 7,5 hp; Current Trends in Gaming, 7,5 hp; Master's Thesis in Computer Science and Engineering, 30 credits or Master's Thesis in Computer Science and Engineering, 60 credits; Within Software Engineering: Requirements Engineering, 7.5 credits; Agile Development Processes, 7.5 credits. The course Master Thesis contains independent work (master thesis) of 30 credits. Students attending the course Master Thesis 60 credits do not need to take the courses Game Design & Technology Project, 7.5 credits and Current Trends in Gaming, 7.5 credits. Students can apply to take alternative courses of studies. These can be in preparation for research- or development work.",
    "optional_courses": "Students can take optional courses within the study programme totaling 30 credits. The courses can be taken at Gothenburg University or at other universities within or outside Sweden. The choice of courses within the main field of study outside the programme's courses shall consult the programme management. Examples of possibilities to specialize within in the programme include: Computer Graphics; Distributed Real-Time Games; AI and Game Agents; Naturalistic Simulations; Game Development on mobile and other non-traditional platforms",
    "language_of_instruction": "Language of tuition is English."
  },
  "guaranteed_admission": "Students who follow the study programme at the prescribed pace are guaranteed admission to all compulsory and elective courses stated in the programme syllabus, provided that the student in question is eligible for the course/courses provided that specific entry requirements are fulfilled and the student applies to the course within the study programme within the prescribed application period. For elective courses outside the study programme local admission regulations are valid and there is no guaranteed admission.",
  "other_information": {
    "credit_transfer": "In some cases, the student has the right to be given credit for former higher education according to the legislative regulations of the Higher Education Ordinance.",
    "evaluation": "The courses of the study programme are evaluated according to each course syllabus. The result will be used for planning and implementation of upcoming courses. A summary is given to students at the start of the courses. The study programme will be followed up and evaluated in accordance with the applicable Policy för kvalitetssäkring och kvalitetsutveckling av utbildning vid Göteborgs universitet (Policy for the Quality assurance and Quality Development of Education at the University of Gothenburg).",
    "revision_of_syllabus": "This syllabus is a revision of the syllabus confirmed by the IT Faculty Board, University of Gothenburg, on 01-06-2016 (reg. no. G 2016/181)."
  },
  "program_page": {
    "source_information": {
      "course_page_url": "https://www.gu.se/en/study-gothenburg/game-design-technology-masters-programme-n2gdt",
      "syllabus_url": "https://www.gu.se/sites/default/files/2022-09/GU2022-2361%20beslutad%20UP%20N2GDT%20eng%20220913.pdf",
      "last_modified": "26 May 2025"
    },
    "application_information": {
      "autumn_2025": {
        "study_pace": "100%",
        "time": "Day",
        "location": "Göteborg",
        "study_form": "Campus",
        "language": "English",
        "duration": "1 Sep 2025 - 6 Jun 2027",
        "application_periods": [
          {"period": "15 Oct 2024 - 15 Jan 2025", "application_code": "GU-86008", "status": "Application closed"},
          {"period": "17 Mar 2025 - 15 Apr 2025", "application_code": "GU-86004", "status": "Application closed"}
        ]
      }
    },
    "tuition_and_fees": {
      "full_education_cost": "284 040 SEK",
      "first_payment": "71 010 SEK",
      "fee_exemptions": "No fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students"
    },
    "summary": "The Master's programme in Game Design and Technology teaches you a blend of the skills and techniques required to work in and around the game industry. These skills include the ability to meaningfully analyse gameplay systems and their impact; understand, develop and use game engines; and develop games with the intention of creating highly enjoyable player experiences.",
    "about": "Games have become a massive part of our global entertainment economy. The gaming industry produces more revenue than the music industry and the movie industry combined. It is a rich, complicated field where there is ample opportunity to combine creativity and technical skills in meaningful and satisfying ways. Whether it is in the innovative design of game mechanisms or the implementation of subsystems within a high-powered gaming engine – gaming is a topic that has room for everyone's imagination. And that's where this Master's programme comes in. Within this degree we teach a blend of topics that cover the range of skills needed to work in the industry. We'll show you how to build a game engine and the design considerations that need to be taken into account. We'll talk about how to analyse the ways in which a game fits together and how you can develop your own more effectively. We'll talk about cutting edge game design trends, and bleeding edge technical trends. At the end of this programme you will be equipped to design and develop robust, interesting games that people actually want to play. Through project-based assessment you'll build a portfolio that shows employers exactly what you can do. This Master's programme though is not just about building yourself a career in games, but also about how to build games into a whole range of other careers. The skills needed to create a game in Unity or Unreal are the same skills you can use to create interactive simulations, animations, and virtual reality environments. The tools you will discover for designing gameplay are the same ones you can use to create compelling user experiences in non-game contexts. Learning how to optimize the rigorous and competing demands of a game engine means you can optimize almost anything. Our focus is primarily on video games, but you'll also be encouraged to explore the design lessons in everything from board-games to role-playing games to mega-games. This is what the Game Design & Technology master's offers its students. We hope to count you among them! Combining Theory and Practice for Advanced Skills. Within the Master's programme in Game Design and Technology we believe that practice should be informed by theory, and theory informed by practice. You will develop your technical skills in a variety of areas and make use of industry-relevant tools. All of our game-specific courses have a strong focus on building experiences that a player will enjoy… and understanding the reasons when that's not the case. Our approach is based on four key pillars – analysis, design, implementation and evaluation. Our approach is also cyclical – when you've built on each of these pillars you take the results, refine, and start again. Courses such as Introduction to Game Research; Gameplay Design; Game Engine Architecture; and the Game Development Project give you grounded, concrete experience with techniques important to each of these key areas. Through lectures, labs, and tutorials you'll be supported in this all the way through the program. We have a strong focus too on authentic project-based learning where individual supervision ensures you get the best experience for your own particular needs.",
    "program_structure": "The first semester introduces important aspects and characteristics of the game engine development field through mandatory courses. The second and third semesters contain one mandatory course each and the possibility for elective courses. The following are mandatory courses: An Introduction to Game Research, Computer Graphics, Gameplay Design, Simulation Engines, Game Development Project, Technology-Driven Experimental Game Design, Requirements Engineering, Agile Development Processes, Master's Thesis in Computer Science and Engineering. You can specialize with elective courses within areas such as: Computer Graphics, Distributed Real-Time Games, AI and Game Agents, Naturalistic Simulations, or Game Development on Mobile and Other Non-Traditional Platforms. You can spend one or two semesters on your master's thesis. If you choose to spend the whole second year on your thesis, you do not need to take the courses Game Development Project and Technology-Driven Experimental Game Design.",
    "who_should_apply": "We do not expect any specific training in games before you come to this Master's programme. All we want is for you to take your play seriously. If you want to develop the skills needed to create complex, interesting games that meet the needs of a demanding audience, then this may be the programme for you. If you want to get deep into understanding the mindset of a player and how you can build games they'll love, then this may be the programme for you. If you want to integrate gaming knowledge into new and interesting domains, then this may be the programme for you. If you want to gamify, or augment reality, or simulate the world… then this may be the programme for you.",
    "after_graduation": "Graduates of the programme receive the degree Master of Science with a major in Interaction Design. We expect our graduates to be prepared for work in a wide range of gaming jobs, including in design, development, and quality assurance. While we expect our students to be in demand for their digital skills, we also see them as having qualities that make them ideal for analog gaming professions too. Students in this programme can expect to have the necessary background that qualifies them to incorporate their skills into a wide range of adjacent industries. Experience in everything from virtual reality to game engine design to the construction of interactive simulations has applicability in a wide range of fields. The research component of this programme also qualifies students to continue their studies to the doctoral level.",
    "facilities": "The master's programme is given by the Department of Computer Science and Engineering, Division of Interaction Design and Software Engineering, which is located in the middle of Sweden's leading technology hub, Lindholmen Science Park, close to the city center in Gothenburg.",
    "exchange_opportunities": null
  }
}