{
  "program_code": "N2SOF",
  "number_of_credits": 120,
  "confirmation": "This programme syllabus was confirmed by the IT Faculty Board on 01-10-2020 (GU 2020/2125) and was last revised on 26-10-2023 (GU 2023/2656) by the Dean of the Faculty to be valid from 02-09-2024, Autumn semester 2024. Responsible Department/equivalent: Department of Computer Science and Engineering",
  "purpose": "The aim of the programme is to train professional software engineers who can contribute constructively to both the software industry and society at large. This programme prepares students for different roles involved in the development of software including developers, testers, quality managers, software architects, project managers, as well as for further studies at the university, for example, graduate studies. The profile of the programme is characterized by the combination of advanced technical knowledge with managerial skills to be able to produce large technologically advanced systems in ways that correspond to contemporary demands for quality and speed in very dynamic environments. In the programme, different perspectives and approaches are applied together to educate qualified engineers who can design software with high quality and at low development and maintenance cost, and future researchers who can work innovatively and conduct advanced experiments with technology within software engineering. A central pedagogical philosophy in the programme is to collaborate closely with industry through, for example, project work and guest lectures where the students are confronted with authentic and realistic projects and challenges that respond to relevant needs and requirements of industry.",
  "entry_requirements": {
    "general_requirements": "Bachelor's degree 180 credits including an independent project (degree project) of at least 6 credits or equivalent within the field of Software Engineering, Computer Science, Information Technology, Information Systems, or equivalent. Knowledge in programming, with the minimum of: 12 credits in programming, of which at least 6 credits must include object-oriented programming (Java, Python, C#, or an equivalent language). 6 credits in algorithms and data structures. Applicants must prove their knowledge of English: English 6/English B from Swedish Upper Secondary School or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "specific_entry_requirements": "Within the study programme there can be specific entry requirements for admission to individual courses. These specific entry requirements are documented in each course syllabus and state which entry requirements are necessary to be registered on a course within the study programme.",
    "selection": "Selection is according to the Higher Education Ordinance and the University of Gothenburg admission regulations for education on first and second cycle."
  },
  "main_field_of_study": "Software Engineering",
  "outcomes": {
    "general_outcomes": {
      "knowledge_and_understanding": "For a Degree of Master (120 credits) the student shall demonstrate knowledge and understanding in the main field of study, including both broad knowledge of the field and a considerable degree of specialised knowledge in certain areas of the field as well as insight into current research and development work, and demonstrate specialised methodological knowledge in the main field of study.",
      "competence_and_skills": "For a Degree of Master (120 credits) the student shall demonstrate the ability to critically and systematically integrate knowledge and analyse, assess and deal with complex phenomena, issues and situations even with limited information; demonstrate the ability to identify and formulate issues critically, autonomously and creatively as well as to plan and, using appropriate methods, undertake advanced tasks within predetermined time frames and so contribute to the formation of knowledge as well as the ability to evaluate this work; demonstrate the ability in speech and writing both nationally and internationally to clearly report and discuss his or her conclusions and the knowledge and arguments on which they are based in dialogue with different audiences, and demonstrate the skills required for participation in research and development work or autonomous employment in some other qualified capacity.",
      "judgement_and_approach": "For a Degree of Master (120 credits) the student shall demonstrate the ability to make assessments in the main field of study informed by relevant disciplinary, social and ethical issues and also to demonstrate awareness of ethical aspects of research and development work; demonstrate insight into the possibilities and limitations of research, its role in society and the responsibility of the individual for how it is used, and demonstrate the ability to identify the personal need for further knowledge and take responsibility for his or her ongoing learning."
    },
    "local_outcomes": {
      "knowledge_and_understanding": "For a Degree of Master of Science (120 credits) with a major in Software Engineering the student shall demonstrate: broad knowledge and understanding in software engineering, and substantially deeper knowledge within chosen topics of the field, such as software architectures, software project management, quality assurance, or modelling technologies, and insight into current research and development; deep knowledge of methods to develop, assess and improve different types of architectures in modern software; deep knowledge of methods to cope with the complexity of requirements management, including the ability to identify, prioritize, package and validate requirement specifications, and; deep knowledge of methods to measure, analyze, maintain, and evaluate software systems.",
      "competence_and_skills": "For a Degree of Master of Science (120 credits) with a major in Software Engineering the student shall demonstrate the skills and ability to: individually and in practical project work plan and, using appropriate methods and tools, analyze, develop and maintain software systems within predetermined time frames; with a comprehensive approach critically, independently, and creatively identify, formulate and handle complex problems in software engineering; contribute to research and development in software engineering; critically and systematically integrate knowledge to analyze, assess and deal with complex phenomena, issues and situations in software engineering even with limited information; design new processes adapted to modern types of software, e.g. embedded systems and be able to use modern tools to specify and communicate processes; analyze existing processes for development of software and be able to identify improvements in processes concerning selected aspects, e.g. productivity, quality; create, analyze and critically evaluate various technological solutions for software development; in written and spoken English to report clearly and discuss own conclusions as well as the knowledge and arguments that form the basis for these findings; develop and design software products, processes and systems while taking into account the circumstances and needs of individuals and the targets for economically, socially and ecologically sustainable development set by the community, and; contribute to teamwork and collaboration with various constellations.",
      "judgement_and_approach": "For a Degree of Master of Science (120 credits) with a major in Software Engineering the student shall demonstrate the ability to: make technical judgements in software engineering, requirements management, software design, and quality, informed by relevant social and ethical aspects, as well as awareness of ethical aspects of research and development work; analyze how different roles interact with each other in software development processes and understand how the different roles are affected by team members' personal characteristics; identify the personal need for further knowledge and take responsibility for his or her ongoing learning in the area of software engineering, and; reflect on the possibilities and limitations of software engineering research, its role in society and the responsibility of the individual for how it is used."
    }
  },
  "content_and_structure": {
    "general_overview": "The programme consists of courses in Software Engineering and related subjects. The programme includes a total of 120 credits. Of these are 75 credits compulsory courses in the main field of Software Engineering, including 30 credits independent project (thesis), and at least 15 credits of elective courses in the same main field. Furthermore, the programme includes a maximum of 30 credits of optional courses outside the main field that can be selected within or outside the programme. The courses are progressively arranged so that they, within the framework of learning outcomes, contribute separately and jointly, with developing the student's skills and abilities in the field. Knowledge in the main field is attained in an initial basic block. Thereafter follows a successive deepening and broadening or specialization through elective courses offered within and outside the main field. Through this progression, the students deepen their scientific and theoretical basis in the field of software engineering. The education is conducted in the form of lectures, seminars, teacher-led exercises, and tutoring as well as projects in which students apply and deepen their knowledge. An academic year is divided into two semesters and four study periods. A semester includes two study periods, each of 15 credits. Students normally attend two courses in parallel in each study period.",
    "study_process": "The first semester includes only compulsory courses in Software Engineering and introduces key elements and characteristics in the area of software engineering. During the second semester elective courses in the main field of Software Engineering are offered, which focus on advanced technical skills and approaches to deal with complexity. Following compulsory courses are included in the programme: Advanced Requirements Engineering, 7.5 credits; Quality Assurance and Testing, 7.5 credits; Project Management, 7.5 credits; Empirical Software Engineering, 7.5 credits; Software Evolution Project, 15 credits; Master's Thesis in Computer Science and Engineering, 30 credits or 60 credits. The above courses constitute the main field within the education programme. The course Master's Thesis in Computer Science includes an independent project (degree project) of 30 credits. In addition to the above compulsory courses, the student should study at least 15 credits elective courses within the main field Software Engineering. A list of pre-approved courses can be found on the programme page on the Canvas online platform. Furthermore, the programme includes optional courses of a total of 30 credits. A student can apply for an alternative study process. This can be preparatory for research or development work.",
    "optional_courses": "Within the programme, the students can study elective courses to an extent of 45 credits. These include elective courses in the main field of Software Engineering of at least 15 credits. Optional courses outside the main field can be selected to a maximum of 30 credits. Further elective courses within the programme can be selected with guaranteed admission. These enable students to specialize in different areas. Available areas for specialization include, for example: Software Engineering for Data-Intensive Systems; Human Factors in Software Engineering; Software and User Experience; Software and Data Science; Software and Real-Time Systems. The current suggestions for specialization can be found on the programme page on the Canvas online platform.",
    "language_of_instruction": "Language of tuition is English."
  },
  "guaranteed_admission": "Students who follow the study programme at the prescribed rate have guaranteed admission. There are two kinds of guaranteed admission at the University of Gothenburg: general or limited. 'General guaranteed admission' means that the students admitted to the study programme have guaranteed admission to all of the compulsory and optional courses in the programme syllabus provided that specific entry requirements are fulfilled and the student applies to the course within the study programme within the prescribed application period. 'Limited guaranteed admission' means that the students cannot be guaranteed their first-choice place for optional courses. For optional courses outside the study programme local admission regulations are valid and there is no guaranteed admission.",
  "other_information": {
    "credit_transfer": "In some cases, the student has the right to be given credit for former higher education according to the legislative regulations of the Higher Education Ordinance.",
    "evaluation": "The courses of the study programme are evaluated according to each course syllabus. The result will be used for planning and implementation of upcoming courses. A summary is given to students at the start of the courses. The study programme will be followed up and evaluated in accordance with the applicable Policy för kvalitetssäkring och kvalitetsutveckling av utbildning vid Göteborgs universitet (Policy for the Quality assurance and Quality Development of Education at the University of Gothenburg).",
    "revision_of_syllabus": "This syllabus is a revision of the syllabus confirmed by the IT Faculty Board 01-10-2020 (reg. no. G 2020/2125)."
  },
  "program_page": {
    "source_information": {
      "course_page_url": "https://www.gu.se/en/study-gothenburg/software-engineering-and-management-masters-programme-n2sof",
      "syllabus_url": "https://www.gu.se/sites/default/files/2023-10/N2SOF_Utbildningsplan%20%28en%29%5B50%5D.pdf",
      "last_modified": "26 May 2025"
    },
    "application_information": {
      "autumn_2025": {
        "study_pace": "100%",
        "time": "Day",
        "location": "Göteborg",
        "study_form": "Campus",
        "language": "English",
        "duration": "1 Sep 2025 - 6 Jun 2027",
        "application_periods": [
          {"period": "15 Oct 2024 - 15 Jan 2025", "application_code": "GU-86006", "status": "Application closed"},
          {"period": "17 Mar 2025 - 15 Apr 2025", "application_code": "GU-86002", "status": "Application closed"}
        ]
      }
    },
    "tuition_and_fees": {
      "full_education_cost": "284 040 SEK",
      "first_payment": "71 010 SEK",
      "fee_exemptions": "No fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students"
    },
    "summary": "Software is a driving force for innovation and development, and its importance in society as a whole is rapidly increasing. As a student of the master's programme in Software Engineering and Management, you will develop a combination of advanced technical knowledge and management skills within software development—competence highly sought after in the job market. After successfully completing the programme, you will be able to apply to roles such as project manager, developer, tester, and quality manager in a wide variety of industries.",
    "about": "The growing use of software also increases the size and complexity of software needed, alongside greater pressure to quickly release to market in rapidly changing environments and demands. To meet these challenges, the master's programme in Software Engineering and Management offers a unique combination of advanced technical knowledge and management skills. You will develop perspectives for: understanding industrial practices and current and future trends in technology development; judging and improving software quality, methods, and tools; sustaining software systems over long times; and innovating software development practices and improving performance. A project-based, collaborative learning environment. We have a strong research profile and rely on close collaboration with industry. You will engage in project work and be confronted with real-world challenges for software-intensive industries. Addressing these challenges will show you how both advanced technical knowledge and managerial skills are needed to produce large technologically advanced systems in ways that correspond to contemporary demands for quality and speed in very dynamic environments. Preparing you for a future career. The programme combines different perspectives and approaches, preparing you for different roles, such as developer, tester, quality manager, software architect, and project manager. The skills you develop will also be applicable in many industries, such as automotive, telecom, defence, government, bank, retail, and education. We educate future engineers who are qualified to design software with high quality and low development and maintenance costs. But we also educate future researchers who can work innovatively and conduct advanced experiments with technology within software engineering. We help you succeed. You will have the opportunity to do an industrial practice project, which is 15 credits gained during an internship with a company. Furthermore, you may conduct your master's thesis in collaboration with a company. The master's programme in Software Engineering and Management has been selected by the Swedish Institute to nominate candidates for scholarships. Please visit the webpages of the Swedish Institute for more information on how to apply for a scholarship.",
    "program_structure": "The master's programme in Software Engineering and Management offers a combination of advanced technical knowledge and management skills. It consists of mandatory courses providing a solid foundation in central areas of software engineering, elective courses enabling you to specialize in your personal fields of interest, and a final master's thesis. You will learn how to identify the best available methods and tools, become knowledgeable about the industrial field of software engineering, and practise group research activities. The programme allows you to specialize your education into a unique profile by choosing among elective courses within applied information technology, computer science, or information systems. In the third semester, you will engage in a real project that synthesizes and applies your knowledge from previous courses and makes a concrete contribution to existing software. The programme culminates with your master's thesis, an opportunity for further specialization.",
    "who_should_apply": "Are you interested in developing high quality software systems, ready for use in safety-critical systems, such as autonomous cars? Do you want to manage software projects that have a real positive impact on users? Do you want to design systems today that can adapt to tomorrow's demands and can be sustained over many years? If you want to become a professional software engineer who can contribute constructively to both software intensive industries and society, then apply for the master's programme in Software Engineering and Management.",
    "after_graduation": "Graduates of the programme receive a degree of Master of Science with a major in Software Engineering. You will be equipped for further academic studies at the doctoral level or to enter different roles involved in the development of software, such as developer, tester, quality manager, software architect, and project manager. Examples of companies where our alumni work are Ericsson, Volvo, IBM, Sigma IT Consulting, ABB, NASDAQ, Saab, and HiQ.",
    "facilities": "The master's programme is given by the Department of Computer Science and Engineering, Division of Software Engineering, which is located in the middle of Sweden's leading technology hub, Lindholmen Science Park, close to the city center in Gothenburg.",
    "exchange_opportunities": null
  }
}