{
  "metadata": {
    "source_document": "DIT891.pdf",
    "course_code": "DIT891",
    "course_title": "Project in Data Science",
    "swedish_title": "Projekt i Data Science",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Data Science",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2018-02-02",
    "valid_from_date": "2018-08-20",
    "programmes": [
      "Applied Data Science Master's Programme (N2ADS)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2018-02-02 to be valid from 2018-08-20, autumn semester of 2018.",
    "Position in the educational system": "The course is offered within the Applied Data Science Master's Programme.\nThe course can be part of the following programme: 1) Applied Data Science Master's Programme (N2ADS)",
    "Entry requirements": "To be eligible to the course, the student should have a Bachelor's degree, and have successfully completed 15 credits of courses within the subject Data Science.\nThe subject of the proposed project must be within the field of Data Science and have been approved by the Head of the Programme, who also decides whether or not the student has the required prerequisites within the subject area to carry out the particular project.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student should be able to:\nKnowledge and understanding\n• integrate knowledge from disparate fields\nCompetence and skills\n•\n• work on a complex task which has a clear goal but in general no predefined result,\napply various skills, such as\n•problem recognition, modelling and solving,\n•application and adaptation of textbook methods,\n•independent literature investigation,\n•implementation of software and/or use of existing software packages,\n•drawing conclusions from experimental results\n• communicate and present results efficiently, both in writing and orally\nJudgement and approach\n• plan the steps of a complex work, set up intermediate goals and keep the project running, come to realistic estimates of resources and achievable results, revise goals and develop work-arounds if necessary\n• document the work in such a way that others can build on it later on",
    "Course content": "The course aims to provide knowledge and training in professional development of projects which involves working in a coordinated way to plan, implement and monitor the project, with great emphasis on written commincation. During the course, students carry out an academically or industrially relevant project in the area of data science. The student will carry out the project individually or in groups.\nThe subject can be freely chosen within the area of Data Science. The project can either suggested by the students themselves or by a potential supervisor.",
    "Sub-courses": null,
    "Form of teaching": "The student shall individually or in a group of maximum 4 students develop a project.\nThe student is responsible for making contact with an academic supervisor who can\ncontinuously monitor the student's work for the duration of the course. Before the\nproject starts, a project plan must be approved by the programme responsible and the\nacademic supervisor.",
    "Assessment": "The course is examined by submission of a project (e.g., in the form of program code and documentation), an oral presentation and a written report.\nIf a student, who has failed the same examined component twice, wishes to change examiner before the next examination, a written application shall be sent to the department responsible for the course and shall be granted unless there are special reasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the student shall normally be guaranteed at least three examination occasions (including the ordinary examination) during a period of at least one year from the last time the course was given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nTo pass the course, the individual student must have contributed in a reasonable way to the final project results of the team, and must be able to explain the work of the team related to the report.\nThe final grade of the course is based on the written report, the oral presentation, and how well the student has contributed to the final project results of the team.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between teachers and student representatives. Further, an anonymous questionnaire is used to ensure written information. The outcome of the evaluations serves to improve the course by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "The choice of the course material depends on the chosen project and will be determined jointly by the students and their supervisor at the beginning of the work."
  }
}