{
  "metadata": {
    "source_document": "DIT851.pdf",
    "course_code": "DIT851",
    "course_title": "Introduction to Data Science",
    "swedish_title": "Introduktion till Data Science",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Data Science",
    "specialization": "AIN, Second cycle, has only first-cycle\ncourse/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2017-01-05",
    "valid_from_date": "2017-08-28",
    "programmes": [
      "Applied Data Science Master's Programme (N2ADS)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2017-01-05 to be valid from 2017-08-28, autumn semester of 2017.",
    "Position in the educational system": "The course is a compulsory course within the Applied Data Science Master's\nProgramme.\nThe course can be part of the following programme: 1) Applied Data Science Master's\nProgramme (N2ADS)",
    "Entry requirements": "To be eligible to the course, the student should have a Bachelor's degree in a subject\nrelevant to Data Science.\nIn addition, at least 15 credits of programming are required.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• describe fundamental types of analysis problems arising in data science;\n• give examples of data science applications from different contexts;\nSkills and abilities\n•\n•\nuse Python to implement basic transformations, visualizations and analyses of\nexample data;\napply simple machine learning methods implemented in a standard library;\n• identify appropriate types of analysis problems for concrete applications;\nJudgement and approach\n• reflect on inherent limitations of results of data science methods and\n• critically analyze data science applications with respect to ethics and privacy.",
    "Course content": "The course gives an introduction to applied data science using case studies from\ndifferent application domains and a primer in using Python for data science.\nIn the course, the following topics will be covered:\n• revision of mathematical and statistical concepts useful in data science, such as basic\nset theory, logic, and probability theory,\n• case studies of data science applications displaying a range of application areas and\nfundamental types of analysis problems,\n• a brief introduction to working in a Unix/Linux environment and programming in\nPython to implement basic transformations, visualizations and analyses,\n• use of a machine learning library from Python to analyse data,\n• demonstration of inherent limitations of computational analyses with examples,\n• implications on privacy and ethical considerations.",
    "Sub-courses": "1. Written examination (Skriftlig tentamen), 4 higher education credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)\n2. Written assignments (Skriftliga inlämningsuppgifter), 3.5 higher education credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)",
    "Form of teaching": "Lectures, computer sessions, and exercise sessions.",
    "Assessment": "The course is examined by an individual written exam carried out in an examination\nhall, as well as mandatory written assignments submitted as written reports, some of\nwhich will be carried out individually and others in groups of normally 2-4 students.\nThere will be non-obligatory individual assignments which grant bonus points for the\nwritten exam. These bonus points are valid for the whole academic year.\nIf a student who has failed the same examined component twice wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nIn order to be awarded a Pass (G) for a full course, the grade G must be obtained on\nboth the sub-courses. To be awarded Pass with Distinction (VG) for the full course,\nthe grade VG must be obtained on both the sub-courses.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "The programming language Python will be used in this course and in some other courses\nin the Applied Data Science Master's programme for examples and assignments.\nCourse literature to be announced the latest 8 weeks prior to the start of the course."
  }
}