{
  "metadata": {
    "source_document": "TIA106.pdf",
    "course_code": "TIA106",
    "course_title": "Graphical Interfaces",
    "swedish_title": "Graphical Interfaces",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science, Interaction Design",
    "specialization": "Computer Science: AIN, Second cycle, has only first-cycle course/s as entry requirements; Interaction Design: A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2011-02-15",
    "valid_from_date": "2018-08-19",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Computer Science, Bachelor's Programme (N1COS)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2011-02-15 and was\nlast revised on 2018-02-09 by Department of Computer Science and Engineering to be\nvalid from 2018-08-19, autumn semester of 2018.",
    "Position in the educational system": "The course is provided as a part of the Computer Science Master's Programme N2COS.\nThe course is also offered as a programme course in the Computer Science Bachelors\nProgramme N1COS. Please note the entrance qualifications for programme students in\nNICOS below for this course. The course is also offered as a single subject course.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Applied Data Science Master's Programme (N2ADS) and 3)\nComputer Science, Bachelor's Programme (N1COS)",
    "Entry requirements": "To be eligible for the course the student must have a Bachelor degree of 180 hec.\nAdditionally, the course TIG095 Human Computer Interaction 7.5 credits, or the\nequivalent is required.\nTo be eligible for this course as a programme student in Science Bachelors Programme\nNICOS, the student must have passed at least 90 credits in programme courses and the\nadditional course TIG095 Human Computer Interaction 7.5 credits.",
    "Learning outcomes": "After completing the course the student is expected to be able to:\nKnowledge and understanding\n• adapt a graphical interfaces towards use and users,\n•\nuse different graphical interface elements,\n•\nuse keypaths and scenarios to create an interaction sequence,\n• apply commonly used interaction design solutions for graphical interfaces,\n• utilize wireframes to create a layout of a graphical interface.\nSkills and abilities\n• design a graphical user interface adapted to a specific use and user in terms of:\nlayout, interaction sequence, correct use of controls and look and feel.\nJudgement and approach\n• solve interaction design problems related to graphical interfaces and motivate\nyoursolutions,\n• design a relatively complex graphic interface, and be able to provide a valid design\nrationale for it,\n• understand the difference between different platforms; their constraints and\npossibilities,\n• select and apply previous existing design solutions to new graphical interfaces,\n• based on a scenario, extract a user's needs in terms of graphical interface solutions.",
    "Course content": "The course is highly practical. Lectures and literature give a theoretical foundation, but\nthis theory is immediately put into practice in a series of small exercises and a few larger\nprojects. When practicing, focus is upon motivating, making and analyzing the design\ndecisions made. Most of the work is done in groups of various sizes but there is also a\nsignificant amount of individual work. Content includes:\n• Commonly used interaction design solutions in graphical interfaces\n• Designing for users on different levels (e.g. beginners vs. experts)\n•\nKeypaths and scenarios\n• Designing interaction sequences\n• The process from task to graphical user interface design\n• Layout of graphical user interfaces; wireframing\n• Designing look and feel; using color, text and graphics\n• Correct use of graphical user interface elements such as controls, toolbars, menus,\ndialogues etc.\n• Designing for smart phones and other non-traditional graphical interfaces",
    "Sub-courses": "",
    "Form of teaching": "Language of instruction: English",
    "Assessment": "The course is examined through three modules, namely:\n1. Group-based lab exercise 2 credits (Pass with Distinction/Pass/Fail) and\n2. Individual written exam that takes place in an examination hall 2 credits (Pass with\nDistinction/Pass/Fail)\n3. Individual design project 3,5 credits (Pass with Distinction/Pass/Fail)",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nIn order to receive Pass on the entire course, the student needs to receive at least Pass on\nall three modules. In order to receive Pass with Distinction (VG) the student must\nreceive Pass with Distinction on at least two modules.",
    "Course evaluation": "After completion of the course the students are to be given the possibility of\nparticipating in course anonymously. As far as possible, evaluations are to be completed\nelectronically. Continuous evaluation will be used, including three meetings between\nteacher(s) and student representatives. Additionally, the course will be evaluated with a\ncourse questionnaire, and discussed with the student representatives.",
    "Additional information": "It is recommended that students completed the course TIA108 Prototyping in\nInteraction Design."
  }
}