{
  "metadata": {
    "source_document": "DIT008.md",
    "course_code": "DIT008",
    "course_title": "Discrete mathematics",
    "swedish_title": "Diskret matematik",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "cycle": "First cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-06-19",
    "valid_from_date": "Autumn term 2024",
    "programmes": [
      "N1SOF Software Engineering and Management Bachelor's Programme"
    ]
  },
  "sections": {
    "Position in the educational system": "The course is a compulsory course in the N1SOF Software Engineering and Management Bachelor's Programme.",
    "Entry requirements": "English 6, Mathematics 3b or 3c",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n**Knowledge and understanding**\n\n- explain terminology and properties of commonly used discrete structures (for example, integers, tree structures, and graphs),\n- explain proof techniques (such as contradiction proof and induction) for discrete structures and iterative processes,\n\n**Competence and skills**\n\n- choose and apply appropriate discrete structures to describe and reason about common computing and programming situations\n- conduct and present own mathematical reasoning and proofs,\n\n**Judgement and approach**\n\n- identify and use appropriate mathematical tools in common situations that arise in computing and programming\n- assess and criticize mathematical reasoning and evidence presented by a third party",
    "Course content": "The course provides basic knowledge of discrete mathematical structures that are needed as prerequisites for further university studies in computing and programming . The course emphasizes the important role of mathematics in the student's future studies and in the data area as a whole.\n\nThe course provides a concrete picture and forward-looking view of both the major classic fundamental questions in computing and programming (for example the Halting problem, P vs. NP), as well as the major current challenges in the data area (e.g. \"big data\", multi -core revolution), and what role mathematics plays in these issues.\n\nThe course motivates relevant mathematical concepts and techniques using computing and programming examples (for example programming problems, network algorithms, or estimation of software complexity).",
    "Sub-courses": "Written hall examination, 4.5 Credits\n\nAssignments, 3 Credits",
    "Form of teaching": "The teaching consists of lectures and exercises, as well as supervision in connection to the exercises.",
    "Assessment": "The course is examined by an individual written hall exam at the end of the course and written assignments normally carried out in groups of students. The assignments part is examined on the basis of solutions to compulsory problems handed in during the course and on the basis of individual contribution to the groups work.\n\nIf a student who has twice received a failing grade for the same examination component wishes to change examiner ahead of the next examination session, such a request should be made to the department in writing and should be approved by the department unless there are special reasons to the contrary (Chapter 6 Section 22 of the Higher Education Ordinance).\n\nIf a student has received a recommendation from the University of Gothenburg for study support for students with disabilities, the examiner may, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources are required, decide to allow the student to sit an adjusted exam or alternative form of assessment.\n\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years after the course has ceased/been changed. The same applies to internships and professional placements (VFU), although this is restricted to just one additional examination session.",
    "Grades": "Sub-courses\n\n1. Written exam (Tentamen), 4.5 credits\n\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Assignements (Inlämningsuppgifter), 3 credits\n\nGrading scale: Pass (G) and Fail (U)\n\nThe grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U).\n\nIn order to pass the course both the assignments and the written hall examination have to be approved. The final grade in the course is decided from the grade of the written hall examination.",
    "Course evaluation": "The results of and possible changes to the course will be shared with students who participated in the evaluation and students who are starting the course.",
    "Additional information": "Course literature to be announced the latest 8 weeks prior to the start of the course."
  }
}