{
  "metadata": {
    "source_document": "DIT114.md",
    "course_code": "DIT114",
    "course_title": "Project: Systems Development",
    "swedish_title": "Projekt: Systemutveckling",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "cycle": "First cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-06-19",
    "valid_from_date": "Spring term 2025",
    "programmes": [
      "N1SOF Software Engineering and Management Bachelor's Programme"
    ]
  },
  "sections": {
    "Position in the educational system": "The course is a compulsory course in the N1SOF Software Engineering and Management Bachelor's Programme.",
    "Entry requirements": "To be eligible for this course, students must have successfully completed the following courses, or equivalent:\n\n- Data Managment, 7,5 hec,\n- Fundamentals of Programming, 7,5 hec,\n- Object-oriented Programming 7,5 hec, and\n- Project: Agile Software Project Management, 7,5 hec.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n**Knowledge and understanding**\n\n- Define and explain software in a system context.\n- Describe system requirements, system and software design, and relations between the requirements, software design, and the source code (e.g., traceability between requirements and code changes).\n- Describe version control systems, such as git, and their role to support software development processes.\n\n**Competence and skills**\n\n- Organize software development teams and conduct software development projects,using modern software engineering methodologies such as agile development\n- Elicit, analyze, and document requirements in the form of a requirements specification\n- Setup and implement software projects using modern software development technologies such as version control systems, automated build tools (e.g., Gradle, or Maven), automated tests, and continuous integration.\n- Identify and apply strategies for collaborative software development using version control systems (e.g., git, workflows, code reviewing, resolving merge conflicts)\n- Identify, implement, and integrate software and non-software components using modern programming languages.\n- Create high-level software artefacts to represent the integration of components in a software system (e.g., diagrams, requirements specification, user stories).\n\n**Judgement and approach**\n\n- Reflect on integration between software and non-software components (e.g., hardware components)\n- Evaluate and argue for the quality of artefacts in a software project (e.g., requirements, design artefacts, code, commit history)",
    "Course content": "The course introduces a project, in a problem-based learning approach, guided by realistic and challenging customer requirements. The project course is organized as group work.\n\nThe student shall deliver a design specification of the system under construction. The design shall be implemented, and result in a working and tested software prototype. In this course the student learn to analyse the demands of a customer, capture these in a software requirements specification and to design and develop software from this analysis and to verify and validate that the software developed satisfies the given requirements.\n\nFurther, the student will learn to plan a project, work in a project team and use the software project development methods.\n\nThe studies will use systems that consists of non-software parts such as hardware platform, sensor and actuators, and software parts that include software platform and software components. The student will design and implement the software components, test and analyse the system in respect to the defined requirements.",
    "Sub-courses": "Project, 7.5 Credits",
    "Form of teaching": "The teaching consists of introductory lectures, weekly group meetings, seminars, as well as supervision in connection to the meetings.\n\n_Language of instruction_: English",
    "Assessment": "The course is examined through written artifact review and oral examinations based on the course learning outcomes. The work is carried out in groups of students. The student group must produce and present a demonstrable system as a deliverable of their project. The course is also examined by a final written report.\n\nStudents are required to complete written self- and peer-assessment forms during the course which will be part of the assessment of the student's individual contribution to the project.\n\nIn case a student fully participated in the project work, but failed the project in a few elements, one individual re-examination is provided. In case the student did not contribute to the project work, or failed the re-examination, the student must join a new project group.\n\nIf a student who has twice received a failing grade for the same examination component wishes to change examiner ahead of the next examination session, such a request should be made to the department in writing and should be approved by the department unless there are special reasons to the contrary (Chapter 6 Section 22 of the Higher Education Ordinance).\n\nIf a student has received a recommendation from the University of Gothenburg for study support for students with disabilities, the examiner may, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources are required, decide to allow the student to sit an adjusted exam or alternative form of assessment.\n\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years after the course has ceased/been changed. The same applies to internships and professional placements (VFU), although this is restricted to just one additional examination session.",
    "Grades": "**Sub-courses**\n\n1. Project (Projekt), 7.5 credits\n\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n\nThe grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U). To pass the course, all mandatory components must be passed. To earn a higher grade than Pass, a higher weighted average from the grades of the components is required.",
    "Course evaluation": "The results of and possible changes to the course will be shared with students who participated in the evaluation and students who are starting the course.",
    "Additional information": "Course literature to be announced the latest 8 weeks prior to the start of the course.\n\nThe course replaces the course DIT113, 7.5 credits. The course cannot be included in a degree which contains DIT113. Neither can the course be included in a degree which is based on another degree in which the course DIT113 is included."
  }
}