{
  "metadata": {
    "source_document": "DIT592.md",
    "course_code": "DIT592",
    "course_title": "Software engineering: Theory and practice",
    "swedish_title": "Programvaruutveckling: teori och praktisk tillämpning",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "cycle": "First cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-11-08",
    "valid_from_date": "Autumn term 2025",
    "programmes": [
      "Computer science, bachelors programme (N1COS)",
      "Computer science, masters programme (N2COS)",
      "Software engineering and management, masters programme (N2SOF)"
    ]
  },
  "sections": {
    "Position in the educational system": "The course can be part of the following programmes:\n\n1. Computer science, bachelors programme (N1COS)\n2. Computer science, masters programme (N2COS)\n3. Software engineering and management, masters programme (N2SOF)\n\nThe course is a also a single-subject course at Gothenburg University.",
    "Entry requirements": "The student must know Java programming and must have sucessfully completed courses on data structures and algorithms (e.g., DIT183) as well as on object-oriented programming(e.g., DIT044, DIT954) of 7.5hp each.\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n_Knowledge and understanding_\n\n- Understand the core principles of software engineering, including various software development life cycles (SDLC), requirements engineering, and software architecture design.\n- Describe strategies for software testing, maintenance, and evolution, as well as methods for real-time and safety-critical software engineering.\n- Recognize the challenges and strategies of integrating software in complex systems and specific concerns in machine learning components.\n\n_Competence and skills_\n\n- Utilize professional tools for developing, testing, and analyzing software projects.\n- Design and evaluate scalable, maintainable, and efficient software architectures.\n- Apply software engineering principles to develop solutions in specialized areas such as real-time, safety-critical, and learning-enabled systems.\n\n_Judgement and approach_\n\n- Critically assess different SDLC models and software engineering techniques to determine their effectiveness for specific projects.\n- Evaluate and integrate software solutions across a variety of applications, including real-time, safety-critical, and learning-enabled systems.\n- Understand how software development practices are applied in sectors like finance, telecommunications, and automation.",
    "Course content": "The course \"Software engineering: Theory and practice\" is designed to equip students with the knowledge and skills necessary to develop, manage, and maintain software systems across various industries. Starting with a foundation in general software engineering principles, students will explore the many challenges of designing software architectures, requirement engineering, and testing strategies. The course contains specialized topics such as real-time software engineering, software reuse, and the development of learning-enabled systems, emphasizing the unique challenges these systems present. Particular attention is given to safety-critical software engineering, essential for sectors like automotive and aerospace, where reliability and compliance with stringent standards are paramount.",
    "Sub-courses": "Assignments, 5 Credits\n\nWritten hall examination, 2.5 Credits",
    "Form of teaching": "There will be lectures and exercise sessions. The sessions are a base to the individual assignments which are designed for the students to be familiar with practical applications of theoretical concepts taught in the lectures and professional software engineering tools.\n\n_Language of instruction_: English",
    "Assessment": "The course is examined by an individual exam and a set of homework assignments normally carried out in groups of students.\n\nIf a student who has been failed twice for the same examination element wishes to change examiner before the next examination session, such a request is to be granted unless there are specific reasons to the contrary (Chapter 6 Section 22 HF).\n\nIf a student has received a certificate of disability study support from the University of Gothenburg with a recommendation of adapted examination and/or adapted forms of assessment, an examiner may decide, if this is consistent with the course’s intended learning outcomes and provided that no unreasonable resources would be needed, to grant the student adapted examination and/or adapted forms of assessment.\n\nIf a course has been discontinued or undergone major changes, the student must be offered at least two examination sessions in addition to ordinary examination sessions. These sessions are to be spread over a period of at least one year but no more than two years after the course has been discontinued/changed. The same applies to placement and internship (VFU) except that this is restricted to only one further examination session.\n\nIf a student has been notified that they fulfil the requirements for being a student at Riksidrottsuniversitetet (RIU student), to combine elite sports activities with studies, the examiner is entitled to decide on adaptation of examinations if this is done in accordance with the Local rules regarding RIU students at the University of Gothenburg.",
    "Grades": "_Sub-courses_\n\n1. Written hall examination, 2.5 credits\n\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Assignments, 5 credits\n\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n\nThe examination consists of two parts: an individual written exam (2.5 hec) and completion of mandatory homework assignments (5 hec).\n\nIn order to pass the course, both the final exam and the homework assignment have to be passed. The final grade will be based on the following: written hall examination * 0.33 + assignments* 0.67, rounded to the nearest integer number.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between teachers and student representatives. Further, an anonymous questionnaire is used to ensure written information. The outcome of the evaluations serves to improve the course by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\n\nThe course replaces the course DIT593, 7.5 credits. The course cannot be included in a degree which contains DIT593. Neither can the course be included in a degree which is based on another degree in which the course DIT593 is included"
  }
}