{
  "metadata": {
    "source_document": "TIA400.md",
    "course_code": "TIA400",
    "course_title": "Introduction to Human-centered AI",
    "swedish_title": "Introduktion till Human-centered AI",
    "department": "Department of Applied Information Technology",
    "credits": "15",
    "cycle": "Second cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-06-10",
    "valid_from_date": "Autumn Semester 2024",
    "programmes": [
      "Human-centered Artificial Intelligence Master's Programme (T2HAI)"
    ]
  },
  "sections": {
    "Position in the educational system": "This course is a compulsory course in Human-centered Artificial\n\nIntelligence Master's Programme (T2HAI).",
    "Entry requirements": "To be eligible for the course the student must have a Bachelor's degree (180 credits), andmust also have completed the following courses or equivalent:\n\n- Programming in a general programming language (at least 7.5 credits)\n- Human-Computer Interaction (at least 7.5 credits)\n- Artificial intelligence or machine learning (at least 7.5 credits),\n\nApplicants must prove their knowledge of English: English 6/English B from SwedishUpper Secondary School or the equivalent level of an internationally recognized test, forexample, TOEFL, IELTS, or alternatively a bachelor's degree from education held inEnglish.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n_Knowledge and understanding_\n\n- describe and compare different perspectives on human-centered AI;\n- describe the implications of AI to the future of work, including learning, decisionmaking, innovation and organizational transformation;\n\n_Competence and skills_\n\n- use machine learning methods on structured and unstructured data;\n- analyze implications of AI systems in the organizational setting;\n\n_Judgement and approach_\n\n- reflect on machine learning practice;\n- discuss tensions between human-centered and technology-centered approaches to AI;\n- critically reflect on the perspectives of human-centered AI presented in the course.",
    "Course content": "The course reviews various perspectives on AI practice, its history, and approaches to development. AI and organizational transformation is reviewed, and AI in organizational decision-making examined. The technological primacy of the AI field is problematized. The participants are made aware of the multitude of perspectives on HCAI, provided an overview of the MSc program, and potential learning tracks are established.\n\nNext in the course, the socio-technical perspective is reviewed. AI technologies have a profound effect on organizations in all sectors (private, public, and non-profit). The opportunities and challenges are drawn from case studies to understand how AI will affect the future of organizations and society. Such opportunities as human-AI collaboration, leadership, and innovation effects are discussed in the context of organizational transformation.\n\nOverall, the course gives theoretical and empirical perspectives on human-centered AI in organizations and society.\n\nThe course consist of three modules:\n\n1. **Background and Perspectives**, 6 credits\n\n\nIn the first module, the course introduces the perspectives on human-centered artificial intelligence practice and discusses the history and current state of the field.\n2. **The Implications of AI on Humans and Organizations**, 6 credits\n\n\nThe second module reviews AI and Organizational Transformation, Automation & Augmentation, AI in organizational decision-making.\n3. **Methods**, 3 credits\n\n\nIn the last module, the course introduces 1) approaches to hands-on machine learning and 2) an overview of the methods for the analysis of organizational consequences of AI.",
    "Sub-courses": "Background and Perspectives, 6 Credits\n\nThe Implications of AI on Humans and Organizations, 6 Credits\n\nMethods, 3 Credits",
    "Form of teaching": "The course includes lectures, seminars, workshops and group work. The course aims at delivering extensive formative as well as summative assessment. To this end students are expected to actively participate and contribute to their own and other students' learning.\n\nLanguage of instruction: English",
    "Assessment": "**Background and Perspectives**\n\nThis module is assessed through an individual exam.\n\n**The Implications of AI on Humans and Organizations**\n\nThis module is assessed through weekly tasks related to the content of the week, and group work where students organize and lead a seminar on organizational effects of AI followed by a summative presentation of their work.\n\n**Methods**\n\nThis module is assessed through a group project.\n\nIf a student is prevented from taking part in group work for a legitimate reason of absence (e.g., medical condition, caretaking responsibilities), the examiner may decide to provide an alternative form of examination.\n\nIf a student who has twice received a failing grade for the same examination component wishes to change examiner ahead of the next examination session, such a request should be made to the department in writing and should be approved by the department unless there are special reasons to the contrary (Chapter 6 Section 22 of the Higher Education Ordinance).\n\nIf a student has received a recommendation from the University of Gothenburg for study support for students with disabilities, the examiner may, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources are required, decide to allow the student to sit an adjusted exam or alternative form of assessment.\n\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years after the course has ceased/been changed. The same applies to internships and professional placements (VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass (G) and Fail (U).\n\nIn order to get a Pass for the whole course, a student must get a Pass for all parts of the examination.",
    "Course evaluation": "After completion, the course will be evaluated by the students. The results of the evaluation are reported to the director of studies and discussed with the students. A summary of the evaluation results together with the suggestions for improvement is to be made available to students and teachers.",
    "Additional information": null
  }
}