{
  "metadata": {
    "source_document": "DIT031.pdf",
    "course_code": "DIT031",
    "course_title": "Simulation Engines",
    "swedish_title": "Simulation Engines",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science-Interaction Design",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2009-09-15",
    "valid_from_date": "2010-09-01",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)",
      "No translation available (NDATM)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2009-09-15 to be valid\nfrom 2010-09-01.",
    "Position in the educational system": "The course is a part of the Computer Science Masters programme and an elective course\nat the University of Gothenburg.\nSecond cycle, the course has course/courses at second cycle level as entry requirements.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Computer Science, Bachelor's Programme (N1COS) and 3)\nNo translation available (NDATM)",
    "Entry requirements": "To be eligible for the course\nstudents should have successfully completed two years studies within the subject\nComputer Science or equivalent. Specifically a course within Computer Graphics is\nrequired.",
    "Learning outcomes": "The course aims to give an understanding of components in modern interactive\nsimulation engines.\nAfter completing the course the student is expected to be able to:\n• Understand the typical structure of simulation engines and the requirements of\nspecific parts of such engines\n• Understand what public libraries and programs can be combined with simulation\nengines to provide the required functionality of an interactive simulation\n• Analyze existing simulation engines to determine functionality and extendibility\n• Plan several parallel extensions of a simulation engine while minimizing\ndependencies\n• Extend existing simulation engines to augment functionality while maintaining\nstability and having predictable consequences on resource use\n• Present extensions of a simulation engine through demonstrators and public\npresentations\n• After completion of the course the student IS expected to be able to",
    "Course content": "The modeling and implementation of the fundamental components of interactive\nsimulations is the core of the Simulation Engine course. As given by the main use areas\nof these systems, simulations within the automobile and aviation industry and 3D\ngames, the course focuses mainly upon 3 dimensional interactive simulations although\nother types of simulation are also included. The visual components of interactive\nsimulations are given most focus within the course but connections to related areas such\nas networking, artificial intelligence and physics simulations are covered.",
    "Sub-courses": "",
    "Form of teaching": "Language of instruction: English\nThe course is held in English.",
    "Assessment": "The course is graded by students' group project presentation and documentation as well\nas individual report and engine expansion suggestion (grading). Presence at the public\npresentation is also required to pass. A student who has failed a test twice has the right\nto change examiners, if it is possible. A written application should be sent to the\nDepartment.",
    "Grades": "The grading scale comprises: Fail, Pass, Pass with distinction.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire can be used\nto ensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.",
    "Additional information": ""
  }
}