{
  "metadata": {
    "source_document": "DIT098.pdf",
    "course_code": "DIT098",
    "course_title": "Gameplay Design",
    "swedish_title": "Gameplay Design",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science-Interaction Design, Interaction Design",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2020-11-03",
    "valid_from_date": "2021-08-30",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Game Design & Technology Master's Programme (N2GDT)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ],
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "3 Nov 2025 - 18 Jan 2026",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86109",
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2020-11-03 to be valid from 2021-08-30, autumn semester of 2021.",
    "Position in the educational system": "The course is offered as a single subject course and is mandatory within the programme\nGame Design & Technology Master's programme (N2GDT).\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Applied Data Science Master's Programme (N2ADS), 3)\nGame Design & Technology Master's Programme (N2GDT) and 4) Software\nEngineering and Management Master's Programme (N2SOF)",
    "Entry requirements": "To be eligible for the course the student must have a Bachelor's degree, 180 higher\neducation credits or have passed 60 higher education credits in the subject Computer\nScience.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After successfully completing the course, the student should be able to:\nKnowledge and understanding\n• Describe the role of a fame designer within a game design project.\n• Discuss game design features explicitly using both de facto industry concepts and\ntheoretical frameworks.\n• Relate current game designs to earlier examples, from the direct predecessors to the\nfirst recorded example of similar games.\nCompetence and skills\n• Plan game design projects according to best practice description.\n• Develop a game design concept from initial idea to a full game design document,\nusing iterative design processes and prototyping.\n• Specify target audience and develop specific game design concepts for specific target\naudience.\n• Present game design concepts for an audience.\nJudgement and approach\n• Motivate different perspectives on game games and use of games, both from\npractical and ethical aspects.\n• Analyze different game design using analytical tools to be able to suggest design\nchanges and compare different game designs.\n• Evaluate game concepts and prototypes from the needs of different target audiences.",
    "Course content": "Gameplay design focuses on how the rules and game components can be used to create\ngame environments that encourage and advocate specific interaction, either between\npeople or between people and the game system. The goal of these environments can vary\nfrom experimental environments in the automotive or aerospace industry, learning\nenvironments in simulations for pure entertainment environments on home computers\nor game consoles. The course covers general design methods that can be applied in all\nthese areas.\nThe course aims to provide an understanding of how all the components in a game\nenvironment interact with each other as well as the relations gameplay design have to\nother areas necessary for contemporary interactive simulations, such as programming\nand graphical design. Key issues addressed in the course is how to motivate users to\nsome specific interaction, the relationship between interaction and narrative, how to\nbalance the interaction in multi-user environments, how to support and encourage the\ncreativity of the user, how to modify the design solutions to suit both new and\nexperienced users as well as how to change design solutions to suit the interaction\nsessions with time constraints.",
    "Sub-courses": "1. Project (Projekt), 7.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The course is based around exercises and projects within the subject area which are\ncomplemented with lectures and workshops. Project work takes places in supervised\ngroups and aim to give practical training in the development and modifications of game\ndesign.\nLanguage of instruction: English",
    "Assessment": "The course is examined through three exercises and four tasks. The tasks are to be\nsubmitted in writing except two subtasks to one of the tasks that are practical.\nAll the parts are scored and added together for a final grade. When all steps are\ncompleted and approved one grade is reported in Ladok.\n\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\n\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nTo pass the course, all mandatory components must be passed. To earn a higher grade\nthan 3, a higher weighted average from the grades of the components is required.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire isused to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course TIA098, 7.5 credits. The course cannot be included in a\ndegree which contains TIA098. Neither can the course be included in a degree which is\nbased on another degree in which the course TIA098 is included.\n\nLast modified: 20 February 2025",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)"
  }
}