{
  "metadata": {
    "source_document": "DIT092.pdf",
    "course_code": "DIT092",
    "course_title": "Mini Project: Team Programming",
    "swedish_title": "Miniprojekt: Team-programmering",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "First Cycle",
    "main_field_of_study": "Software Engineering",
    "specialization": "G1F, First Cycle, has less than 60 credits in first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2017-06-09",
    "valid_from_date": "2017-08-28",
    "programmes": [
      "Software Engineering and Management Bachelor's Programme (N1SOF)",
      "Software Engineering and Management, Bachelor's Programme (N1SEM)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2017-06-09 to be valid from 2017-08-28, autumn semester of 2017.",
    "Position in the educational system": "The course is a compulsory course in the Software Engineering and Management\nBachelor's Programme.\nThe course can be part of the following programmes: 1) Software Engineering and\nManagement Bachelor's Programme (N1SOF) and 2) Software Engineering and\nManagement, Bachelor's Programme (N1SEM)",
    "Entry requirements": "To be eligible for this course, students must have completed 7,5 hec in object oriented\nprogramming (for example DIT042 Object-Oriented Programming, 7.5 hec).",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• relate software development to project and product management activities such as\nproject planning and cost estimation,\n• explain the impact of human factors and team dynamics on project efficiency and\nsuccess,\n• analyze a programming problem and describe the problem in an abstract way,\nSkills and abilities\n• define criteria for project reviews,\n• identify and manage the risks involved in a project,\n• resolve conflicts and negotiate successfully with project members,\n• design and implement an object oriented solution from a problem description,\n• communicate with stakeholders and solicit requirements,\nJudgement and approach\n• work in a project team, divide a project in tasks and dividing tasks among team\nmembers,\n• take individual responsibility within a project team,\n• communicate and interact professionally within a project team, and\n• communicate results of the project to interested parties in professional ways.",
    "Course content": "The course introduces the students the concepts and practices of software development\nprojects. The course has two general themes: (1) the importance of product, project, and\npeople management; (2) the process of creating software, the skill of programming and\nworking together as a team towards a common goal.\nThe purpose of this course is to give the students an introduction to the project\nmanagement area and the tools and techniques used to manage software development\nprojects. The course introduces the students to the human element and discusses people,\npersonalities and dynamics and the way in which they have an impact on IT projects.\nAreas such as cost estimation, risk management, and project evaluation are also\ndiscussed.\nAlong the second general theme, students work in groups to create a software prototype\nand relevant documentation from a conceptual idea and specification. During the\nproject the student is presented to a software development process to give the student a\nbasic understanding of fundamental phases like analysis, design, implementation and\ntest. The project part is organized as group work, enabling the student to practice and\ndevelop their skills to collaborate, communicate and take responsibility in project\ngroups. The project is realistic, based on a customer's need of an application. The\nproject requires the student to organize their work efficiently.",
    "Sub-courses": "1. Project (Projekt), 4.5 higher education credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)\n2. Assignments (Inlämningsuppgifter), 3 higher education credits\nGrading scale: Pass (G) and Fail (U)",
    "Form of teaching": "The teaching consists of introductory lectures, weekly group meetings, seminars, as well\nas supervision in connection to the meetings.\nLanguage of instruction: English",
    "Assessment": "The course is examined through artifact review and oral examination. The project part\nis is examined by a demonstrable system which is presented orally at a seminar at the\nend of the course. The project part is also examined by a final written report. The work\nis carried out in groups of 5-7 students.\nFurthermore, the student needs to submit a written report where the student shows his\nor her:\n• artifact contributions to the project and subgroup he/she was a member of,\n• role in the project group,\n• fulfillment of responsibilities for this role in terms of artifacts and activities,\n• interaction and knowledge transfer activities with others, and\n• how this contributed to the project as a whole.\nThe assignments part, also carried out in groups, is examined on the basis of solutions to\ncompulsory problems handed in during the course and on the basis of relative\ncontribution of the group members.\nStudents are required to complete written self- and peer-assessment forms during the\ncourse which will be part of the assessment of the student's individual contribution to\nthe project.\nIn case a student fails the project, one individual re-examination is provided. In case of\nfailing that re-examination, the student has to join a new project group. Retake\nexaminations of the assignments part consist of additional individual assignments.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nTo be awarded Pass (G) for a full course, the students must pass both the project part\nand the assignments part with at least grade (G). To be awarded Pass with Distinction\n(VG) for a full course, the student must, in addition, receive a VG on the project part.",
    "Course evaluation": "The course is evaluated through a meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "In cases where a course has been discontinued or has undergone major changes, the student shall normally be guaranteed at least three examination occasions (including the ordinary examination) during a period of at least one year from the last time the course was given.\nCourse literature to be announced 8 weeks prior to the start of the course."
  }
}