{
  "metadata": {
    "source_document": "DIT052.md",
    "course_code": "DIT052",
    "course_title": "Computer architecture",
    "swedish_title": "Datorarkitektur",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "cycle": "Second cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-11-26",
    "valid_from_date": "Vårterminen 2025",
    "programmes": [
      "Computer Science, bachelors programme (N1COS)",
      "Computer Science, masters programme (N2COS)",
      "Applied Data Science, masters programme (N2ADS)",
      "Game Design & Technology, masters programme (N2GDT)",
      "Software Engineering and Management, masters programme (N2SOF)"
    ],
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "1 Sep 2025 - 2 Nov 2025",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86133",
    "content_type": "course"
  },
  "sections": {
    "Position in the educational system": "The course can be part of the following programmes:\n\n1. Computer Science, bachelors programme (N1COS)\n2. Computer Science, masters programme (N2COS)\n3. Applied Data Science, masters programme (N2ADS)\n4. Game Design & Technology, masters programme (N2GDT)\n5. Software Engineering and Management, masters programme (N2SOF)\n\nThe course is a also a single-subject course at Gothenburg University.",
    "Entry requirements": "Requirements to participate in the course are that two years have been successfully completed in computer science or equivalent. The course DIT122 (Computer System Engineering) or equivalent is a prerequisite.\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student should be able to:\n\n**_Knowledge and understanding_**\n\n- Understanding of advanced instruction pipelining techniques to be able to execute computer instructions in parallel.\n- Understanding of principles behind modern memory hierarchies\n- Understanding of principles behind multi-core processors\n\n**_Skills and abilities_**\n\n- Knowledge and understanding of terminology and key concepts in computer architecture necessary to understand advances in research in the subject.\n\n**_Judgement ability and approach_**\n\n- Ability to quantitatively determine the impact of architectural techniques on the performance and power consumption of executing user programs by using modern simulation tools.",
    "Course content": "The course covers architectural techniques necessary to achieve high performance for user programs. It also covers simulation-based analysis methods for quantitative assessment of the impact of a particular architectural technique on performance.\n\nThe content is divided into the following parts:\n\n1. The first part covers aspects affecting the development of computer technology including Moore's Law, performance measures (execution time vs. throughput), benchmarking, and fundamentals of computer performance such as Amdahl's Law and memory access locality.\n\n2. The second part covers various techniques for exploiting instruction level parallelism (ILP) by defining key concepts of what ILP is and what limits it. The techniques covered fall into two categories: dynamic and static techniques. The main dynamic techniques covered are Tomasulo's algorithm, branch prediction and speculation. The most important static techniques are loop unrolling, software pipelining, trace scheduling and predicated instructions.\n\n3. The third part covers principles of modern memory hierarchies such as inclusive and non-inclusive memory hierarchies, lockup free caching techniques, prefetching, classification of cache misses.\n\n4. The fourth part deals with multi-core microprocessors and techniques such as multi-threading and cache coherence.",
    "Sub-courses": "Written hall examination, 6 Credits\n\n\nLaboratory work, 1.5 Credits",
    "Form of teaching": "The course is divided into lectures, exercises, three labs and an optional reading assignment that gives bonus points for the exam.\n\nThe course uses the pedagogy form of Flipped-classroom teaching. It is assumed that students prepare for each lecture by studying the recorded material. A quizz is given at each lecture. Three correct quizzes give bonus points to be used for a higher grade on a passed exam.\n\n_Language of instruction_: English",
    "Assessment": "The student is assessed based on submitted laboratory reports (1.5 hecs) individually or in groups and a written exam (6.0 hecs) individually in the exam room\n\nIf a student who has been failed twice for the same examination element wishes to change examiner before the next examination session, such a request is to be granted unless there are specific reasons to the contrary (Chapter 6 Section 22 HF).\n\nIf a student has received a certificate of disability study support from the University of Gothenburg with a recommendation of adapted examination and/or adapted forms of assessment, an examiner may decide, if this is consistent with the course’s intended learning outcomes and provided that no unreasonable resources would be needed, to grant the student adapted examination and/or adapted forms of assessment.\n\nIf a course has been discontinued or undergone major changes, the student must be offered at least two examination sessions in addition to ordinary examination sessions. These sessions are to be spread over a period of at least one year but no more than two years after the course has been discontinued/changed. The same applies to placement and internship (VFU) except that this is restricted to only one further examination session.\n\nIf a student has been notified that they fulfil the requirements for being a student at Riksidrottsuniversitetet (RIU student), to combine elite sports activities with studies, the examiner is entitled to decide on adaptation of examinations if this is done in accordance with the Local rules regarding RIU students at the University of Gothenburg.",
    "Grades": "_Sub-courses_\n\n1. **Written hall examination**, 6 credits\n\n\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. **Laboratory**, 1,5 credits\n\n\nGrading scale: Pass (G) and Fail (U)\n\nThe grading scale for the whole course comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U).\n\nFor grade 3, at least 40% of the total score on the exam is required. For grade 4, at least 60% of the total score on the exam is required and for grade 5, at least 80% of the total score on the exam is required. You can receive 4 bonus points if you answered correctly at least 3 quizzes given during lecture time. You can receive an additional 4 bonus points if you orally present the case study to the other course participants. These bonus points are added to the result on the exam and can be used for higher grades but not to pass the course. To be approved on the entire course, the labs (1.5 ECTS) and the exam (6 ECTS) must be approved. The grade of the entire course is the same as the grade of the exam.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between teachers and student representatives. Further, an anonymous questionnaire is used to ensure written information. The outcome of the evaluations serves to improve the course by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\n\nThe course replaces the course DIT051, 7.5 credits. The course cannot be included in a degree which contains DIT051. Neither can the course be included in a degree which is based on another degree in which the course DIT051 is included.\n\nLast modified: 21 February 2025",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)"
  }
}