{
  "metadata": {
    "source_document": "DIT007.md",
    "course_code": "DIT007",
    "course_title": "Human-Robot Interaction Design",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "iteration": "Spring 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "24 Mar 2025 - 8 Jun 2025",
    "application_period": "16 Sep 2024 - 15 Oct 2024",
    "application_code": "GU-86092"
  },
  "sections": {
    "About": "The research and development of robots range from domestic robots, autonomous robotic agents, virtual agents, and industrial robots. Human-Robot Interaction (HRI) is a discipline that is concerned with how we design, develop, and evaluate robotic agents with the user in the loop. This course introduces the HRI design practices, evaluation methods and approaches. In particular, the course will apply human-centered approaches to design for the (1) abilities to consider in a robot, the (2) interaction modalities a robot should have, and (3) the form and appearance of a robot. The course will also give an understanding of the impact robots can have on our society, and the importance of the ethical and critical considerations when designing them.",
    "Entry requirements": "To be eligible for the course the student must have a Bachelor degree of 180 credits. Additionally, a course in Human - computer interaction, 7.5 credits, is required.\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 19 253 SEK\n\nFirst payment: 19 253 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)",
    "Additional information": "Last modified: 22 November 2024"
  }
}