{
  "metadata": {
    "source_document": "DIT056.pdf",
    "course_code": "DIT056",
    "course_title": "Sustainable computing",
    "swedish_title": "Hållbar databehandling",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2021-11-15",
    "valid_from_date": "2022-08-29",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)"
    ],
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "3 Nov 2025 - 18 Jan 2026",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86091"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2021-11-15 to be valid from 2022-08-29, autumn semester of 2022.",
    "Position in the educational system": "The course is offered within several programmes. It is also a single subject course at the University of Gothenburg.\nThe course can be part of the following programmes: 1) Computer Science, Master's Programme (N2COS) and 2) Computer Science, Bachelor's Programme (N1COS)",
    "Entry requirements": "Students must have completed 7.5 credits in computer architecture (e.g., DIT051\nComputer Architecture, or equivalent).\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• describe why sustainable computing is an important current topic\n• describe the electrical mechanisms that cause power to be dissipated\n• describe circuit techniques for reducing power dissipation and the impact on\nperformance\n• describe computer architecture, memory, and secondary storage techniques for\nreducing energy consumption\n• describe techniques at the operating system, runtime, and application for reducing\nenergy consumption\n• explain what affects the energy consumption of computer systems especially\nconcerning their architecture\nCompetence and skills\n• use specific devices to directly measure energy consumption of the whole system\n• use performance counters to measure the energy consumption of certain\ncomponents in the system\n• use simulation tools to estimate the energy consumption of different system\nconfigurations\nJudgement and approach\n• identify the strengths and weaknesses of different classes of computer system\ncomponents (e.g. processor, memory), with respect to energy efficiency\n• evaluate and compare different architecture and system techniques in terms of the\nenergy efficiency\n• explain the methods for evaluating and reporting the energy consumption in\ncomputer systems and how these can be used to optimize the system\n• judge the importance of energy consumption from societal and ethical perspectives\n• interpret requirements on the architecture of computer systems to meet societal\nneeds for sustainability\nThe course is sustainability-focused, which means that at least one of the learning\noutcomes clearly shows that the course content meets at least one of the University of\nGothenburg's confirmed sustainability criteria. The content also constitutes the course's\nmain focus.",
    "Course content": "The aim of the course is to make students aware of the importance of sustainability in\ncomputing and to show techniques to achieve it at the different levels of a computer\nsystem.\nThe course is intended to give an overview of the energy efficiency aspects of computer\nsystems and computing, ranging from the electronic circuits up to the applications for\nsystems ranging from small IoT devices to large data centers. For instance, students will\nlearn about approaches to measuring and estimating the energy consumption of\ndifferent architectural components as well as architecture and software techniques to\nsave energy in the system.",
    "Sub-courses": "Sub-courses\n1. Written hall examination (Skriftlig salstentamen), 6 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Laboratory (Laboration), 1.5 credits\nGrading scale: Pass (G) and Fail (U)",
    "Form of teaching": "Teaching is through lectures, class exercises, and laboratory sessions. The course\nconsists of a lecture series, homework assignments, and labs assignments including a\ngroup project.\nStudents will present the results of their homework and in-class assignments through\nshort oral presentations to demonstrate their understanding and to facilitate discussion.\nDiscussions will not only focus on technology, but also on how that technology affects\nthe world's carbon footprint and will likely impact society now and in future\ngenerations.\nLanguage of instruction: English",
    "Assessment": "The course is examined by an individual written exam done in an examination hall and\napproved lab exercises. The lab work is done in groups of normally 2-3 students.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nIn order to get one of the grades 5, 4 or 3 one has to get the grade G on the sub-course\nAssignments, and a passing grade (5, 4 or 3) on the sub-course Written hall\nexamination. In that case the grade on the course is the grade on the sub-course Written\nhall examination. In other cases the grade on the course is U (fail).",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT055, 7.5 credits. The course cannot be included in a\ndegree which contains DIT055. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT055 is included.\n\nLast modified 20 February 2025",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)"
  }
}