{
  "metadata": {
    "source_document": "DIT034.md",
    "course_code": "DIT034",
    "course_title": "Data Management",
    "swedish_title": "Systematisk Datahantering",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "cycle": "First cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-06-19",
    "valid_from_date": "Spring term 2025",
    "programmes": [
      "N1SOF Software Engineering and Management Bachelor's Programme"
    ],
    "content_type": "course"
  },
  "sections": {
    "Position in the educational system": "The course is a compulsory course in the N1SOF Software Engineering and Management Bachelor's Programme.",
    "Entry requirements": "To be eligible for the course, students must have successfully completed 7.5 hec in programaming (for example Fundamentals of Programming).",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n**Knowledge and understanding**\n\n- explain the differences between data, information and knowledge\n- explain basic concepts: relational data model, non-relational data model, entity-relationship model, relational database design, relational algebra and the database language SQL\n- explain the ideas of distributed and NoSQL databases, and contrast them to the relational model\n\n**Competence and skills**\n\n- construct an algorithm for querying and filtering data based on predefined criteria\n- manage the process of collecting and representing data in a database\n- build a data model (entity-relationship model)\n- create database tables, and formulate database queries in SQL\n- experiment with data technologies such as big data and open data\n- manage and query NoSQL database systems\n\n**Judgement and approach**\n\n- assess the quality of data and correctness of data models\n- evaluate the applicability of data management techniques for a given purpose especially with respect to comparing monolithic and distributed, and relational and NoSQL database management systems.",
    "Course content": "The course introduces the student to the role of data, information, and knowledge in software engineering. The course has two general themes: (1) fundamental concepts related to data in software engineering; (2) basic principles of database systems as seen by users, application programmers and database administrators.\n\nThe course introduces concepts and techniques related to working with data, information and knowledge, although the focus is mostly on data and information. Techniques related to extraction, representation, modeling, and access , and visualization of data are discussed.\n\nThe course then introduces the role of databases and database management systems, covering topics such as algebra and the relational database, logical and physical design of databases, and the use of SQL. This includes programming in SQL, from the perspective of a user querying or modifying an existing database, by a database designer, and by an application programmer invoking SQL from a host language.\n\nFurther, the student learns to query NoSQL databases, and contrast them to the relational model. The course also covers different data models such as XML, RDF, and JSON.",
    "Sub-courses": "Written hall examination, 4.5 Credits\n\n\nAssignments, 3 Credits",
    "Form of teaching": "The teaching consists of lectures, group work, exercises, as well as supervision in connection to the exercises.\n\n_Language of instruction_: English",
    "Assessment": "The course is examined by an individual written exam carried out in an examination hall at the end of course and written assignments normally carried out in groups of 2–3 students.\n\nThe sub-course assignments is examined on the basis of solutions to compulsory problems handed in during the course and on the basis of individual contribution to the group work.\n\nThe student is required to complete written self- and peer-assessment forms during the course which will be part of the assessment of the student's individual contribution to the project.\n\nThe sub-course Assignments is reexamined by individual assignments and an individual oral examination.\n\nIf a student who has twice received a failing grade for the same examination component wishes to change examiner ahead of the next examination session, such a request should be made to the department in writing and should be approved by the department unless there are special reasons to the contrary (Chapter 6 Section 22 of the Higher Education Ordinance).\n\nIf a student has received a recommendation from the University of Gothenburg for study support for students with disabilities, the examiner may, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources are required, decide to allow the student to sit an adjusted exam or alternative form of assessment.\n\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years after the course has ceased/been changed. The same applies to internships and professional placements (VFU), although this is restricted to just one additional examination session.",
    "Grades": "Sub-courses\n\n1. Written exam (Tentamen), 4.5 credits\n\n\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Assignments (Inlämningsuppgifter), 3 credits\n\n\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n\nThe grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U).\n\nTo pass the course, all mandatory components must be passed. To earn a higher grade than Pass, a higher weighted average from the grades of the components is required.",
    "Course evaluation": "The results of and possible changes to the course will be shared with students who participated in the evaluation and students who are starting the course.",
    "Additional information": "Course literature to be announced the latest 8 weeks prior to the start of the course.\n\nThe course replaces the course DIT033, 7.5 credits. The course cannot be included in a degree which contains DIT033. Neither can the course be included in a degree which is based on another degree in which the course DIT033 is included."
  }
}