{
  "metadata": {
    "source_document": "DIT075.pdf",
    "course_code": "DIT075",
    "course_title": "Mobile Computing: Design and Implementation",
    "swedish_title": "Mobila Datorer: Design och Implementering",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design, Computer Science-Interaction Design",
    "specialization": "AIN, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2020-11-04",
    "valid_from_date": "2021-08-30",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)"
    ],
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "1 Sep 2025 - 2 Nov 2025",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86045",
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2020-11-04 to be valid from 2021-08-30, autumn semester of 2021.",
    "Position in the educational system": "The course is offered as a single subject course.\n\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS) and 2) Computer Science, Bachelor's Programme (N1COS)\n\nMain field of studies\nInteraction Design\nComputer Science-Interaction Design\nSpecialization\nAIN, Second cycle, has only first-cycle\ncourse/s as entry requirements\nAIN, Second cycle, has only first-cycle\ncourse/s as entry requirements",
    "Entry requirements": "To be eligible for the course the student must have:\n\n• A bachelor's degree of 180 credits\n• Object-oriented programming (7,5 credits) or equivalent -\nAt least one of the following or equivalent (7,5 credits):\n\n• TIA100 Human-Centred Design\n• TIA104 Interaction Design Methodology\n• TIA106 Graphical Interfaces\n• TIA243 Designing User Experiences\n• TIG095 Human-Computer Interaction\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student should be able to:\n\nKnowledge and understanding\n• describe how mobile computing is defined and distinguished from other kinds of\ncomputing applications.\n• describe what competences and resources are necessary for creating and utilizing\nmobile applications at different scales, for different purposes (e.g. startup,\nenterprise, agency, freelance, artistic, altruistic, and research projects).\n• interpret and explain relevant technological and contextual trends in commercial\nvalue creation and academic research.\n• describe the latest technological research on mobile computing, and explain why\nresearch and commercial applications may diverge.\n• describe the distinction between different design methods and tools (e.g. research\nmethods, prototyping tools and approaches) that are appropriate for mobile\ncomputing.\n• describe humanistic and societal issues (e.g. health, economics, politics) that are\nrelevant to mobile computing.\n• describe the landscape of mobile computing research, building on and properly\nciting relevant resources.\n\nCompetence and skills\n• develop functional software which runs on a mobile computing platform.\n• select and execute appropriate design tactics (e.g. graphic design, typography, 3D\nmodeling, photography, motion graphics) at an appropriate level of fidelity and\nexcellence, to create mobile computing user interfaces.\n• select and execute appropriate design tactics (e.g. graphic design, typography, 3D\nmodeling, photography, motion graphics) at appropriate proportions and levels of\nexcellence, to document and present mobile computing artifacts\n• execute and document a complete design project which culminates in a mobile\ncomputing artifact\n\nJudgement and approach\n• execute and critique design research approaches that are appropriate for mobile\ncomputing, including ethnographic methods.\n• critique the reasoning (strategy) and aesthetics (tactics) of mobile computing\nprojects constructively. • find, utilize, and properly acknowledge non-academic\ntechnical and tactical building blocks for mobile computing designs.\n• interpret, constructively critique, and contribute to discussions on mobile computing\nin the public sphere.\n• make and justify strategic design decisions to create relevant mobile computing\nartifacts.",
    "Course content": "We define \"mobile computing\" in two ways:\n• Portable digital devices. Examples: smartphones, tablets, smartwatches and other\nwearables, RFID cards, and IoT applications...\n• Applications where the user is mobile. Examples: commuting, tourism, driving,\nbiking, sports, walking, exploring, navigating...\nThis course introduces concepts, methods, and technologies relevant to design and\nimplementation of mobile computing applications. A broad range of topics is covered,\nfrom conventional smartphones and tablets, to emerging technologies.",
    "Sub-courses": "1. Project (Projekt), 3.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n\n2. Assignments (Inlämningsuppgifter), 4 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The course consists of the following kinds of activities:\n\n• Studies (e.g. lectures, readings)\n• Exercises (directly related to the Studies, carried out as individuals or groups)\n• Implementation (design and/or software development exercises)\n• Project (carried out as groups)\n\nLanguage of instruction: English",
    "Assessment": "The course consists of two modules:\n\n4 credits (fail, 3, 4, 5) – Written and Presentation Exercises Several Written and\nPresentation Exercises are scheduled throughout the learning period. These are mostly\ndone individually.\n3,5 credits (fail, 3, 4, 5) – Project Work Project Work involves deliverables scheduled\nthroughout the learning period, a final document and/or presentation (which weighted\nmore than the preceding deliverables), and turning in project code. The project is done\nas a group work.\n\nIf a student, who has failed the same examined element on two occasions, wishes to\nchange examiner before the next examination session, such a request is to be submitted\nto the department in writing and granted unless there are special reasons to the contrary\n(Chapter 6, Section 22 of Higher Education Ordinance).\nIn the event that a course has ceased or undergone major changes, students are to be\nguaranteed at least three examination sessions (including the ordinary examination\nsession) over a period of at least one year, though at most two years after the course has\nceased/been changed. The same applies to work experience and VFU, although this is\nrestricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nTo pass the course, all mandatory components must be passed. To earn a higher grade\nthan 3, a higher weighted average from the grades of the components is required.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\n\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\n\nThe course replaces the course TIA110, 7.5 credits. The course cannot be included in a\ndegree which contains TIA110. Neither can the course be included in a degree which is\nbased on another degree in which the course TIA110 is included.\n\nApplication closed, late application opens 15 July 2025.\nLast modified 20 February 2025",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)"
  }
}