{
  "metadata": {
    "source_document": "DIT046.pdf",
    "course_code": "DIT046",
    "course_title": "Requirements and User Experience",
    "swedish_title": "Kravhantering och användarupplevelse",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "First Cycle",
    "main_field_of_study": "Software Engineering",
    "specialization": "G1F, First cycle, has less than 60 credits in first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2020-10-29",
    "valid_from_date": "2022-08-29",
    "programmes": [
      "Applied Data Science Master's Programme (N2ADS)",
      "Software Engineering and Management Bachelor's Programme (N1SOF)",
      "Software Engineering and Management, Bachelor's Programme (N1SEM)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2020-10-29 and was last revised on 2021-11-04 to be valid from 2022-08-\n29, autumn semester of 2022.",
    "Position in the educational system": "The course is a compulsory course in the Software Engineering and Management\nBachelor's Programme. The course is also a single subject course at the University of\nGothenburg.\nThe course can be part of the following programmes: 1) Applied Data Science Master's\nProgramme (N2ADS), 2) Software Engineering and Management Bachelor's\nProgramme (N1SOF) and 3) Software Engineering and Management, Bachelor's\nProgramme (N1SEM)",
    "Entry requirements": "To be eligible for this course, students must have completed a 7.5 credits course in\nprogramming (e.g., DIT042 Object-oriented programming, or equivalent).\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• Identify key RE and UX concepts such as functional and non-functional\nrequirements, usability, and UX design patterns\n• Describe important differences between a variety of requirements modeling\ntechniques\n• Describe the benefits and drawbacks between specific elicitation techniques\n• Explain the role of verification and validation in RE and UX\n• Identify key non-functional requirements for software, such as usability and\nsustainability.\nCompetence and skills\n• Apply concepts to write good-quality requirements\n• Draw several types of requirements models\n• Capture personas and scenarios\n• Apply UX design patterns to create prototypes from requirements\n• Conduct and report on user studies\nJudgement and approach\n• Evaluate and select between available elicitation techniques\n• Evaluate benefits and drawbacks of different requirements representations\n• Evaluate the appropriateness of specific UX patterns for a design\n• Evaluate and improve upon a UX design\n• Evaluate the impact of RE & UX projects on sustainability goals such as reduced\ninequalities or responsible production and consumption\nThe course is sustainability-related, which means that at least one of the learning\noutcomes clearly shows that the course content meets at least one of the University of\nGothenburg's confirmed sustainability criteria.",
    "Course content": "The course provides students with an introduction to the field of requirements\nengineering and user experience. It provides a solid foundation by defining foundational\nconcepts like stakeholders, requirements, usability and specifications. It also presents\nthe process of identifying, modeling and documenting the requirements of a software\nproduct. Emphasis is given to concepts and techniques such as quality requirements\n(e.g., usability, sustainability, security, privacy), creative requirements, scenarios, and\npersonas. The second part of the course focuses on usability aspects.\nThe course will focus on implementing the requirements gathered in the first part as part\nof UX designs. Further, the course presents methods of prototyping (for example,\ndigital mockups) and presents some techniques to evaluate the usability of a software\nproduct (for instance, via user studies). Finally, the course will provide students with\nhands-on experience in designing graphical user interfaces (GUI)",
    "Sub-courses": "1. Written hall examination (Skriftlig salstentamen), 4.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Assignments (Inlämningsuppgifter), 3 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The teaching consists of lectures, group work, exercises, as well as supervision in\nconnection to the exercises.\nLanguage of instruction: English",
    "Assessment": "The course is examined by an individual written exam carried out in an examination hall\nat the end of course and written assignments normally carried out in groups of students.\nThe assignments part is examined on the basis of solutions to compulsory problems\nhanded in during the course and on the basis of individual contribution to the group\nwork.\nRetake examinations of the assignments part consist of written group or individual\nassignments.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nStudents receive grades on the assignments and the exam parts of the course. To pass\nthe whole course, students must pass both the assignment and exam parts of the course.\nIf both parts have a passing grade, the final grade is determined by combining the scales\nfor both the exam and the assignments, with the exam grade weighted slightly higher.",
    "Course evaluation": "The course is evaluated through a meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT045, 7.5 credits. The course cannot be included in a\ndegree which contains DIT045. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT045 is included."
  }
}