{
  "metadata": {
    "source_document": "DIT104.pdf",
    "course_code": "DIT104",
    "course_title": "Interaction design methodology",
    "swedish_title": "Interaktionsdesignmetodologi",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Design 50% and Science 50%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design, Computer Science-Interaction Design",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2020-11-24",
    "valid_from_date": "2021-08-30",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Game Design & Technology Master's Programme (N2GDT)"
    ],
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "1 Sep 2025 - 2 Nov 2025",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86139"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2020-11-24 to be valid from 2021-08-30, autumn semester of 2021.",
    "Position in the educational system": "The course is offered within several programmes. It is also a single subject course at the\nUniversity of Gothenburg.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Applied Data Science Master's Programme (N2ADS) and 3)\nGame Design & Technology Master's Programme (N2GDT)",
    "Entry requirements": "To be eligible for the course the student must have succesfully completed a bachelor\nthesis course, e.g. DIT561. In addition, the student must have succesfully completed a\n7,5 credit course in Human-computer interaction, e.g. DIT095 or TIG091.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completing the course the student is expected to be able to:\nKnowledge and understanding\n• Describe stages of the design process\n• Describe methods for working with interaction design\n• Describe the similarities and differences of different design methods\n• Describe considerations for involving users in the design process\n• Explain the difference between the methods employed in craftsmanship, traditional\ndesign, and modern design\nCompetence and skills\n• Design technology with regards to users\n• Modify design methods to fit the context and needs of users\n• Identify needs and requirements for users\n• Develop and describe new design methods\n• Plan design projects with respect to design goals, stakeholders' requirements, and\navailable resources and expertise\n• Conduct work in an inter-cultural environment (including both cultural and\neducational backgrounds)\nJudgement and approach\n• Analyze designs taking into account the needs of users\n• Make an informed evaluation of the ethical and societal impacts of a design\n• Criticize designs and design processes with respect to the methods used\n• Identify ethical and social dilemmas in interaction design research and practice\n• Reflect on your own design process objectively\n• Design with regards to aesthetical issues of interaction",
    "Course content": "The course introduces basic design methodology in interaction design.\nThe course consists of several smaller exercises, a group project, and an individual\nexamination. Theory is combined with practical training to give students practice in\nworking systematically with the design of computational things and systems. Training in\nspecific design methods is provided through exercises and the group project while meta\nmethods such as iterative design and user centered design are aspects of the home exam.",
    "Sub-courses": "1. Take-home examination (Hemtentamen), 4.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Project (Projekt), 3 credits\nGrading scale: Pass (G) and Fail (U)",
    "Form of teaching": "The course is based on lectures, exercises, group project, and an individual exam.\nLanguage of instruction: English",
    "Assessment": "The student is graded through a group project (3 hec) and an individual take-home\nexamination (4,5 hec). The take home examination includes written assignments related\nto literature and to the group project.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nTo pass the course, students must receive a passing grade in both modules. The grade\nfor the entire course will be determined by the take home examination.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course TIA104, 7.5 credits. The course cannot be included in a\ndegree which contains TIA104. Neither can the course be included in a degree which is\nbased on another degree in which the course TIA104 is included.\n\nLast modified: 21 February 2025",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 17 753 SEK\nFirst payment: 17 753 SEK\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)\nApplication closed, late application opens 15 July 2025."
  }
}