{
  "metadata": {
    "source_document": "DIT199.pdf",
    "course_code": "DIT199",
    "course_title": "The Computer Scientist in Society",
    "swedish_title": "Datavetaren i samhället",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science",
    "specialization": "AXX, Second cycle, in-depth level of the course cannot be classified",
    "language_of_instruction": "English",
    "confirmation_date": "2016-12-20",
    "valid_from_date": "2017-08-28",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2016-12-20 to be valid from 2017-08-28, autumn semester of 2017.",
    "Position in the educational system": "The course is offered within the Computer Science Master's Programme.\nThe course can be part of the following programme: 1) Computer Science, Master's Programme (N2COS)",
    "Entry requirements": "A Bachelor's degree in Computer Science or equivalent.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successfull completion of the course the student is expected to be able to\nKnowledge and understanding\n• extract and summarize the current knowledge about a specific topic in computer science from original articles,\n• clearly describe the scientific or technical problems treated within a specific topic in computer science,\n• identify the essential points of an article,\nSkills and abilities\n• retreive information that is required to understand a topic not treated in the primary sources,\n• write well organized and well formulated text with proper scientific argumentation,\n• explain and communicate a topic to readers that are not necessarily experts in the domain,\n• plan a research project (master's thesis), based on problem analysis and with a clearly shaped goal, and predict its feasibility,\nJudgement and approach\n• review scientific sources critically,\n• analyze and evaluate the reasons for the choice of a solution method,\n• identify possible ethical and societal consequences of a method, design or system,\n• evaluate possible decisions, based on general ethical values,\n• apply ethical principles in scientific writing, including proper citation and use of statistical statements.",
    "Course content": "• technical writing in computer science, being practiced on a topic of free choice and on a research proposal\n• structuring a scientific text\n• communicating a topic to different audiences\n• theories on ethics, with examples from computer science\n• identification and analysis of ethical and societal issues\n• ethics and good practice in research and publishing",
    "Sub-courses": "",
    "Form of teaching": "Introductory lectures on scientific writing and ethics, several writing exercises and supervision.",
    "Assessment": "The course is examined by a written proposal, carried out normally in pairs and individual written assignments.\nIf a student, who has failed the same examined component twice, wishes to change examiner before the next examination, a written application shall be sent to the department responsible for the course and shall be granted unless there are special reasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the student shall normally be guaranteed at least three examination occasions (including the ordinary examination) during a period of at least one year from the last time the course was given.",
    "Grades": "The grading scale comprises: Pass (G) and Fail (U).\nIn order to get the grade Pass, the student needs to pass both the propsal and the individual written assignments.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between teachers and student representatives. Further, an anonymous questionnaire is used to ensure written information. The outcome of the evaluations serves to improve the course by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course"
  }
}