{
  "metadata": {
    "source_document": "DIT280.pdf",
    "course_code": "DIT280",
    "course_title": "Algorithms, Advanced Course",
    "swedish_title": "Algorithms, Advanced Course",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science-Algorithms and Logic",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2006-11-17",
    "valid_from_date": "2016-08-29",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2006-11-17 and was last revised on 2016-02-09 by Department of Computer Science and Engineering to be valid from 2016-08-29, autumn semester of 2016.",
    "Position in the educational system": "The course is a part of the Computer Science Master's programme and an elective course at University of Gothenburg.\n\nThe course can be part of the following programmes: 1) Computer Science, Master's Programme (N2COS) and 2) Computer Science, Bachelor's Programme (N1COS)",
    "Entry requirements": "To be eligible for the course students should have\n- successfully completed courses corresponding to 90 hec within the subject Computer Science or equivalent.\nIn addition:\n- successfully completed DIT600 Algorithms, 7.5 hec (or equivalent)\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student is expected to be able to:\n\nKnowledge and understanding\n- apply important design and analysis techniques for algorithms, in particular, ways to approach NP-complete problems.\n- describe current research on algorithms\n\nSkills and abilities\n- apply design and analysis techniques to solve new problems that may arise in various applications\n- explain complex algorithms and proofs in written form.\n\nJudgement and approach\n- find connections between algorithmic problems and turn them into formal reductions.\n- perform more complex analysis of algorithms, in particular, analyze the worst case and expected time complexities and error probabilities for randomized algorithms.",
    "Course content": "The course covers the following topics;\n- approximation algorithms and approximation schemes for NP-complete problems, and their analysis,\n- use of linear programming, in particular for approximation,\n- network flow with some complex applications,\n- randomized algorithms and their analysis by appropriate random variables,\n- helpful input structures like tree structures and input parameters",
    "Sub-courses": "",
    "Form of teaching": "Lectures and hand-in assignments.",
    "Assessment": "The course is examined by compulsory hand-in assignments and a home exam, all carried out individually and in written form.\n\nIf a student, who has failed the same examined component twice, wishes to change examiner before the next examination, a written application shall be sent to the department responsible for the course and shall be granted unless there are special reasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\n\nIn cases where a course has been discontinued or has undergone major changes, the student shall normally be guaranteed at least three examination occasions (including the ordinary examination) during a period of at least one year from the last time the course was given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nHand-in assignments and home exam count equally for the final grade. In order to achieve VG, the solutions must be correct and well explained, subject to minor difficulties.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between teachers and student representatives. Further, an anonymous questionnaire is used to ensure written information. The outcome of the evaluations serves to improve the course by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers."
  }
}