{
  "metadata": {
    "source_document": "DIT265.pdf",
    "course_code": "DIT265",
    "course_title": "Software Evolution Project",
    "swedish_title": "Mjukvaruevolutionsprojekt",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "15",
    "cycle": "Second Cycle",
    "main_field_of_study": "Software Engineering",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2023-11-08",
    "valid_from_date": "2024-09-02",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ],
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "1 Sep 2025 - 18 Jan 2026",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86041"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2023-11-08 to be valid from 2024-09-02, autumn semester of 2024.",
    "Position in the educational system": "The course is a compulsory course in the Software Engineering and Management\nMaster's Programme and an single subject course at the University of Gothenburg.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS) and 2) Software Engineering and Management Master's\nProgramme (N2SOF)",
    "Entry requirements": "To be eligable for this course, the student needs to have successfully completed the\nfollowing requirements, or equivalent:\n• A bachelor degree in Software Engineering, Computer Science, Information\nTechnology, Information Systems, or equivalent\n• Advanced Requirements Engineering (7.5 credits)\n• Quality Assurance and Testing (7.5 credits)\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\nKnowledge and understanding\n• explain the notion of software evolution,\n• summarize state of the art in methods and tools for software evolution tasks, such\nas program comprehension and software refactoring,\n• discuss the challenges associated with software evolution,\n• explain current research trends in program comprehension, and refactoring\n\nCompetence and skills\n• extract a software product's architecture from a given code base and evaluate the\nquality of the software product,\n• implement one software evolution scenario,\n• implement changes to a software product that lead to an improvement of the\nproduct's quality,\n• make use of synergies between different improvements goals for the same product.\n\nJudgement and approach\n• detect and judge needs for quality improvement or evolution in an authentic\nsoftware product,\n• plan the use of appropriate methods and techniques for performing a software\nevolution scenario and a quality improvement task,\n• judge needs for improvement of methods and tools to support software evolution,\n• plan and evaluate ideas for new or improved tools.",
    "Course content": "The course consists of two modules, including a group project and individual\nassignments.",
    "Sub-courses": "1. Project (Projekt), 12 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Assignments (Inlämningsuppgifter), 3 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The course contains project- and problembased teaching.",
    "Assessment": "The course consists of two modules:\n• A group project carried out in groups of students.\n• One or more individual assignments.\nFurthermore, individual optional assignments can be used to collect bonus points\nduring the course.\n\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nThe grading scale comprises Fail (U), 3, 4 or 5.\nTo pass the course, all mandatory components must be passed. To earn a higher grade\nthan Pass, a higher weighted average from the grades of the components is required.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT588 Software Evolution Project 15 credits. The\ncourse cannot be included in a degree which contains DIT588. Neither can the course be\nincluded in a degree which is based on another degree in which the course DIT588 is\nincluded.\n\nLast modified 20 February 2025",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 35 505 SEK\n\nFirst payment: 35 505 SEK\n\n**No fees** are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)\n\nApplication closed, late application opens 15 July 2025."
  }
}