{
  "metadata": {
    "source_document": "DIT234.pdf",
    "course_code": "DIT234",
    "course_title": "Digital Project Laboratory",
    "swedish_title": "Digital konstruktion, projektkurs",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 2%, Design 8% and Technology 90%",
    "credits": "7.5",
    "cycle": "First Cycle",
    "main_field_of_study": "Computer Science-Networks and Distributed Systems",
    "specialization": "G2F, First cycle, has at least 60 credits in first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2020-11-11",
    "valid_from_date": "2021-08-30",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)"
    ],
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "3 Nov 2025 - 18 Jan 2026",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86089",
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2020-11-11 to be valid from 2021-08-30, autumn semester of 2021.",
    "Position in the educational system": "The course is part of several programs and is also a single-subject course at Gothenburg University.\n\nThe course can be part of the following programmes: 1) Computer Science, Master's Programme (N2COS) and 2) Computer Science, Bachelor's Programme (N1COS)",
    "Entry requirements": "To be eligible for the course, students must have:\nAdmission to the course is required one year of study in the subject computer science or equivalent and the course DIT791 Digital and computer technology (or equivalent).\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• describe the principles for a structured and hierarchical description of smaller digital systems [P, R].\n• describe how programmable logic circuits work and how they are best utilized [L, R, P].\n\nCompetence and skills\n• handle electronic design automatic (EDA) tools to develop and verify programmable logic circuits [L, R, P].\n• implement a prototype digital system considering aspects of clocking, synchronization, and control (state machine) [R, P].\n\nJudgement and approach\n• search for information in documentation/datasheets of commercial electronic components [R, B, W].\n• determine power supply requirements for digital circuits in environments with multiple voltages [R, P].\n• develop a prototype digital system, from specification, via implementation and verification, to testing and evaluation [W, B, P].",
    "Course content": "Work in designing and implementing of a digital device, in which a microprocessor can be included.\n\nThe following skills are the students acquire:\n\n• Construction - with limited resources\n• Troubleshooting with a Logic Analyzer\n• Timing\n• Using FPGA circuits\n• Reading technical documentation\n• Report writing with focus on technical documentation",
    "Sub-courses": "1. Project (Projekt), 7.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The course begins with some lecture and exercises that allows students to become familiar with CAD/EDA tools. Subsequently, the students themselves proceed with the construction work under supervision. The project work is performed in groups. Each group selects a task of its own or follows a proposal from a catalog of projects. Components, instruments and equipment will be available for students in accessible premises for a period of six weeks. Construction work is presented in a written report. Students have a meeting each week with a supervisor. The course concludes with a seminar with mandatory attendance, where projects are presented.\nLanguage of instruction: English",
    "Assessment": "Examination is carried out continuously during the course with laboratory exercises [L], weekly meetings [W], examination of log books [O], assessment of the final product [P] and report [R] and the oral presentation [M]. The grade is set based on your project group that has chosen your basic grade, here it is based on how well the project has done. The individual grade is set based on the students' performance in the group, the oral presentation, logbook entries and individual grant report. All the above elements must be approved for final grades on courses. Detailed information can be found in the course PM.\n\nIf a student, who has failed the same examined element on two occasions, wishes to change examiner before the next examination session, such a request is to be submitted to the department in writing and granted unless there are special reasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, though at most two years after the course has ceased/been changed. The same applies to work experience and VFU, although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U).",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between teachers and student representatives. Further, an anonymous questionnaire isused to ensure written information. The outcome of the evaluations serves to improve the course by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT796, 7.5 credits. The course cannot be included in a degree which contains DIT796. Neither can the course be included in a degree which is based on another degree in which the course DIT796 is included.\n\nLast modified: 20 February 2025",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 165 credits.",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)\n\nApplication closed, late application opens 15 July 2025."
  }
}