{
  "metadata": {
    "source_document": "DIT248.pdf",
    "course_code": "DIT248",
    "course_title": "An introduction to Game Research",
    "swedish_title": "Introduktion till spelvetenskap",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Design 50% and Arts 50%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design",
    "specialization": "A1N, Second cycle, has only first-cycle\ncourse/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2022-11-23",
    "valid_from_date": "2023-08-28",
    "programmes": [
      "Digital Humanities, Master Programme (H2DHU)",
      "Game Design & Technology Master's Programme (N2GDT)"
    ],
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "1 Sep 2025 - 2 Nov 2025",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86044"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2020-11-03 and was last revised on 2022-11-23 to be valid from 2023-08-\n28, autumn semester of 2023.",
    "Position in the educational system": "The course is compulsory within the N2GDT. It is also a single subject course at the\nUniversity of Gothenburg.\nThe course can be part of the following programmes: 1) Digital Humanities, Master\nProgramme (H2DHU) and 2) Game Design & Technology Master's Programme\n(N2GDT)",
    "Entry requirements": "Bachelor degree of 180 higher educational credits or 60 higher educational credits in the\nmain field of study of Computer Science.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student should be able to:\nKnowledge and understanding\n• know and use appropriate academic technical terminology for games\n• identify the ethical implications of a game's design\nCompetence and skills\n• show an understanding of different types and approaches to classifying games\n• show an understanding of different academic approaches to researching games and\ngaming\n• be able to choose and combine different academic approaches in order to analyze\nand interpret games\n• integrate scholarly literature in the exploration of the academic context of a game\nJudgement and approach\n• analyze games given a specific research question, research stance, and academic\nvocabulary\n• describe games given a specific focus and showing an adequate use of academic\ngame terms\n• make comparisons between games or parts of games through the use of academic\ngame terms\n• analyze games in relation to various intended uses\n• analyze games from several different gaming preferences",
    "Course content": "The course provides an overview of games as well as theoretical concepts and\nframeworks that can be used for their analysis and evaluation. The course includes a\nparticular focus on video games, modern board games, and tabletop roleplaying games.\nWe also look at transmedial aspects, and gaming forms that don't fit neatly into these\ncategories.\nStudents formulate several research questions of their choosing around games, and\nduring the course they develop the skills required to provide answers to those questions.\nThe course introduces three key research perspectives that are useful for game studies.\nWe make use of the systemic perspective, which explores how games work. We look at\nthe experiential perspective, which explores how games make us feel. And we look at the\ncritical perspective, which focuses on what games are trying to say.\nThe course also has a strong focus on 'learning by playing', recognising that games are\nthe primary text of their discipline. Students taking this course will have an opportunity\nto try out tabletop roleplaying for themselves, as well as a chance to play a curated\nselection of modern board games.",
    "Sub-courses": "1. Assignments (Inlämningsuppgifter), 7.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The course is based on lectures, the reading of academic texts, and analyzing games.\nPractical experience of game analyzed is obtained by playing these games being part of\nthe course work.\nLanguage of instruction: English",
    "Assessment": "The course is examined through several written submissions and a mandatory\npresentation at the end of the course. Participation in the course, as evidenced through\npeer reviewing and engagement with scheduled game exercises, also contributes to an\nindividual's grade.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nTo pass the course, all mandatory components must be passed. To earn a higher grade\nthan 3, a higher weighted average from the grades of the components is required.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course TIA248, 7.5 credits. The course cannot be included in a\ndegree which contains TIA248. Neither can the course be included in a degree which is\nbased on another degree in which the course TIA248 is included.\n\nLast modified 11 February 2025",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)\n\nApplication closed, late application opens 15 July 2025."
  }
}