{
  "metadata": {
    "source_document": "DIT346.pdf",
    "course_code": "DIT346",
    "course_title": "Techniques for Large-scale Data",
    "swedish_title": "Tekniker för storskalig data",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science, Data Science, Software Engineering",
    "specialization": "A1N",
    "language_of_instruction": "English",
    "confirmation_date": "2019-12-02",
    "valid_from_date": "2021-01-18",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Computer Science, Bachelor's Programme (N1COS)",
      "Game Design & Technology Master's Programme (N2GDT)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2019-12-02 to be valid from 2021-01-18, spring semester of 2021.",
    "Position in the educational system": "The course is compulsory within the programme N2ADS. It is also a single subject\ncourse at the University of Gothenburg.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Applied Data Science Master's Programme (N2ADS), 3)\nComputer Science, Bachelor's Programme (N1COS), 4) Game Design & Technology\nMaster's Programme (N2GDT) and 5) Software Engineering and Management Master's\nProgramme (N2SOF)",
    "Entry requirements": "To be eligible to the course, the student should have a Bachelor's degree in any subject,\nor have successfully completed 90 credits of studies in computer science, software\nengineering, or equivalent. Specifically, at least 15 credits of successfully completed\ncourses in programming or equivalent are required. The student also needs to have\nattended a course in databases of at least 7.5 credits (e.g. DIT621 Databases or DIT032\nData management).\nThe student needs to have successfully completed a course in probability theory or\nstatistics, for example DIT862 or MSG810 or similar.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• discuss important technological aspects when designing and implementing analysis\nsolutions for large-scale data,\n• describe index structures and discuss their utility,\n• describe data models and software standards for sharing data on the web.\nCompetence and skills\n• implement applications for transforming and analyzing large-scale data with\nappropriate software frameworks,\n• provide access and utilize structured data over the web with appropriate data\nmodels and software tools.\nJudgement and approach\n•\nsuggest appropriate computational infrastructures and methodological approaches\nfor analysis tasks and discuss their advantages and drawbacks,\n• discuss advantages and drawbacks of different strategies for dissemination of data,\n• discuss mechanisms for concurrency and recovery in database systems,\n• discuss the efficiency of query plans,\n• discuss large-scale data processing from an ethical point of view.",
    "Course content": "The aim of this course is to deepen the students' knowledge and skills and familiarize\nthem with the technical and technological side of data science, including relevant data\nmodels, and software respectively hardware environments. The course will introduce\naspects of designing and implementing large-scale data science solutions.\nIn particular, the course will include:\n•\nan overview of computer architectures, algorithmic approaches, and high-\nperformance computing infrastructures with a focus on limitations for processing\nlarge-scale data,\n•\nan introduction to relevant frameworks for cluster computing with large-scale data,\n• implementation of data analysis tools on a cluster using Python and appropriate\nsoftware frameworks,\n• index structures, query processing and optimisation; concurrency, recovery,\n•\nan overview of non-relational database technologies,\n• semantic web and related technologies,\n•\nan overview of ethical questions regarding large-scale data.",
    "Sub-courses": "1. Written hall examination (Skriftlig salstentamen), 4.5 credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)\n2. Assignments (Inlämningsuppgifter), 3 credits\nGrading scale: Pass (G) and Fail (U)",
    "Form of teaching": "Lectures, computer lab sessions, and exercise sessions.",
    "Assessment": "The course is examined by a written hall examination, as well as mandatory written\nassignments, some of which will be carried out individually and others will be carried\nout in groups of normally 2-4 students.\nThere will be non-obligatory individual assignments which grant bonus points for the\nwritten examination. These bonus points are valid for the two next scheduled re-\nexaminations.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nA Pass grade (G) for the entire course requires at least a Pass grade for all sub-courses.\nTo be awarded Pass with Distinction (VG) for a full course, the student must, in\naddition, receive the grade VG on the sub-course Written examination.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT872, 7.5 credits. The course cannot be included in a\ndegree which contains DIT872. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT872 is included."
  }
}