{
  "metadata": {
    "source_document": "DIT352.pdf",
    "course_code": "DIT352",
    "course_title": "Cryptography",
    "swedish_title": "Kryptografi",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2023-11-13",
    "valid_from_date": "2024-09-02",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Computer Science, Bachelor's Programme (N1COS)",
      "Bachelor's Programme in Mathematics (N1MAT)"
    ],
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "3 Nov 2025 - 18 Jan 2026",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86075"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2023-11-13 to be valid from 2024-09-02, autumn semester of 2024.",
    "Position in the educational system": "The course is offered within the framework of several degree programmes. The course is\nalso a single subject course at University of Gothenburg.\n\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Applied Data Science Master's Programme (N2ADS), 3)\nComputer Science, Bachelor's Programme (N1COS) and 4) Bachelor's Programme in\nMathematics (N1MAT)",
    "Entry requirements": "To be eligible for the course the student should have successfully completed courses\ncorresponding to 90 credits in the subject of Computer Science or Mathematics,\nincluding:\n• 7.5 credits in algebra or discrete mathematics (covering topics: modular arithmetic,\nand elementary probability theory)\n• 7.5 credits in programming\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completing the course the student is expected to be able to:\n\nKnowledge and understanding\n• Recognize well-established cryptosystems and identify settings where they can be\nused to improve the security of a given system\n• Demonstrate knowledge of principles behind provable security\n• Understand the theoretic foundations of cryptography\n\nCompetence and skills\n• Describe goals and design principles for, and common structures of, several\ncryptographic primitives and proof systems\n• Identify, analyse and explain various forms of attacks based on improper usage of\nprimitives, modes of operation, or protocols\n• Reproduce rigorous proofs of security\n\nJudgement and approach\n• Exemplify when various notions of security are applicable and describe the security\nguarantees provided\n• Apply the acquired knowledge in new situations.",
    "Course content": "• Basic and advanced goals of cryptography (confidentiality, authentication,\nanonymity, zero-knowledge)\n• Symmetric key cryptography: block ciphers, design principles and examples, modes\nof operation, message authentication codes.\n• Public key cryptography: key exchange, asymmetric ciphers, signatures. Attack\nmodels and security notions.\n• Cryptographic Protocols: secret sharing, zero-knowledge proofs.",
    "Sub-courses": "1. Written hall exam (Skriftlig salstentamen), 6 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Assignments (Inlämningsuppgifter), 1.5 credits\nGrading scale: Pass (G) and Fail (U)",
    "Form of teaching": "The course is composed of lectures as well as exercise sessions, and assignments.",
    "Assessment": "The course is examined by home assignments done individually or in groups, and a\nwritten exam done individually in an examination hall.\n\nIf a student, who has failed the same examined element on two occasions, wishes to\nchange examiner before the next examination session, such a request is to be submitted\nto the department in writing and granted unless there are special reasons to the contrary\n(Chapter 6, Section 22 of Higher Education Ordinance).\nIn the event that a course has ceased or undergone major changes, students are to be\nguaranteed at least three examination sessions (including the ordinary examination\nsession) over a period of at least one year, though at most two years after the course has\nceased/been changed. The same applies to work experience and VFU, although this is\nrestricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nIn order to pass the course both the assignments and the written hall examination have\nto be approved. The grade for the entire course will be determined by the written hall\nexam.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\n\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\n\nThe course replaces the course DIT250, 7.5 credits. The course cannot be included in a\ndegree which contains DIT250. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT250 is included.\n\nLast modified: 20 February 2025\nApplication closed, late application opens 15 July 2025.",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\n**No fees** are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)"
  }
}