{
  "metadata": {
    "source_document": "DIT323.pdf",
    "course_code": "DIT323",
    "course_title": "Finite automata and formal languages",
    "swedish_title": "Ändliga automater och formella språk",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "First Cycle",
    "main_field_of_study": "Computer Science",
    "specialization": "G1F, First cycle, has less than 60 credits in first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2021-11-15",
    "valid_from_date": "2023-01-16",
    "programmes": [
      "Mathematical Sciences, Master's Programme (N2MAT)",
      "Computer Science, Master's Programme (N2COS)",
      "Bachelor's Programme in Mathematics (N1MAT)",
      "Computer Science, Bachelor's Programme (N1COS)"
    ],
    "iteration": "Spring 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "20 Jan 2025 - 23 Mar 2025",
    "application_period": "16 Sep 2024 - 15 Oct 2024",
    "application_code": "GU-86022"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2021-11-15 to be valid from 2023-01-16, spring semester of 2023.",
    "Position in the educational system": "The course is compulsory within the N1COS Computer Science Bachelor's Programme. It is offered within the framwork of several programmes. The course also a single subject course at the University of Gothenburg.\nThe course can be part of the following programmes: 1) Mathematical Sciences, Master's Programme (N2MAT), 2) Computer Science, Master's Programme (N2COS), 3) Bachelor's Programme in Mathematics (N1MAT) and 4) Computer Science, Bachelor's Programme (N1COS)",
    "Entry requirements": "To be eligible for this course, students must have successfully completed 45 credits in computer science or mathematics, including the following courses:\n- 7.5 credits in discrete mathematics (for example DIT980, MMG200 or equivalent)\n- 7.5 credits in programming (for example DIT440, DIT143, DIT012, DIT948, DIT953, MVG200 or equivalent)",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• Define different concepts in automata theory and the theory of formal languages,\nsuch as (non-) deterministic automaton, regular expression, regular language,\ncontext-free grammar, context-free language, and Turing machine.\nCompetence and skills\n• Prove properties of (some) languages, grammars and automata using rigorous\nmathematical methods.\n• Construct finite automata, regular expressions and context-free grammars accepting\nor generating certain languages.\n• Describe the language accepted by a finite automaton or generated by a regular\nexpression or context-free grammar.\n• Convert descriptions of regular languages between the following formalisms:\ndeterministic and non-deterministic finite automata as well as regular expressions.\n• Simplify automata and context-free grammars.\n• Determine if a word belongs to a certain (regular or context-free) language.\n• Construct Turing machines for simple tasks.\nJudgement and approach\n• Manipulate formal descriptions of (some) languages, grammars and automata.",
    "Course content": "The course's main topics are finite automata, regular expressions and context-free\ngrammars. It also contains a short introduction to Turing machines.\nFinite automata and regular expressions are simple models of computation. They are for instance used to control traffic lights, to search for patterns, and for lexical analysis.\nFurthermore their theory can illustrate basic concepts in set theory and the theory of\ndiscrete structures.\nContext-free grammars are used to parse and analyse both artificial languages (for\ninstance programming languages) and natural languages. Turing machines provide a\nmore expressive model of computation. They help computer scientists understand the\nlimits of mechanical computation by providing a precise definition of the concept of\n\"algorithm\". More detailed contents: Proofs. Finite automata, regular expressions, and\nrelated algorithms. Context-free grammars. Properties of regular and context-free\nlanguages. A short introduction to Turing machines.",
    "Sub-courses": "1. Written examination (Skriftlig tentamen), 4.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Assignments (Inlämningsuppgifter), 3 credits\nGrading scale: Pass (G) and Fail (U)",
    "Form of teaching": "Lectures, exercise sessions.",
    "Assessment": "The course is examined by individual assignments and an individual written exam given\nin an examination hall.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nIn order to get one of the grades 5, 4 or 3 one has to get the grade G on the sub-course\nAssignments, and a passing grade (5, 4 or 3) on the sub-course Written hall\nexamination. In that case the grade on the course is the grade on the sub-course Written\nhall examination. In other cases the grade on the course is U (fail).",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT322, 7.5 credits. The course cannot be included in a\ndegree which contains DIT322. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT322 is included\n\nLast modified 23 September 2024",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 165 credits.",
    "Tuition": "Full education cost: 19 253 SEK\n\nFirst payment: 19 253 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)"
  }
}