{
  "metadata": {
    "source_document": "DIT380.pdf",
    "course_code": "DIT380",
    "course_title": "Algorithm for Machine Learning and Inference",
    "swedish_title": "Algorithm for Machine Learning and Inference",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science-Algorithms and Logic",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2009-10-15",
    "valid_from_date": "2017-08-20",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Game Design & Technology Master's Programme (N2GDT)",
      "Software Engineering Master's Programme (N2SOM)",
      "Computer Science, Bachelor's Programme (N1COS)",
      "No translation available (NDATM)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2009-10-15 and was last revised on 2017-06-16 by Department of Computer Science and Engineering to be valid from 2017-08-20, autumn semester of 2017.",
    "Position in the educational system": "The course is a part of the Computer Science Master's programme and a single subject course at the University of Gothenburg. The course is also offered as a programme course in the Software Engineering Master's programme and in the Computer Science Bachelor's programme.\nnull\nThe course can be part of the following programmes: 1) Computer Science, Master's Programme (N2COS), 2) Applied Data Science Master's Programme (N2ADS), 3) Game Design & Technology Master's Programme (N2GDT), 4) Software Engineering Master's Programme (N2SOM), 5) Computer Science, Bachelor's Programme (N1COS) and 6) No translation available (NDATM)",
    "Entry requirements": "To be eligible for the course students should have successfully completed a first year studies within the subject Computer Science or equivalent. Specifically the course DIT600 Algorithms is mandatory. Knowledge in Probability Theory is essential.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course, the student is expected to be able to:\n1. Knowledge and understanding\n• know sound mathematical foundations for the inference of hypotheses from data and models, also know some main approaches in more detail\n2. Skills and abilities\n• evaluate the methods qualitatively and quantitatively, to recognize both their applicability and limitations\n3. Judgement and approach\n• understand scientific literature in this field, so that you can choose appropriate methods and apply them to specific inference problems.",
    "Course content": "- Concept learning, and learning by queries.\n- Inductive bias, MDL principle.\n- Decision trees.\n- Overfitting.\n- Ensemble methods.\n- Neural networks and support vector machines.\n- Bayesian learning.\n- Nearest neighbor learning.\n- Sample size estimates.",
    "Sub-courses": "",
    "Form of teaching": "Language of instruction: English",
    "Assessment": "Hand-in exercises are obligatory. In a homework exam, every student has to cover the main topics by answering to certain questions. All carried out individually.\nA student who has failed a examination twice has the right to request of the department a change of examiners, The request is to be in writing and submitted as soon as possible.\nThe department is to grant such a request without undue delay.\nIn cases where a course has been discontinued or major changes have been made a student should be guaranteed at least three examination occasions (including the ordinary examination occasion) during a time of at least one year from the last time the course was given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nHand-in exercises and home exam count equally for the final grade. In order to achieve VG, the solutions must be correct and well explained, subject to minor difficulties.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between teachers and student representatives. Further, an anonymous questionnaire can be used to ensure written information. The outcome of the evaluations serves to improve the course by indicating which parts could be added, improved, changed or removed.",
    "Additional information": ""
  }
}