{
  "metadata": {
    "source_document": "DIT382.pdf",
    "course_code": "DIT382",
    "course_title": "Algorithms for Machine Learning and Inference",
    "swedish_title": "Algoritmer för maskininlärning och slutledning",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2020-12-18",
    "valid_from_date": "2025-01-20",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Mathematical Sciences, Master's Programme (N2MAT)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Game Design & Technology Master's Programme (N2GDT)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ],
    "iteration": "Spring 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "20 Jan 2025 - 23 Mar 2025",
    "application_period": "16 Sep 2024 - 15 Oct 2024",
    "application_code": "GU-86011"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2020-12-18 and was last revised on 2023-11-14 to be valid from 2025-01-\n20, spring semester of 2025.",
    "Position in the educational system": "The course is offered within several programmes. It is also a single subject course at the\nUniversity of Gothenburg.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Mathematical Sciences, Master's Programme (N2MAT), 3)\nApplied Data Science Master's Programme (N2ADS), 4) Game Design & Technology\nMaster's Programme (N2GDT) and 5) Software Engineering and Management Master's\nProgramme (N2SOF)",
    "Entry requirements": "To be eligible to the course, the student should have a bachelor degree.\nIn particular, the student must have acquired the following knowledge:\n• 7.5 credits of programming (e.g., DIT440 Introduction to Functional\nProgramming, DIT042 Object-Oriented Programming, DIT012 Imperative\nProgramming with Basic Object-Orientation, or equivalent)\n• 7.5 credits of data structures (e.g., DIT961 Data Structures, DIT181 Data\nStructures and Algorithms, or equivalent)\n• 7.5 credits of basic probability and statistics (e.g., MSG810 Mathematical Statistics\nand Discrete Mathematics, DIT861 Statistical Methods for Data Science, or\nequivalent) - 7.5 credits of linear algebra (e.g., MMGD20 Linear Algebra, or\nequivalent)\n• 7.5 credits of multivariate calculus.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student should be able to:\nKnowledge and understanding\n• explain a representative set of available methods for machine learning\nCompetence and skills\n• implement and analyze machine learning algorithms\n• apply sound mathematical principles to the inference of hypotheses from empirical\ndata and models on scientific grounds\nJudgement and approach\n• choose appropriate methods and apply them to specific inference problems, based\non a solid understanding of scientific literature in the field\n• evaluate the methods qualitatively and quantitatively, and recognize their strengths\nas well as their limitations",
    "Course content": "This course will discuss the theory and application of algorithms for machine learning\nand inference, from an AI perspective. In this context, we consider as learning to draw\nconclusions from given data or experience which results in some model that generalises\nthese data. Inference is to compute the desired answers or actions based on the model.\nAlgorithms of this kind are commonly used in for example classification tasks (e.g.,\ncharacter recognition, or to predict if a new customer is creditworthy) and in expert\nsystems (e.g., for medical diagnosis). A new and commercially important area of\napplication is data mining, where the algorithms are used to automatically detect\ninteresting information and relations in large commercial or scientific databases.\nThe course intends to give a good understanding of this crossdisciplinary area, with a\nsufficient depth to use and evaluate the available methods, and to understand the\nscientific literature. During the course we may discuss potential problems with machine\nlearning methods, for example, bias in training data and safety of autonomous agents.\nThe following concepts are covered:\n• Bayesian learning: likelihood, prior, posterior.\n• Supervised learning: Bayes classifier, Logistic Regression, Deep Learning (Standard\nand CNN), Support Vector Machines, regression models, K-nn models.\n• Unsupervised learning: Clustering algorithms, EM algorithm, Mixture models,\n• Kernel methods,\n• Temporal machine learning models (for example RNN)",
    "Sub-courses": "1. Written hall examination (Skriftlig salstentamen), 4.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Assignments (Inlämningsuppgifter), 3 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "Lectures and homework assignments.",
    "Assessment": "The course is examined by assignments and a written hall examination.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nThe grading scale comprises Fail (U), 3, 4 or 5.\nTo pass the course, all mandatory components must be passed. To earn a higher grade\nthan Pass, a higher weighted average from the grades of the components is required.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT380, 7.5 credits. The course cannot be included in a\ndegree which contains DIT380. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT380 is included.\nThe course cannot be included in a degree which contains DIT866.\n\nLast modified 20 September 2024",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 19 253 SEK\n\nFirst payment: 19 253 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)"
  }
}