{
  "metadata": {
    "source_document": "DIT465.pdf",
    "course_code": "DIT465",
    "course_title": "Technology-driven Experimental Game Design",
    "swedish_title": "Teknikdriven experimentell speldesign",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2017-12-19",
    "valid_from_date": "2018-08-19",
    "programmes": [
      "Game Design & Technology Master's Programme (N2GDT)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2017-12-19 to be valid from 2018-08-19, autumn semester of 2018.",
    "Position in the educational system": "The course is compulsory within the Game Design & Technology Master's Programme.\nThe course can be part of the following programme: 1) Game Design & Technology\nMaster's Programme (N2GDT)",
    "Entry requirements": "To be eligible for this course, students must have successfully completed the following\ncourses, or equivalent:\n• TIA248 Introduction to Game Research, 7.5 credits\n• TIA098 Gameplay Design, 7.5 credits\n• TIA265 Game Engine Architecture, 7.5 credits\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• list potential for new game mechanics and gameplay of two different technologies\n• state creativity methods and techniques for applying new technologies to gameplay\nCompetence and skills\n• develop and explore new gameplay produced by using new technologies\n•\n•\npresent new aspects of a game's gameplay based upon the new technology used\napply creativity methods on a new technology for creating new gameplay\nJudgement and approach\n•\n•\nanalyse potential advantages and disadvantages of various new technology-driven\ngameplay possibilities given the context of specific user groups\nasses ethical and societal issues of wide-spread adaptation of new technology-driven\ngameplay",
    "Course content": "Advances in computer game and game development are often tied intrinsically to the\ndevelop of new technology. However, the potential use of new technology is typically\neasier to identify regarding graphics, sound, networking, and even business aspects than\nregarding the core of a game, its game mechanics or gameplay. The course technology-\ndriven experimental game design focuses upon developing skills for understanding and\napplying new technologies specially towards enabling novel forms of gameplay.\nTwo currently relevant new technologies are introduced in the course (which\ntechnologies vary between years). Creativity methods are taught in the courses as a\npreparation for applying these methods during the work on the specific technologies.",
    "Sub-courses": null,
    "Form of teaching": "The course is divided into two major modules and a smaller introductory module. The\ntwo major modules each focus on a technology which is on the cusp of being able to\ninfluence game development significantly within a couple of years. Each module\nintroduces a technology through lectures, literature, and practice along with tools to\nallow gameplay experiments. The two major modules each contain a group submission\nand an individual submission. Group work usually takes place in groups of 5-6 students.\nThe smaller introductory module goes through concepts and creativity methods for use\nin the other modules.",
    "Assessment": "The smaller introductory module consists of an individual written submission. Each of\nthe two major modules consists of a group submission, an individual written submission\nand an oral presentation in a group.\nThe report in the introductory module and the oral presentations are either failed or\npassed. The group reports and the individual reports in the two major modules use a\ngrading scale for correction.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nTo pass the course, approved results are required on all submissions as well as approved\noral presentations.\nThe final grade for the course is based on the average of the assessment of the two major\nmodules.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe courses TIA108 Prototyping in interaction design, TIA106 Graphical interfaces,\nand TIA104 Interaction design methodology or equivalent are recommended."
  }
}