{
  "metadata": {
    "source_document": "DIT468.pdf",
    "course_code": "DIT468",
    "course_title": "Current Trends in Gaming",
    "swedish_title": "Aktuella trender inom spel",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design",
    "specialization": "A1F, Second cycle, has second-cycle\ncourse/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2022-02-03",
    "valid_from_date": "2023-08-28",
    "programmes": [
      "Game Design & Technology Master's Programme (N2GDT)"
    ],
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "3 Nov 2025 - 18 Jan 2026",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86114"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2022-02-03 and was last revised on 2022-11-23 to be valid from 2023-08-\n28, autumn semester of 2023.",
    "Position in the educational system": "The course is compulsory within the programme N2GDT. It is also a single subject\ncourse at the University of Gothenburg.\nThe course can be part of the following programme: 1) Game Design & Technology\nMaster's Programme (N2GDT)",
    "Entry requirements": "To be eligible for this course, students must have successfully completed 7.5 credits of\nobject-oriented programming.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• Examine current technological and social trends in gaming.\n• Analyse the potential opportunities and threats associated with contemporary\ngaming trends.\nCompetence and skills\n• Apply creativity techniques with the intention of exploring innovative new\ngameplay concepts.\n• Implement game designs to explore novel, emerging techniques.\nJudgement and approach\n• Assess the ethical and societal impact of contemporary trends in gaming.",
    "Course content": "This course focuses on exploring the implications associated with a selection of current\ntrends in gaming. It blends together methods for ideation with implementation. It\naddresses the socioeconomic implications associated with new technology; business\nmodels; And with changing audience expectations.",
    "Sub-courses": "1. Project (Projekt), 7.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The course is divided into several parts, each focusing on a different current trend in\ngaming. The content will vary on a year to year basis. The course is updated regularly to\ntake into account important contemporary developments in game development and\ngame design. Students will be expected to demonstrate a blend of creative; technical; and\ndesign skills. Work is primarily conducted in small groups, where students develop\nstand-alone assignments linked to each of the emergent topics discussed in the course.\nTeaching is primarily through lectures and supervision sessions.\nLanguage of instruction: English",
    "Assessment": "The course is assessed via a portfolio of individual and group submissions. The overall\ngrade for the course is based on a weighted average of portfolio elements.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nThe final grade is based on the average grade of the group reports and the individual\nreports.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT467, 7.5 credits. The course cannot be included in a\ndegree which contains DIT467. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT467 is included.\n\nLast modified\n\n20 February 2025",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)\n\nApplication closed, late application opens 15 July 2025."
  }
}