{
  "metadata": {
    "source_document": "DIT408.md",
    "course_code": "DIT408",
    "course_title": "Introduction to Data science and AI",
    "swedish_title": "Introduktion till Data science och AI",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "cycle": "First cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-11-11",
    "valid_from_date": "Autumn term 2025",
    "programmes": [
      "Computer Science, Bachelor's Programme (N1COS)",
      "Computer Science, Master's Programme (N2COS)",
      "Software Engineering and Management Master's Programme (N2SOF)",
      "Bachelor's Programme in Mathematics (N1MAT)",
      "Mathematical Sciences, Master's Programme (N2MAT)"
    ],
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "3 Nov 2025 - 18 Jan 2026",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86072",
    "content_type": "course"
  },
  "sections": {
    "Position in the educational system": "The course can be part of the following programmes:\n\n1. Computer Science, Bachelor's Programme (N1COS)\n2. Computer Science, Master's Programme (N2COS)\n3. Software Engineering and Management Master's Programme (N2SOF)\n4. Bachelor's Programme in Mathematics (N1MAT)\n5. Mathematical Sciences, Master's Programme (N2MAT)\n\nThe course is a also a single-subject course at Gothenburg University.",
    "Entry requirements": "To be eligible for the course students should have:\n\n- 7.5 hec in basic mathematics (containing e.g. calculus, linear algebra and/or discrete mathematics) or the course Applied mathematical thinking (DIT025 or equivalent).\n- 7,5 hec mathematical statistics (e.g. MSG810 or DIT862 or DIT278 or similar) or the two courses DIT847 and DIT278 (or equivalent) or the course DIT022.\n- 7,5 hec Programming in a General-Purpose Language (e.g. C/C++/Java/Python or similar.\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n**_Knowledge and understanding_**\n\n- describe fundamental types of problems and main approaches in data science and AI;\n- give examples of data science and AI applications from different contexts;\n- give examples of how stochastic models and machine learning (ML) are applied in data science and AI;\n- explain basic concepts in classical AI, and the relationship between logical and data driven, ML-based approaches within AI;\n- briefly explain the historical development of AI, what is possible today and discuss possible future development.\n\n**_Competence and skills_**\n\n- use appropriate programming libraries and techniques to implement basic transformations, visualizations and analyses of example data;\n- identify appropriate types of analysis problems for some concrete data science applications;\n- implement some types of stochastic models and apply them in data science and AI applications;\n- implement and/or use AI-tools for search, planning and problem solving;\n- apply simple machine learning methods implemented in a standard library.\n\n**_Judgement and approach_**\n\n- justify which type of statistical method is applicable for the most common types of experiments in data science applications;\n- discuss advantages and drawbacks of different types of approaches and models within data science and AI;\n- reflect on inherent limitations of data science methods and how the misuse of statistical techniques can lead to dubious conclusions;\n- critically analyze and discuss data science and AI applications with respect to ethics, privacy and societal impact;\n- show a reflective attitude in all learning.",
    "Course content": "During the course, a wide selection of methods for Data Science and AI will be introduced. The course is divided into three parts:\n\nIntroduction to data science\n\n- Implementation of data science solutions, using Python, basic data analysis and visualization.\n- Introduction of the data science process, and appropriate methodology.\n- Examples of core data science methods with case studies such as in clustering, classification and regression.\n- Data science put in context regarding ethics, regulations and limitations.\n\nStatistical methods for data science and AI\n\n- Introduction of some common stochastic models with examples of applications in data science and AI (for instance, naive Bayes classifiers, topic models for text and Hidden Markov Models for sequence data).\n\nArtificial Intelligence\n\n- Introduction to classical AI and machine learning, including the relationship to related areas such as algorithms and optimization, and AI philosophy.\n- Examples of methods and applications of AI, in classical AI (search and constraint satisfaction), and ML-based (search engines, naive Bayes and neural networks)\n- Discussion of ethics and societal impact of AI.",
    "Sub-courses": "Assignments, 4 Credits\n\n\nWritten hall examination, 3.5 Credits",
    "Form of teaching": "Lectures and seminars together with assignments that are done in pairs. Usually there will be one assignment each week.\n\n_Language of instruction_: English",
    "Assessment": "The course is examined by a written examination as well as mandatory written assignments. Compulsory lectures and seminars may occur and will be stated in the course PM.\n\nIf a student who has been failed twice for the same examination element wishes to change examiner before the next examination session, such a request is to be granted unless there are specific reasons to the contrary (Chapter 6 Section 22 HF).\n\nIf a student has received a certificate of disability study support from the University of Gothenburg with a recommendation of adapted examination and/or adapted forms of assessment, an examiner may decide, if this is consistent with the course’s intended learning outcomes and provided that no unreasonable resources would be needed, to grant the student adapted examination and/or adapted forms of assessment.\n\nIf a course has been discontinued or undergone major changes, the student must be offered at least two examination sessions in addition to ordinary examination sessions. These sessions are to be spread over a period of at least one year but no more than two years after the course has been discontinued/changed. The same applies to placement and internship (VFU) except that this is restricted to only one further examination session.\n\nIf a student has been notified that they fulfil the requirements for being a student at Riksidrottsuniversitetet (RIU student), to combine elite sports activities with studies, the examiner is entitled to decide on adaptation of examinations if this is done in accordance with the Local rules regarding RIU students at the University of Gothenburg.",
    "Grades": "_Sub-courses_\n\n1. **Written hall examination**, 3.5 credits\n\n\nGrading scale: Pass (G) and Fail (U)\n2. **Assignments**, 4 credits\n\n\nGrading scale: Pass (G) and Fail (U)\n\nThe grading scale for the whole course comprises: Pass (G) and Fail (U).\n\nAll modules must be passed for passing the course.",
    "Course evaluation": "If a student, who has failed the same examined element on two occasions, wishes to change examiner before the next examination session, such a request is to be submitted to the department in writing and granted unless there are special reasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance). In the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, though at most two years after the course has ceased/been changed. The same applies to work experience and VFU, although this is restricted to just one additional examination session.",
    "Additional information": "The course is a joint course together with Chalmers.\n\nThe course replaces the course DIT407, 7.5 credits. The course cannot be included in a degree which contains DIT407 or DIT852. Neither can the course be included in a degree which is based on another degree in which the course DIT407 or DIT852 is included.\n\nApplication closed, late application opens 15 July 2025.\nLast modified: 20 February 2025",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 165 credits.",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\nMore information about tuition fees"
  }
}