{
  "metadata": {
    "source_document": "DIT401.pdf",
    "course_code": "DIT401",
    "course_title": "Operating Systems",
    "swedish_title": "Operativsystem",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science",
    "specialization": "A1N, Second cycle, has only first-cycle\ncourse/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2017-02-10",
    "valid_from_date": "2018-08-19",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Computer Science, Bachelor's Programme (N1COS)"
    ],
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "1 Sep 2025 - 2 Nov 2025",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86038"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2017-02-10 and was last revised on 2018-02-09 to be valid from 2018-08-\n19, autumn semester of 2018.",
    "Position in the educational system": "The course is offered within the framework of several degree programmes. The course is\nalso a sigle subject course at the University of Gothenburg.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Applied Data Science Master's Programme (N2ADS) and 3)\nComputer Science, Bachelor's Programme (N1COS)",
    "Entry requirements": "To be eligible for the course students should have successfully completed courses\ncorresponding to 60 higher education credits of studies within the subject Computer\nScience, or equivalent, including the following courses:\n• a 7.5 credits course in machine oriented programming (e.g., DIT151 or equivalent),\n• a 7.5 credits course in data structures (e.g., DIT960 or equivalent),\n• a 7.5 credits course in programming (e.g., DIT440, DIT012 or equivalent).\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• explain how internal components of modern operating systems work,\n• explain key concepts and algorithms in operating system implementations,\n• state how research domains (ranging from parallelism to security) meet in the\ncontext of modern operating systems,\nCompetence and skills\n• demonstrate the core functionality of modern operating systems,\n• write programs that interface with the operating system at the system-call level,\n• implement a piece of system-level code,\n• demonstrate programming using multithread synchronization constructs (with\nexample environment languages such as C, C++, Java),\nJudgement and approach\n• analyze and critically weight the trade-offs in the design and implementation of\noperating systems' internal components.",
    "Course content": "The course focuses on the design and implementation of operating systems. Topics\ncovered include: concurrent processes, resource management, deadlocks, memory\nmanagement techniques, virtual memory, processor scheduling, disk scheduling, file\nsystems, distributed file systems, micro kernels, multiprocessor operating system issues\nand virtual machines. Examples or case-studies are provided for all the subjects covered\nduring the course.",
    "Sub-courses": "1. Written exam (Tentamen), 6 higher education credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)\n2. Laboratory work (Laboration), 1.5 higher education credits\nGrading scale: Pass (G) and Fail (U)",
    "Form of teaching": "Lectures, exercises and labs. The labs place emphasis on hands-on experience with\noperating systems design. Students practice by using and constructing essential modules\nin operating systems, such as multiprogramming, memory management, implementation\nof unix-like shell functionality.",
    "Assessment": "The course is examined by Laboratory work and a final individual written exam carried\nout in an examination hall. The Laboratory work is normally carried out in pairs.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nTo pass the course, grade Pass (G) is needed on both the sub-courses. To be awarded a\nPass with Distinction (VG) the student must get the grade Pass with Distinction (VG)\non the sub-course Written exam and the grade Pass on the sub-course Laboratory work.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nThe course replaces the DIT400 Operating systems course. The course cannot be\nincluded in a degree which contains DIT400. Neither can the course be included in a\ndegree which is based on another degree in which the course DIT400 is included.\nCourse literature is to be announced the latest 8 weeks prior to the start of the course.\n\nLast modified 20 February 2025",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\n**No fees** are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)\n\nApplication closed, late application opens 15 July 2025."
  }
}