{
  "metadata": {
    "source_document": "DIT486.pdf",
    "course_code": "DIT486",
    "course_title": "Human-centred design and human factors",
    "swedish_title": "Human-centrerad design och mänskliga faktorer",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Design 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science-Interaction Design, Interaction Design",
    "specialization": "AIN, Second cycle, has only first-cycle course/s as entry requirements, A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2020-11-24",
    "valid_from_date": "2022-01-17",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Computer Science, Bachelor's Programme (N1COS)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2020-11-24 to be valid from 2022-01-17, spring semester of 2022.",
    "Position in the educational system": "The course is provided as a part of the Computer Science Master's Programme N2COS.\nThe course is also offered as a programme course in the Computer Science Bachelor's Programme N1COS.\nThe course can be part of the following programmes: 1) Computer Science, Master's Programme (N2COS), 2) Applied Data Science Master's Programme (N2ADS), 3) Computer Science, Bachelor's Programme (N1COS) and 4) Software Engineering and Management Master's Programme (N2SOF)",
    "Entry requirements": "To be eligible to the course the student must have a Bachelor degree of 180 hec.\nAdditionally, the courses DIT095 Human Computer Interaction 7.5 credits and DIT104 Interaction design methodology 7.5 credits, or the equivalent is required.\nTo be eligible for this course as a programme student in Science Bachelor's Programme N1COS, the student must have passed at least 90 credits in programme courses and the\n2/4\nadditional courses DIT095 Human Computer Interaction 7.5 credits and DIT104\nInteraction design methodology 7.5 credits, or the equivalent is required.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student should be able to:\nKnowledge and understanding\n• Describe diversed theories and practices of human-centered design and human factors.\n• Explain the broad psychological, sociological and ecological aspects of human- technology interaction.\nCompetence and skills\n• Apply theories into concrete project practices.\n• Plan and organize a project that is applying human-centered design and/or human factors methods, models and principles.\n• Formulate research questions in various industrial context and address the issues or needs with theoretical and practical design knowledge.\nJudgement and approach\n• Explain the advantages and the limitations of different theories and methods in the area of human-centered design and human factors.\n• Assess and motivate when human-centered design and human factors methods are applicable.\n• Analyse issues within human-centered design and human factors from a holistic perspective.\nThe course is sustainability-related, which means that at least one of the learning outcomes clearly shows that the course content meets at least one of the University of Gothenburg's confirmed sustainability criteria.",
    "Course content": "The theoretical part presents the fundamental and state of the art of human-centered design and human factors from research to practical applications. Seminars provide additional theoretical grounding and reflection, as well as different practical experience/problems. The practical part is mainly the project development. The project will explore an design opportunity in an industrial context and produce both theoretical\ninsights and practical design solutions through human-centered design and/or human factors methods. The project is carried out in small groups.",
    "Sub-courses": "1. Assignments (Inlämningsuppgifter), 1.5 credits\nGrading scale: Pass (G) and Fail (U)\n2. Project (Projekt), 3 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n3. Take home examination (Hemtentamen), 3 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The course features both practical and theoretical parts, as well as work in groups and individual work. Lectures, literature and seminars give a theoretical foundation. Focus is also on exchange of thoughts, feedback, designs and ideas. Hence, the course requires active participation. Students will spend a significant part of their study time reading literature and working in groups. The course consists of non-mandatory lectures and design workshops, mandatory seminars and assignments, group project, and individual home exam. It is strongly recommended that the students shall attend all the lectures because lectures can provide a basis for seminar discussion and home exam will consider the contents of lectures, seminars and projects.\nLanguage of instruction: English",
    "Assessment": "The course is examined through three modules:\n1. Assignments (1,5 hec).\n2. Take home exam (3 hec).\n3. One project (3 hec).\nIf a student, who has failed the same examined element on two occasions, wishes to change examiner before the next examination session, such a request is to be submitted to the department in writing and granted unless there are special reasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, though at most two years after the course has ceased/been changed. The same applies to work experience and VFU, although this is\n4/4\nrestricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U).\nTo pass the course, all mandatory components must be passed. To earn a higher grade than 3, a higher weighted average from the grades of the components is required.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between teachers and student representatives. Further, an anonymous questionnaire is used to ensure written information. The outcome of the evaluations serves to improve the course by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course TIA100, 7.5 credits. The course cannot be included in a degree which contains TIA100. Neither can the course be included in a degree which is based on another degree in which the course TIA100 is included."
  }
}