{
  "metadata": {
    "source_document": "DIT491.pdf",
    "course_code": "DIT491",
    "course_title": "Open project in interaction design",
    "swedish_title": "Fritt projekt i interaktionsdesign",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design",
    "specialization": "A1F, Second cycle, has second-cycle\ncourse/s as entry requirements",
    "language_of_instruction": "English and Swedish",
    "confirmation_date": "2022-12-09",
    "valid_from_date": "2023-08-28",
    "programmes": [
      "Game Design & Technology Master's Programme (N2GDT)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2022-12-09 to be valid from 2023-08-28, autumn semester of 2023.",
    "Position in the educational system": "The course is offered within the programme Game Design & Technology Master's\nProgramme.\nThe course can be part of the following programme: 1) Game Design & Technology\nMaster's Programme (N2GDT)",
    "Entry requirements": "To be eligible for this course, students must have successfully completed the courses\nTIA104/TDA496 Interaction design methodologies, 7.5 credits, and TIA106/TDA492\nGraphical interfaces, 7.5 credits, or equivalent.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student should be able to:\nKnowledge and understanding\n• decide on content, structure and appropriate media format for a project report\n• use references in an academic text with different media formats, for example a text\nor a video\nCompetence and skills\n• independently carry out a small project in interaction design following established\nbest practices and procedures in small projects in interaction design\n• document project work in a suitable form given the nature of the project\n• do appropriate literature and background research for a small project\n• verbally present a small interaction design project\nJudgement and approach\n• establish an appropriate scope for a project plan to make best possible use of all\nresources available, including skill sets and time\n• reflect upon potential societal issues and ethical problems that may arise from the\nresult of the project",
    "Course content": "The course provides the student with an opportunity to individually or in a smaller\ngroup study something of relevance in the area of interaction design outside of the\nregular syllabus. The project can focus upon technical development as long as there is a\nclear connection to interaction design.\nStudents perform a research and/or development project. Suitable project ideas should\nbe developed in collaboration with the supervisor and an internal or external client.\nSupervisor and internal client can be the same person. An external client cannot be\nsupervisor. The project work should be based on a plan that is created in advance of the\nproject start. The plan should contain goal of the project, planned process, and planned\nresult.\nPlease note that registration to the course is done by the examiner and/or supervisor, not\nby the student.",
    "Sub-courses": "1. Project (Projekt), 7.5 credits\nGrading scale: Pass (G) and Fail (U)",
    "Form of teaching": "Independent project work indiviudal or in small groups, with supervision and with\ncontact with an internal or external client. The work shall start based upon the plan\ndeveloped before the course starts, document how the work progresses, including any\nchanges to the plan, and end with the production of a report. Note that all projects must\nhave a client, either a research client (researcher at Chalmers or other university) or a\nclient from a company or organization.",
    "Assessment": "The course is examined via a project report in appropriate form (for example text or\nvideo), and a public presentation of the project, either as a oral presentation or as a\nposter exhibition showcasing the results of the project.\nTo pass the course when a group project is done, the individual student must have\ncontributed in a substantial way to the final project results of the team, and must be able\nto explain their process, results, and the different team members' contribution.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass (G) and Fail (U).\nTo pass the course, the individual student must have contributed in a substantial way to\nthe final project results of the team, and must be able to explain their process, results,\nand the different team members' contribution.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT490, 7.5 credits. The course cannot be included in a\ndegree which contains DIT490. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT490 is included."
  }
}