{
  "metadata": {
    "source_document": "DIT487.md",
    "course_code": "DIT487",
    "course_title": "Empirical methods for user experience",
    "swedish_title": "Empiriska metoder för användarupplevelser",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "cycle": "Second cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-11-11",
    "valid_from_date": "Autumn term 2025",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Position in the educational system": "The course can be part of the following programmes:\n\n1. Computer Science, Master's Programme (N2COS),\n2. Software Engineering and Management Master's Programme (N2SOF)",
    "Entry requirements": "To be eligible to the course the student must have a Bachelor degree of 180 hec. Additionally, the courses DIT095 Human Computer Interaction 7.5 credits and DIT104 Interaction design methodology 7.5 credits, or the equivalent is required.\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student should be able to:\n\n**_Knowledge and understanding_**\n\n- Describe key qualities of correctly designed qualitative, quantitative and mixed- method studies.\n- Explain the differences between different evaluation strategies and predict their impact on the interaction design process.\n\n**_Competence and skills_**\n\n- Apply standard evaluation methods to studies in the interaction design process\n- Plan and organize user requirements gathering and subsequent analysis in an interaction design process\n- Test hypotheses in quantitative and mixed-method studies of interactive artefacts\n- Implement an effective and ethical evaluation strategy in a design process\n- Report and interpret results of studies according to academic professional standards\n\n**_Judgement and approach_**\n\n- Select design alternatives based on interpreting study results\n- Assess designs of interactive artefacts based on study results\n- Explain the advantages and the limitations of different evaluation strategies in an interaction design process\n- Design effective formative and summative evaluation studies\n- Formulate ethical requirements for empirical studies.",
    "Course content": "The course is a practice-oriented learning experience in which students apply empirical methods to effectively design and evaluate interactive systems. The course teaches the practical and theoretical means to study requirements and evaluate interactive artefacts through conducting user research, gathering data, analysing studies and interpreting results. The course familiarises students both with methods widely implemented in the industry and tools for academic research.\n\nThe course prepares students for professional and research tasks related to evaluation in the interaction design profession. Through being familiar with a portfolio of methods, students will be comfortable planning their evaluation studies and interpreting study results. Knowledge on conducting studies will enable students to assess the quality of studies presented to them. The students will be empowered to make better design decisions based on study results.\n\nThe curriculum covers basic and advanced study designs for requirements gathering and evaluation. The course addresses qualitative data gathering and analysis, understanding and designing experiments, quantitative data processing and interpretations. The students develop the skills to rapidly integrate effective evaluation in the interaction design process.\n\nStudents are introduced to tools for qualitative and quantitative data analysis. These tools are later applied to specific design cases. Interpreting the results, using real design cases, is a key activity. The students learn how to design an effective evaluation strategy\n\nfor an interactive system and how to curate an effective set of methods for a given design case. The course actively discusses how to conduct studies ethically and integrate evaluation seamlessly in the interaction design process.",
    "Sub-courses": "Project, 4.5 Credits\n\n\nTake home examination, 3 Credits",
    "Form of teaching": "The course features both practical and theoretical parts, as well as work in groups and individual work. Lectures, literature and seminars give a theoretical foundation. Focus is also on exchange of thoughts, feedback, designs and ideas. Hence, the course requires active participation. Students will spend a significant part of their study time reading literature and working in groups. The course consists of non-mandatory lectures and design workshops, mandatory seminars and assignments, group project, and individual home exam. It is strongly recommended that the students shall attend all the lectures because lectures can provide a basis for seminar discussion and home exam will consider the contents of lectures, seminars and projects.\n\n_Language of instruction:_ English",
    "Assessment": "The course is examined through two modules:\n\n- Home Exam (3 hec, fail, 3,4,5).\n- Project (4,5 hec, fail, 3,4,5).\n\nThe course grade is a weighted average of the two scores. The fulfilment of learning objectives is examined through conducting a project were multiple versions of an interactive systems are studied using the methods taught in the course. Students design, plan, conduct and analyse studies in groups. The work is documented in a written report. The project is assessed based on methodological rigour, suitability of methods chosen and academic background. The students also write an individual reflection on the project where they discuss alternative study designs and relate their work to current research in interaction design and technologies.\n\nIf a student who has been failed twice for the same examination element wishes to change examiner before the next examination session, such a request is to be granted unless there are specific reasons to the contrary (Chapter 6 Section 22 HF).\n\nIf a student has received a certificate of disability study support from the University of Gothenburg with a recommendation of adapted examination and/or adapted forms of assessment, an examiner may decide, if this is consistent with the course’s intended learning outcomes and provided that no unreasonable resources would be needed, to grant the student adapted examination and/or adapted forms of assessment.\n\nIf a course has been discontinued or undergone major changes, the student must be offered at least two examination sessions in addition to ordinary examination sessions. These sessions are to be spread over a period of at least one year but no more than two years after the course has been discontinued/changed. The same applies to placement and internship (VFU) except that this is restricted to only one further examination session.\n\nIf a student has been notified that they fulfil the requirements for being a student at Riksidrottsuniversitetet (RIU student), to combine elite sports activities with studies, the examiner is entitled to decide on adaptation of examinations if this is done in accordance with the Local rules regarding RIU students at the University of Gothenburg.",
    "Grades": "_Sub-courses_\n\n- **Project**, 4.5 credits\n\n\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n- **Take home examination**, 3 credits\n\n\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n\nThe grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U).\n\nTo pass the course, all mandatory components must be passed. To earn a higher grade than 3, a higher weighted average from the grades of the components is required.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between teachers and student representatives. Further, an anonymous questionnaire is used to ensure written information. The outcome of the evaluations serves to improve the course by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\n\nThe course replaces the course DIT486, 7.5 credits. The course cannot be included in a degree which contains DIT486. Neither can the course be included in a degree which is based on another degree in which the course DIT486 is included."
  }
}