{
  "metadata": {
    "source_document": "DIT572.pdf",
    "course_code": "DIT572",
    "course_title": "Game Engine Architecture",
    "swedish_title": "Spelmotorarkitektur",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design, Computer Science-Interaction Design",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2022-02-03",
    "valid_from_date": "2024-01-15",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)",
      "Game Design & Technology Master's Programme (N2GDT)"
    ],
    "iteration": "Spring 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "20 Jan 2025 - 23 Mar 2025",
    "application_period": "16 Sep 2024 - 15 Oct 2024",
    "application_code": "GU-86045"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2022-02-03 and was last revised on 2022-11-23 to be valid from 2024-01-\n15, spring semester of 2024.",
    "Position in the educational system": "The course is compulsory within the Game Design & Technology Master's\nProgramme. It is also a single subject course at the University of Gothenburg.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Computer Science, Bachelor's Programme (N1COS) and 3)\nGame Design & Technology Master's Programme (N2GDT)",
    "Entry requirements": "To be eligible for this course, students must have either:\n• successfully completed the course Computer Graphics, 7.5 credits, or equivalent, or\n• have 15 credits of programming experience, of which 7.5 of those credits should be\nin an object-oriented context.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student should be able to:\nKnowledge and understanding\n• Describe the typical structure of game engines and the design decisions associated\nwith specific parts of such engines\nCompetence and skills\n• Develop extensions to an example game engine to augment and optimise\nfunctionality\n• Identify faults and deficiencies in an example game engine, and outline solutions for\nthose faults\nJudgement and approach\n• Compare and contrast existing game engines to determine functionality and\nextendibility\n• Plan several parallel extensions of an example game engine to meet game related\ngoals",
    "Course content": "The design and implementation of the fundamental components of a game engine is the\ncore of the Game Engine Architecture course. The course focuses mainly upon 2-\ndimensional engines although other types of game engines are discussed, and students\nwishing to explore 3D game engines can do so as part of the assignment.\nDuring the course we will go over the development and construction of our own game\nengine. This engine (called Shard) is specific to this course, and is thus fully open to\nexpansions and modifications. During the course students will take the source code of\nShard and improve upon it to address perceived inadequacies and develop new\nfunctionality. They will also build an example game that makes use of their modified\nengine to deliver a representative game experience.\nThe course will cover timing regulation, game object architecture, collision action,\ncollision responses, and some simple physics. It will also discuss relevant design\ndecisions and design patterns. It is not expected during this course that you will develop\na feasible competitor for what is on the market. Rather, the process of exploring and\nexpanding a bespoke game engine is intended to be illuminating for those developing\ngames in more robust engines.",
    "Sub-courses": "1. Project (Projekt), 7.5 credits",
    "Form of teaching": "The course is based on a series of technical teardowns and a project within the field of\ngame engine development. This is complemented by lectures and project supervision\nsessions. The work in the project takes place as supervised groups or individuals with\nthe goal of providing practical training in the development and evaluation of game\nengines.\nLanguage of instruction: English",
    "Assessment": "The course is graded by two technical artefacts (a modified game engine and an example\ngame) along with an oral presentation. The overall grade for the course comes from a\nweighted average of these elements.\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nThe final grade is based on the weighted average grade of the submissions.",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student\nrepresentatives. Further, an anonymous questionnaire is used to ensure written\ninformation. The outcome of the evaluations serves to improve the course by indicating\nwhich parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT455, 7.5 credits. The course cannot be included in a\ndegree which contains DIT455. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT455 is included.\n\nLast modified\n\n23 September 2024",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 19 253 SEK\n\nFirst payment: 19 253 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)"
  }
}