{
  "metadata": {
    "source_document": "DIT666.pdf",
    "course_code": "DIT666",
    "course_title": "Concept-Driven Interaction Design",
    "swedish_title": "Koncept-driven interaktionsdesign",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Technology 50% and Design 50%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2022-12-09",
    "valid_from_date": "2024-01-15",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Game Design & Technology Master's Programme (N2GDT)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ],
    "iteration": "Spring 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "24 Mar 2025 - 8 Jun 2025",
    "application_period": "16 Sep 2024 - 15 Oct 2024",
    "application_code": "GU-86101",
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2022-12-09 to be valid from 2024-01-15, spring semester of 2024.",
    "Position in the educational system": "The course is also offered as a single subject course.\n\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Game Design & Technology Master's Programme (N2GDT)\nand 3) Software Engineering and Management Master's Programme (N2SOF)",
    "Entry requirements": "Bachelor degree 180 hec and the courses DIT095 Human computer interaction, 7.5 hec\nand DIT104 Interaction design methodology, 7.5 hec or equivalent.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "After completion of the course the student should be able to:\n\nKnowledge and understanding\n• Explain what \"Concept-Driven Interaction Design\" means, and give an account of\nsome of the alternative theories, programmes, and approaches within the area of\ninteraction design.\n• Describe concept-driven design methods as well as their underlying theories.\n• Analyze and discuss a certain design in conceptual terms.\n\nCompetence and skills\n• Analyze experiences grounded in the conceptual framing of interactive systems or\nartefacts.\n• Choose and apply suitable design methods, informed by theory and context.\n• Design towards a certain concept, making it permeate all aspects of the artefact.\n• Be able to motivate ones design decisions in relation to the concept one is designing\nfor.\n• Give and receive constructive feedback regarding concept driven design.\n\nJudgement and approach\n• Be able to apply and identify approaches and theories in order to discuss, motivate,\nand design concept-driven artefacts.\n• Be able to conclude and discuss the ethical and societal consequences of designing\ntowards a certain concept.",
    "Course content": "After the course you should have a clear idea of some conceptual and aesthetic ideals\nand how to design according to them, giving a valid design rationale. Designing\ninteractive systems is often, but not always about designing for efficiency in a user-\ncentered manner. In this course, we explore theories and alternative approaches to\ninteraction design as a complement to user-centered design. We acknowledge the need to\ndesign for efficiency, but aim instead for playfulness, criticism, embodiment or various\nemotions (e.g. fear, joy, comfort), all of which are supported by the conceptual framing\nof the design. In this course we will look closer at different fringe theories within\ninteraction design, and discuss and practice how to design with them through the\nanalysis and development of design concepts.\n\nContent includes, but is not limited to:\n• What concept driven design means and how we can design with a concept as the\nmain motivator.\n• Fringe theories and methods in interaction design and how they relate to and\ncomplement more widespread approaches.\n• Analysis of the concepts behind interactive systems of artefacts.",
    "Sub-courses": "1. Project (Projekt), 3.5 credits\n   Grading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)\n2. Literature seminars (Litteraturseminarier), 2 credits\n   Grading scale: Pass (G) and Fail (U)\n3. Exercises (Övningar), 2 credits\n   Grading scale: Pass (G) and Fail (U)",
    "Form of teaching": "The course features both practical and theoretical parts, as well as work in groups and\nindividual work. Lectures and literature seminars give a theoretical foundation, which\nare immediately put into practice. Focus is upon turning analysis and reflection into\npractical action. Focus is also on exchange of thoughts, feedback, designs and ideas.\nHence, the course requires active participation.\n\nLanguage of instruction: English",
    "Assessment": "The course is examined through three modules:\n1. Literature seminars, where literature is presented along with an issue and is\ndiscussed (2 hec).\n2. Exercises where various design methods that focus on the development of a\nconcept in a design process is practiced.The exercises also give training in giving\nand taking constructive criticism (2 hec).\n3. One individual project (3,5 hec).\n\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\n\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).\nTo pass the course, students must receive a passing grade in all modules. The grade for\nthe entire course will be determined by the project.",
    "Course evaluation": "After completion of the course the students are to be given the possibility of\nparticipating in course anonymously. The processed results of the course evaluations are\nto be made accessible to students and also made available to new students at the\nbeginning of the next course. The results of and possible changes to the course will be\nshared with students who participated in the evaluation and students who are starting\nthe course.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course.\nThe course replaces the course DIT157, 7.5 credits. The course cannot be included in a\ndegree which contains DIT157. Neither can the course be included in a degree which is\nbased on another degree in which the course DIT157 is included.\n\nLast modified 7 March 2025",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 19 253 SEK\n\nFirst payment: 19 253 SEK\n\n**No fees** are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)"
  }
}