{
  "metadata": {
    "source_document": "DIT665.pdf",
    "course_code": "DIT665",
    "course_title": "Seminars in Computer Systems and Network",
    "swedish_title": "Seminariekurs i datorsystem och nätverk",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2013-11-11",
    "valid_from_date": "2014-09-01",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2013-11-11 to be valid from 2014-09-01.",
    "Position in the educational system": "The course is a part of the Computer Science Master's Programme and a single subject\ncourse at the University of Gothenburg.\nThe course can be part of the following programme: 1) Computer Science, Master's\nProgramme (N2COS)",
    "Entry requirements": "To be eligible for the course students should have successfully completed two years of\nstudies within Computer Science or equivalent. The courses DIT420 Computer\ncommunication, DIT663 Computer Networks, DIT400 Operating Systems, DIT240\nDistributed Systems or equivalent are required.\nEnglish B level or English proficiency equivalent to IELTS 6.5 no part under 5.5 or\nTOEFL 575 p, TWE score 4.5 is also required.",
    "Learning outcomes": "After the course completion, you are expected to be able to:\n1. Knowledge and understanding\n- solve problems in the studied area of research including system design issues,\nnetworking and advanced programming techniques.\n- identify and evaluate critical issues and existing technological limitations in the state-\nof-the art in computer systems and networks.\n2. Skills and abilities\n- identify the most relevant papers in the professional literature and review them.\n3. Judgment and approach\n- analyze the performances of studied solutions using numerical analysis and formal\nproofs.\n- grasp the impact that different solutions can have to an application or a system.\n- critically analyze problems and find new solutions for modern networks and computer\nsystems.",
    "Course content": "This course examines current state-of-the-art, research-related topics in the fields of data\ncommunication, computer networks, distributed systems, computer security, real-time\nsystems computer architecture and computer system engineering. Covering a broad\nrange of topics and based on mainly scientific papers, it is intended for students\nplanning to carry out a research project in any of these areas or anyone interested in the\ncontemporary research problems of this field.\nThe course includes at least four of the following main topics:\n•\nComputer and network security\n• Distributed computer systems\n• Real-time computer systems\n• Computer system architectures\n• Hot topics in computer Systems and Networks\nFor each of the main topics, there will be introduction lectures that will explore the\nliterature review tasks. You will work on literature survey tasks, write reports and\ndeliver oral presentations. You will also peer review the presentations and reports.\nBased on the peer review comments, a revised and extended version of the report is\nexpected.",
    "Sub-courses": "",
    "Form of teaching": "Language of instruction: English",
    "Assessment": "The course is examined by written review assignment (1.5 hec). The student must present\nthe assignment orally, including a peer review of other students written assignment and\ntheir oral presentation (1.5 hec). The course is also examined by a revised and extended\nwritten report (4.5 hec).\nAll the work will be carried out in pairs. The extended written report version is the bases\nfor the final course grade.\nA student who has failed two examinations on the same material has the right to request\na change of examiner. Such a request must be submitted to the Department in writing\nand shall be granted unless there are particular reasons not to do so.\nIn cases where a course has been discontinued or has undergone major changes, students\nmust be guaranteed at least three examination opportunities (including the regular\nopportunity) based on the previous content of the course for a period of at least one\nyear.",
    "Grades": "The grading scale comprises: Fail (U), Pass (G), Pass with Distinction (VG).\nIn order to get the grade Pass for the full course the student must Pass the written\nassignment, the presentation part and get the grade Pass on the extended written report.\nIn order to get the grade Pass with Distinction for the whole course, the student must\nget the grade Pass with Distinction on the extended written report and pass both the\nassignment part and the presentation part.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers."
  }
}