{
  "metadata": {
    "source_document": "DIT640.pdf",
    "course_code": "DIT640",
    "course_title": "Research Project in Software Engineering",
    "swedish_title": "Forskningsprojekt i Programvaruteknik",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 50% and Technology 50%",
    "credits": "15",
    "cycle": "Second Cycle",
    "main_field_of_study": "Software Engineering",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English and Swedish",
    "confirmation_date": "2024-01-29",
    "valid_from_date": "2024-09-02",
    "programmes": [
      "Software Engineering and Management Master's Programme (N2SOF)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2024-01-29 to be valid from 2024-09-02, autumn semester of 2024.",
    "Position in the educational system": "The course can be part of the following programme: 1) Software Engineering and Management Master's Programme (N2SOF)\nMain field of studies\nSoftware Engineering\nSpecialization\nA1F, Second cycle, has second-cycle course/s as entry requirements",
    "Entry requirements": "To be eligible for the course, at least 30 credits must come from courses on the advanced level within the area of software engineering, including the following courses: Advanced Requirements Engineering, Quality Assurance and Testing, Empirical Software Engineering, and Project Management, or equivalent.\nTo be admitted to the course the student must:\n1. Identify an academic supervisor who is committed to supervising the student and monitoring the progress towards the learning goals,\n2. Provide a planning report that clearly defines the research problem, research questions, related work, and proposed methodology for the project.\nStudents get admitted on approval of the planning report. The subject of the proposed project should be in the field of software engineering.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• apply in-depth knowledge of software engineering and, in a scientifically correct way, relate this knowledge to current research and development work\n• choose and state one's reasons for selecting their project method with respect to the chosen software engineering problem\nCompetence and skills\n• critically, independently and creatively identify, formulate and address complex software engineering issues\n• plan, execute, and evaluate the research project\nJudgement and approach\n• create, analyze, and critically evaluate different technical solutions to the chosen research questions\n• observe and discuss ethical and societal aspects of the research and development work, both pertaining to how the work is carried out as well as the topics it explores/develops",
    "Course content": "Students in this course develop in-depth theoretical and practical understanding of a selected problem area in software engineering. Through a research project, students develop a contribution that advances the state-of-the-art in this area.\nThis course is formed mainly by an individual research project conducted in collaboration with an academic supervisor. In this project, students must apply and extend their knowledge of software engineering concepts.\nStudents are expected to identify a research challenge with practical significance, develop research questions to address, formulate an appropriate research method, rigorously collect data, analyze that data to develop answers to the formulated questions, and communicate their findings.",
    "Sub-courses": "1. Assignments ( Inlämningsuppgifter), 15 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "Language of instruction: English and Swedish",
    "Assessment": "The course is assessed through an individual written report and a demonstration of the project results. The final report is a written document containing a project description, background, related work, research questions, research method description, results, and discussion (including threats to validity). The report should be accompanied by a demonstration of the main results of the project to the examiner.\nIf a student who has twice received a failing grade for the same examination component wishes to change examiner ahead of the next examination session, such a request should be made to the department in writing and should be approved by the department unless there are special reasons to the contrary (Chapter 6 Section 22 of the Higher Education Ordinance). If a student has received a recommendation from the University of Gothenburg for study support for students with disabilities, the examiner may, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources are required, decide to allow the student to sit an adjusted exam or alternative form of assessment.\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years after the course has ceased/been changed. The same applies to internships and professional placements (VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U).\nIn order to pass the course, both the final report and the demonstration have to be approved. The final grade in the course is decided from the grade of the final report.",
    "Course evaluation": "The results of and possible changes to the course will be shared with students who participated in the evaluation and students who are starting the course.",
    "Additional information": "The course is a joint course together with Chalmers.\nThe course literature will be decided in consultation with the chosen supervisor."
  }
}