{
  "metadata": {
    "source_document": "DIT663.pdf",
    "course_code": "DIT663",
    "course_title": "Computer Networks",
    "swedish_title": "Computer Networks",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science-Networks and Distributed Systems",
    "specialization": "AXX, Second cycle, in-depth level of the course cannot be classified",
    "language_of_instruction": "English",
    "confirmation_date": "2011-05-20",
    "valid_from_date": "2015-08-30",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2011-05-20 and was\nlast revised on 2014-11-13 by Department of Computer Science and Engineering to be\nvalid from 2015-08-30, autumn semester of 2015.",
    "Position in the educational system": "The course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS) and 2) Computer Science, Bachelor's Programme (N1COS)",
    "Entry requirements": "The requirement for the course is to have successfully completed two years of studies\nwithin the subject Computer Science or equivalent. The course DIT420 Computer\nCommunication is required.\n\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "1. Knowledge and understanding\nAfter completion of the course the student is expected to be able to\n- show knowledge about network design, administration, and traffic engineering.\n- describe and analyze in detail the architecture, core protocols, global routing, services\nand service limitations of the Internet.\n- analyze and discuss contemporary networking problems such as IP mobility and\nmultimedia transmission over IP.\n\n2. Skills and abilities\nAfter completion of the course the student is expected to be able to:\n- develop small scale network applications using fundamental networing techniquesand\nand describe and justify these software developments.\n\n3. Judgement and approach\n- review Internet protocol specifications (RFCs) and their software implementation.\n- point out cases in which the software inefficiently consumes the system resources.",
    "Course content": "This course, which builds on the fundamental TCP/IP courses, aims to provide in-depth\nknowledge of the core technology, services, and applications used in computer networks\nand the Internet. This course provides the students the ability to understand\nfundamental issues in computer networks and would consider Internet technologies as\nan example. Moreover, the course provides knowledge and skill to work in the area by\nlearning about important Internet protocols and concepts, such as:\nNetwork equipment. Routing architecture and protocols. Switching. Multicast and\nanycast. Mobile IP. Network design. Traffic engineering. Next generation Internet\nprotocols. Tools and methods for remote network administration. Analysis of core\nservices and protocols such as ICMP and DNS. Voice and video transmission over\nInternet. Design of networks protocols. Lectures and laboratory assignments.",
    "Sub-courses": "The course is divided into the following sub-courses:\nWritten examination, 6,0 hp\nLaboratory, 1,5 hp",
    "Form of teaching": "",
    "Assessment": "The course is examined by an individual written hall examination (U-VG) at the end of\nthe course and approved assignments (U-G). The assignments are carried out in pairs, if\npossible.\nA student who has failed the same examination twice has the right to request of the\ndepartment a change of examiner. The request is to be in writing and submitted as soon\nas possible. The department is to grant such a request without undue delay. In cases\nwhere a course has been discontinued or major changes have been made a student\nshould be guaranteed at least three examination occasions (including the ordinary\nexamination occasion) during a time of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nIn order to be awarded Pass for a full course, the students must Pass both the exam and\nthe assignments. To be awarded Pass with Distinction for a full course, the Pass with\nDistinction must be obtained in the written exam and the assignments must be\napproved.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. As far as possible, evaluations are to be completed\nelectronically. The outcome of the evaluations serves to improve the course by\nindicating which parts could be added, improved, changed or removed.",
    "Additional information": ""
  }
}