{
  "metadata": {
    "source_document": "DIT728.pdf",
    "course_code": "DIT728",
    "course_title": "Design of AI systems",
    "swedish_title": "Design av AI-system",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Data Science, Computer Science",
    "specialization": "A1F",
    "language_of_instruction": "English",
    "confirmation_date": "2020-01-21",
    "valid_from_date": "2021-01-18",
    "programmes": [
      "Mathematical Sciences, Master's Programme (N2MAT)",
      "Computer Science, Master's Programme (N2COS)",
      "Applied Data Science Master's Programme (N2ADS)"
    ],
    "iteration": "Spring 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "20 Jan 2025 - 23 Mar 2025",
    "application_period": "16 Sep 2024 - 15 Oct 2024",
    "application_code": "GU-86005"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2020-01-21 to be valid from 2021-01-18, spring semester of 2021.",
    "Position in the educational system": "The course can be part of the following programmes: 1) Mathematical Sciences,\nMaster's Programme (N2MAT), 2) Computer Science, Master's Programme (N2COS)\nand 3) Applied Data Science Master's Programme (N2ADS)\nMain field of studies\nData Science\nComputer Science\nSpecialization\nA1F, Second cycle, has second-cycle\ncourse/s as entry requirements\nA1F, Second cycle, has second-cycle\ncourse/s as entry requirements",
    "Entry requirements": "To be eligible for the course the student must have successfully completed courses in:\n• 7,5 hec mathematical thinking (DIT025 or DIT856 or equivalent) or a course in\nbasic mathematics (containing e.g. calculus, linear algebra, discrete mathematics),\n• 7,5 hec mathematical statistics (e.g. MSG810 or DIT862 or similar),\n• 7,5 hec programming in a general-purpose language (e.g. Python/Java/C or similar),\n• An introductory course in Data Science and/or AI, for examle DIT852 or DIT405\nor equivalent.\nWe strongly recommend to also take a course in Machine learning, for example DIT866\nor similar, or that such a course is taken in parallel alongside this course.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• Provide an overview of different applications of AI and related areas.\n• Describe how some different well-known AI-systems work and how they are used.\n• Explain how AI approaches relate to other kinds of advanced information\nprocessing.\nCompetence and skills\n• Identify problems that can be solved with AI and other advanced computational\ntechniques.\n• Design simpler Ai systems for different applications, including model choices and\nsystem design.\n• Implement AI systems with programming in combination with different tools and\nprogramming libraries.\nJudgement and approach\n• Discuss advantages and disadvantages of different models and approaches in AI.\n• Reflect over fundamental possibilities and limitations of current AI approaches.\n• Critically analyze and discuss AI applications with respect to ethics, privacy and\nsocietal impact.\n• Show a reflective attitude in all learning.",
    "Course content": "The course teaches design of AI systems in several different ways:\n• Reading of papers and lectures describing different AI systems and their design (eg.\nAlphaZero, Watson, systems for self-driving cars,...)\n• Opportunities to see and try out the implementation of different simpler AI systems.\n• Own problem solving in the form of design and implementation of simpler AI\nsystems.\n• Discussions about possibilities and limitations of AI, ethics and societal impact.",
    "Sub-courses": "1. Assignments (Inlämningsuppgifter), 7.5 credits\nGrading scale: Pass with Distinction (VG), Pass (G) and Fail (U)",
    "Form of teaching": "Lectures and modules with exercises and mini-projects – these are mainly done in groups\nof two persons.\nLanguage of instruction: English",
    "Assessment": "Assignments and mini-projects.\nIf a student, who has failed the same examined element on two occasions, wishes to\nchange examiner before the next examination session, such a request is to be submitted\nto the department in writing and granted unless there are special reasons to the contrary\n(Chapter 6, Section 22 of Higher Education Ordinance).\nIn the event that a course has ceased or undergone major changes, students are to be\nguaranteed at least three examination sessions (including the ordinary examination\nsession) over a period of at least one year, though at most two years after the course has\nceased/been changed. The same applies to work experience and VFU, although this is\nrestricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nTo pass the course, the assignments and mini-projects must pass. To get a higher grade\nthan Pass, a higher weighted average from the grades of the assignments and mini-\nprojects is required.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.\nThe results of and possible changes to the course will be shared with students who\nparticipated in the evaluation and students who are starting the course.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature will be announced at the latest 8 weeks prior to the start of the course.\n\nLast modified 15 January 2025",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 19 253 SEK\n\nFirst payment: 19 253 SEK\n\n**No fees** are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)"
  }
}