{
  "metadata": {
    "source_document": "DIT795.pdf",
    "course_code": "DIT795",
    "course_title": "Theory and Logic Design of Switching Circuits",
    "swedish_title": "Digitalteknik, fortsättningskurs",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "First Cycle",
    "main_field_of_study": "-",
    "specialization": "G1F, First Cycle, has less than 60 credits in first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2009-09-07",
    "valid_from_date": "2013-01-21",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)",
      "No translation available (NDATM)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2009-09-07 and was last revised on 2012-12-19 by Department of Computer Science and Engineering to be valid from 2013-01-21.",
    "Position in the educational system": "The course is a part of the Computer Science Bachelor's programme and a single-subject course at the University of Gothenburg.\nThe course can be part of the following programmes: 1) Computer Science, Master's Programme (N2COS), 2) Computer Science, Bachelor's Programme (N1COS) and 3) No translation available (NDATM)",
    "Entry requirements": "To be eligible for the course students should have successfully completed the first year of the Computer Science Bachelors education (or equivalent) and the course DIT790 Fundamentals of Digital Systems and Computers (or equivalent).",
    "Learning outcomes": "After completion of the course the student is expected to be able to:\n1. Knowledge and understanding\n• explain that the hardware works in parallel and to exploit parallelism in VHDL.\n• explain the function, use, and limitations of reconfigurable versus ASIC\ntechnologies\n• describe and distinguish Finite State Machines of Mealy, Moore, and synchronous\nMealy type.\n• show understanding of the basics of design for testability and the basic principles\nbehind the testing.\n• implement asynchronous sequential circuits; Minimize an asynchronous sequential\ncircuit and give it a race-free encoding.\n• describe a digital design in VHDL, perform simulation and synthesis with modern\ntools and perform tests against the target technology.\n2. Skills and abilities\n• create the design specifications of a digital circuit for a given problem.\n•\napply structured methods for analysis and synthesis of combinational and sequential\ncircuits.\n• use VHDL to implement combinatorial and sequential circuits.\n• use the target FPGA technology to implement a digital hardware design.\n• master the binary arithmetic such as \"Carry look-ahead\", addition multiplication.\n• define FSM encodings and perform state minimization, be able to implement FSMs\nin VHDL and understand their timing properties.\n• create test benches for VHDL designs.\n• describe and perform the steps required from the VHDL description of a hardware\nmodule to its synthesis and hardware implementation.\n3. Judgment and approach\n• judge the advantages and disadvantages of different implementation technologies\n(ASICs, FPGAs) for digital designs, and select one for a specific design.\n• judge different design decisions (e.g. ripple-carry versus carry look-ahead adder) for\na specific problem and select one based on the design constraints.",
    "Course content": "The course is intended to give fundamental knowledge about analysis, synthesis and optimization of combinatorial and sequential digital circuits. The course also presents the technologies used for implementing such circuits. As part of the course, the student will be introduced to a modern computer-based design tool (CAD), and learn the basics of a hardware description language.",
    "Sub-courses": "",
    "Form of teaching": "Language of instruction: English",
    "Assessment": "The course is examined by an individual exam given in an examination hall and 7 laboratory assignments. The Laboratory work is carried out in groups of normally 2 students.\nOpportunity for re-examination is given twice a year.\nA student who failed a same examination twice has the right to request of the department a change of examiner. The request is to be in writing and submitted as soon as possible. The department is to grant such a request without undue delay.\nIn cases where a course has been discontinued or major changes have been made a student should be guaranteed at least three examination occasions (including the ordinary examination occasion) during a time of at least one year from the last time the course was given.",
    "Grades": "The grading scale comprises: Fail (U), Pass (G), Pass with Distinction (VG).\nTo obtain the grade Pass for the whole course the student must pass the laboratory assignments and achieve at least 40% out of total points on the exam. In order to get the grade Pass with Distinction for the whole course, the student must get at least 70% out of total points on the exam; in addition the student must have been awarded Pass with Distinction on the laboratory assignments.\nRegarding the application of ECTS scales, please see Vice-Chancellors decision 2007-05- 28,\ndnr G 81976/07.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between teachers and student representatives. Further, an anonymous questionnaire can be used to ensure written information. The outcome of the evaluations serves to improve the course by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "Teaching is through lectures and laboratory."
  }
}