{
  "metadata": {
    "source_document": "DIT880.pdf",
    "course_code": "DIT880",
    "course_title": "Interaction Design Methodology",
    "swedish_title": "Interaction Design Methodology",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science-Interaction Design",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2009-09-18",
    "valid_from_date": "2010-09-01",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)",
      "No translation available (NDATM)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2009-09-18 to be valid\nfrom 2010-09-01.",
    "Position in the educational system": "5 higher education credits, is a part of the Computer Science Masters programme and\nan elective course at University of Gothenburg.\nThe course is worth 7. This course is labeled as an A1N course.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Computer Science, Bachelor's Programme (N1COS) and 3)\nNo translation available (NDATM)",
    "Entry requirements": "To be eligible for the course\nstudents should have successfully completed two years of studies within Computer\nScience or equivalent. The course DIT860 Graphical Interfaces or equivalent is\nrequired.",
    "Learning outcomes": "Knowledge and understanding\nAfter completing the course the student is expected to be able to:\n• understand the difference between the methods employed in craftsmanship,\ntraditional design, and modern design\n• develop and describe new design methods\n• reflect on your own design process objectively\nSkills and abilities\nAfter completing the course the student is expected to be able to:\n• criticize design processes with respect to methods used\n• modify design methods to fit the context they are to be used in\nJudgement and approach\nAfter completing the course the student is expected to be able to:\n• plan design projects with respect to design goals, stakeholders' requirements, and\navailable resources and expertise\n• design with regards to aesthetical issues of interaction",
    "Course content": "The course introduces basic design methodology in interaction design with focus on\ndesign issues related to aesthetics. Theory is combined with practical training to give\nstudents training in working systematically with the design of computational things and\nsystems. Training in specific design methods are provided through exercises and the\ngroup project while meta methods such as iterative design are aspects of the group\nproject.",
    "Sub-courses": "",
    "Form of teaching": "Language of instruction: English\nThe course is given in English.",
    "Assessment": "The student is examined by project work in a group and as a individually written home\nexam. In cases where a course has been discontinued or major changes have been made\na student should be guaranteed at least three examination occasions (including the\nordinary examination occasion) during a time of at least one year from the last time the\ncourse was given. A student who has failed a test twice has the right to change\nexaminers, if it is possible. A written application should be sent to the Department.",
    "Grades": "The grading scale comprises: Fail, Pass, Pass with distinction.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire can be used\nto ensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.",
    "Additional information": ""
  }
}