{
  "metadata": {
    "source_document": "DIT860.pdf",
    "course_code": "DIT860",
    "course_title": "Graphical Interfaces",
    "swedish_title": "Graphical Interfaces",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science-Interaction Design",
    "specialization": "AXX, Second cycle, in-depth level of the\ncourse cannot be classified",
    "language_of_instruction": "English",
    "confirmation_date": "2006-11-17",
    "valid_from_date": "2007-09-01",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)",
      "No translation available (NDATM)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2006-11-17 to be valid\nfrom 2007-09-01.",
    "Position in the educational system": "5 higher education credits, is a part of the Computer Science Masters programme and\nan elective course at University of Gothenburg.\nThe course is worth 7. This course is labeled as an AXX course.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Computer Science, Bachelor's Programme (N1COS) and 3)\nNo translation available (NDATM)",
    "Entry requirements": "To be eligible for the course\nstudents should have successfully completed two years of studies within Computer\nScience or equivalent. The course DIT340 Human Computer Interaction or equivalent\nis required.",
    "Learning outcomes": "After completing the course the student is expected to be able to:\nKnowledge and understanding\n• know commonly used interface solutions\n• understand how to depict and express functionality\nSkills and abilities\n• layout components in a graphical interface\n• make design decisions related to interaction-related issues\n• design different software postures\n• design interfaces for beginners, experts and users with intermediate skills\n• design a graphic interface displayed elsewhere than on average computer screens\nJudgement and approach\n• solve interaction design problems related to graphical user interfaces and motivate\nyour solutions\n• create interfaces that utilize other input devices than mouse and keyboard\n• design a relatively complex graphic user interface, and be able to provide a valid\ndesign rationale for it.",
    "Course content": "The course is highly practical. Lectures and literature give a theoretical foundation, but\nthis theory is immediately put into practice in a series of small exercises and a few larger\nprojects. When practicing, focus is upon motivating, making and analyzing the design\ndecisions made. Most of the work is done in groups of various sizes but there is also a\nsignificant amount of individual work. Content includes:\n• Designing for Beginners, Experts and Intermediates\n• Software Posture\n• Flow vs. excise\n•\nDesigning navigation\n•\nDesigning Look and Feel\n• Using colour, text and graphics\n• Information Visualization\n• Metaphors, Idioms and Affordances\n• Direct Manipulation\n• Selection, Drag and Drop\n• Manipulating Controls, Objects and Connections\n• Using Controls\n•\nUsing Menus, Toolbars and ToolTips\n•\n• Using Dialogs\nDesigning for embedded systems\n• Designing for non-traditional output and input",
    "Sub-courses": null,
    "Form of teaching": "Language of instruction: English\nThe course is given in English.",
    "Assessment": "The student is examined by project work in a group and project documentation done\nindividually. In cases where a course has been discontinued or major changes have been\nmade a student should be guaranteed at least three examination occasions (including the\nordinary examination occasion) during a time of at least one year from the last time the\ncourse was given.",
    "Grades": "The grading scale comprises: Fail, Pass, Pass with distinction.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire can be used\nto ensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.",
    "Additional information": null
  }
}