{
  "metadata": {
    "source_document": "DIT844.pdf",
    "course_code": "DIT844",
    "course_title": "Project Management",
    "swedish_title": "Projektledning",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Software Engineering",
    "specialization": "AXX, Second cycle, in-depth level of the course cannot be classified",
    "language_of_instruction": "English",
    "confirmation_date": "2014-02-18",
    "valid_from_date": "2017-08-20",
    "programmes": [
      "Software Engineering and Management, Master's Programme (N2SEM)",
      "Software Engineering Master's Programme (N2SOM)",
      "Software Engineering and Management Master's Programme (N2SOF)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2014-02-18 and was last revised on 2017-06-16 to be valid from 2017-08-\n20, autumn semester of 2017.",
    "Position in the educational system": "The course is a part of the Software Engineering and Management Master's Programme.\nThe course can be part of the following programmes: 1) Software Engineering and\nManagement, Master's Programme (N2SEM), 2) Software Engineering Master's\nProgramme (N2SOM) and 3) Software Engineering and Management Master's\nProgramme (N2SOF)",
    "Entry requirements": "To be eligible for this course, the student must be admitted to the Master's programme\nin Software Engineering.",
    "Learning outcomes": "After completing the course, a student will be able to\nKnowledge and understanding\n• Describe basic project management concepts and tools\nSkills and abilities\n• Apply project management theories to analyze the specific characteristics of\nindustrial projects and based on this suggest appropriate ways to manage the\nprojects\n• Structure and organize simple projects\nJudgement and approach\n• Frame, analyze and solve managerial problems in project settings using appropriate\nliterature\n• Use literature to critically evaluate project management models",
    "Course content": "The course is about managing projects. This means that the course contains general\nknowledge on project management and reflects such knowledge in contingences\noccurring when dealing with projects in technology-based firms. The following themes\ncould be identified in the course's subject area:\nOrganizing projects and organizational characteristics\nProject leadership and learning\nProject planning and control\nThe course consists of two parts (Project Management Basics and Mastering Project\nManagement)\nPart one: The Project Management Basics\nThis part is aimed at a general understanding of project management. You will be\nprovided with insight of the prevailing vocabulary and perspectives of the project\nmanagement movement profession, and this is core to the second part of the course.\nThe Project Management Basics consists of serveral intense lectures in the first reading\nweeks of the course, followed by a two-hour test. A re-test also is scheduled for the\nExam week in the current study period.\nPart two: Mastering Project Management\nThe teaching of Mastering Project Management consists of lectures and four thematic\ncases. This part aims at providing you with an increased understanding of what\nmechanisms keep mankind from perfecting project management. In order to achieve\nthis, Mastering Project\nManagement includes theories from different research disciplines outside of project\nmanagement such as organization theory, leadership research, organizational politics,\ncontract theory and organizational learning.",
    "Sub-courses": "",
    "Form of teaching": "Language of instruction: English",
    "Assessment": "It is mandatory to participate in the case seminars and meet the deadlines for hand-ins.\nThe course is examined by project management basics test, case seminar hand-ins and\nan individual written home exam.\nA student who has failed two examinations on the same material has the right to request\na change of examiner. Such a request must be submitted to the Department in writing\nand shall be granted unless there are particular reasons not to do so.\nIn cases where a course has been discontinued or has undergone major changes, students\nmust be guaranteed at least three examination opportunities (including the regular\nopportunity) based on the previous content of the course for a period of at least one\nyear.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nThe three examinations, Basic Test, Case hand-ins and Home Exam, are assigned the\nweights 20%, 40%, and 40%, of the course overall.\nTo pass the course (G) the following is required: participation in the compulsory\nactivities and the grade G on the Project Management Basics Test, on the Case Seminar\nhand-ins and on the Home Exam. I.e. 40% of the total amount of points must be passed.\nFailing to meet the mandatory deadlines may influence overall markings. To pass the\ncourse with Distinction (VG) the student must get 80% of the total amount of points.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers."
  }
}