{
  "metadata": {
    "source_document": "DIT870.pdf",
    "course_code": "DIT870",
    "course_title": "Interaction Design Project, 15 higher education credits",
    "swedish_title": "Interaction Design Project, 15 högskolepoäng",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "15",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science-Interaction Design",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2009-09-23",
    "valid_from_date": "2010-01-19",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)",
      "No translation available (NDATM)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2009-09-23 to be valid\nfrom 2010-01-19.",
    "Position in the educational system": "The course is a part of the Computer Science Master's programme and a single subject\ncourse at the University of Gothenburg.\nThe level for the course in relation to degree requirements is Master's degree, code A1F.\nThe course has course/courses at second cycle level as entry requirements.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Computer Science, Bachelor's Programme (N1COS) and 3)\nNo translation available (NDATM)",
    "Entry requirements": "To be eligible for the course\nstudents should have successfully completed a first year studies within the subject\nComputer Science or equivalent. Specifically, the courses DIT860 Graphical Interfaces\nand DIT880 Interaction Design Methodology or equivalent are required.",
    "Learning outcomes": "The course focuses on giving the students throughout training and experience from\ninteraction design work.\nAfter completing the course the student is expected to be able to:\n• Motivate and give the design rationale for decisions in an interaction design process\n• Apply user evaluation methods in practice\n• Apply design methods systematically\n• Create and critically compare concept ideas\n• Identify needs and requirements of specific intended user groups\n• Predict the potential effects for all relevant stakeholders of a design\n• Carry out a design project from concept to working prototype adhering to given\nconstraints\n• Critique a design based on aesthetics and expression\n• Present design proposals to a critical audience\n• Present and document work through both oral and written presentations",
    "Course content": "The course aims at a deepened understanding of central design issues in interaction\ndesign by means of practical training in design projects. In addition to creating working\nprototypes, the course contains lectures, exercises and literature seminars. Design\nprojects are carried out in groups, under supervision. Progress reports and user tests are\nmade several times during the project and the results are presented at a concluding\npublic presentation.",
    "Sub-courses": "",
    "Form of teaching": "Language of instruction: English\nThe course is given in English.",
    "Assessment": "The course is examined by a project.",
    "Grades": "The grading scale comprises: Fail, Pass, Pass with distinction.",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire can be used\nto ensure written information. The outcome of the evaluations serves to improve the\ncourse by indicating which parts could be added, improved, changed or removed.",
    "Additional information": ""
  }
}