{
  "metadata": {
    "source_document": "DIT999.pdf",
    "course_code": "DIT999",
    "course_title": "Interactive storytelling and digital movie making",
    "swedish_title": "Interaktivt berättande och digital filmproduktion",
    "department": "Department of Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design",
    "specialization": "A1N, Second cycle, has only first-cycle\ncourse/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2020-11-03",
    "valid_from_date": "2022-08-29",
    "programmes": [
      "Game Design & Technology Master's Programme (N2GDT)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and\nEngineering on 2020-11-03 and was last revised on 2021-11-19 to be valid from 2022-08-\n29, autumn semester of 2022.",
    "Position in the educational system": "The course can be a part of the programme Game Design & Technology Master's\nprogramme and is offered as a single subject course at Gothenburg university.\nThe course can be part of the following programme: 1) Game Design & Technology\nMaster's Programme (N2GDT)",
    "Entry requirements": "The course is accessible for students who have either\n1. completed 120 hp at a bachelor level in subjects related to IT, art, design, media,\ncommunication or equivalent\" or\n2. equivalent professional experience, defined as being employed or running a private\ncompany for at least two years, with a position and/or work tasks related to art, design,\nmedia, communication or equivalent.\nAlso, it is required to have succesfully completed a course of 7,5 hp in programming.\nApplicants must prove knowledge of English: English 6/English B or the equivalent level\nof an internationally recognized test, for example TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n• explain the relationship, connection and dichotomy between linear and interactive\nstorytelling\n• discuss differences between linear narrative, simulation and interaction, especially\nconcerning interactive storytelling and hybrids between games and movies\n• list and explain aspects of storytelling related to structure, character and emotional\ndrive\n• list and explain technologies for pre-production, production and post-production\n• list and explain technologies for branching and interactive narratives\n• list and explain technologies for virtual reality and immersive video\nCompetence and skills\n• write a script for an engaging and interesting story told visually\n•\nplan for a movie or interactive or immersive narrative production\n• shoot or in other ways create content for a movie or interactive or immersive\nnarrative production\n• edit and in other ways finalize a short movie or interactive or immersive narrative\nproduction\nJudgement and approach\n•\nargue for the pros and cons of linear and interactive storytelling, respectively\n• evaluate and choose different technologies for visual effects and interactive,\nimmersive storytelling",
    "Course content": "Interactive storytelling and digital movie making.",
    "Sub-courses": "1. Project (Projekt), 7.5 credits\nGrading scale: Pass with distinction (5), Pass with credit (4), Pass (3) and Fail (U)",
    "Form of teaching": "The teaching is given in the form of a flipped classroom, using recorded lectures, movie\nand literature seminars, workshops and a group project.",
    "Assessment": "The fullfilment of learning objectives is examined in the form of a short film project, as\nwell as active discussions in movie and literature seminars. The project involves the\ndevelopment of digital moving images, possibly in interactive form. The project is\nassessed based on three perspectives; creative content, appropriate design solution and\ntechnical quality. The project is presented verbally and submitted digitally.\nA student who has taken two exams in a course or part of a course without obtaining a\npass grade is entitled to the nomination of another examiner. The student needs to\ncontact the department for a new examiner, preferably in writing, and this should be\napproved by the department unless there are special reasons to the contrary (Chapter 6\nSection 22 of the Higher Education Ordinance).\nIn the event that a course has ceased or undergone major changes, students are to be\nguaranteed at least three examination sessions (including the ordinary examination\nsession) over a period of at least one year, but no more than two years, after the course\nhas ceased/been changed. The same applies to placements and professional placements\n(VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with distinction (5), Pass with credit (4), Pass (3) and\nFail (U).",
    "Course evaluation": "The course is evaluated through meetings both during and after the course between\nteachers and student representatives. Further, an anonymous questionnaire is used to\nensure written information. The outcome of the evaluations serves to improve the\ncourse by indication which parts could be added, improved, changed or removed.",
    "Additional information": "The course is a joint course together with Chalmers.\nCourse literature to be announced the latest 8 weeks prior to the start of the course."
  }
}