{
  "metadata": {
    "source_document": "DIT911.pdf",
    "course_code": "DIT911",
    "course_title": "Master's Thesis in Data Science",
    "swedish_title": "Masteruppsats i Data Science",
    "department": "Computer Science and Engineering",
    "field_of_education": "Science 100%",
    "credits": "30",
    "cycle": "Second Cycle",
    "main_field_of_study": "Data Science",
    "specialization": "A2E, Second cycle, contains degree project for Master of Arts/Master of Science (120 credits)",
    "language_of_instruction": "English",
    "confirmation_date": "2017-12-19",
    "valid_from_date": "2018-08-19",
    "programmes": [
      "Applied Data Science Master's Programme (N2ADS)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Computer Science and Engineering on 2017-12-19 to be valid from 2018-08-19, autumn semester of 2018.",
    "Position in the educational system": "The course is compulsory within the Applied Data Science Master's Programme.\n\nThe course can be part of the following programme: 1) Applied Data Science Master's Programme (N2ADS)",
    "Entry requirements": "To be eligible for this course, 60 credits of completed courses on the advanced level is required, not counting credits from an earlier, first cycle (Bachelor) degree. At least 30 credits must come from completed courses on the advanced level within the main field of study. A first cycle Bachelor degree is required.\n\nThe subject of the proposed thesis must be within the chosen main field of study and have been approved by the Head of the Programme. The thesis proposal must have been approved by an examiner appointed by the department.\n\nThe examiner decides whether or not the student has the required prerequisites within the subject area to carry out the particular thesis project.",
    "Learning outcomes": "After completion of the course the student should be able to:\n\nKnowledge and understanding\n• give an overview of the most relevant previous research and commonly used methods in the technical field of the thesis project\n\nCompetence and skills\n•\n• plan a project, and carry out the project according to the plan\n• discuss the design and implementation of solutions to problems in the main field of study\npresent and discuss their conclusions, as well as the knowledge and arguments these are based upon, in spoken and written English\n\nJudgement and approach\n• in their project use essential in-depth knowledge of the major subject/field of study and, in a scientifically correct way, relate to current research and development work\n• contribute to research and development work, and be able to relate their work to relevant scientific contexts\n• select and apply resarch-oriented, technical and experimental methods, and motivate these choices\n• analyse and critically evaluate different technical solutions\n• relate their work to relevant technical or industrial contexts\n• based on a holistic view, critically and independently identify, formulate and deal with complex issues\n• critically and systematically integrate knowledge\n• within the framework for the specific project, identify which issues need to be addressed for relevant societal, ethical and ecological factors to be observed\n• observe and discuss ethical aspects of research and development work, both pertaining to how the work is carried out as well as what it explores or develops\n• identify and discuss needs for further elucidation of different project aspects before decision-making or project realisation, when relevant",
    "Course content": "The purpose of a Master's thesis project is to enable the student to develop deeper knowledge, understanding, capabilities and attitudes in the context of the programme of study.\n\nThe thesis project should be carried out at the end of the programme and offers the opportunity to delve more deeply into and synthesise knowledge acquired in previous studies. A thesis for a Master of Science within an area of Computer Science and Engineering should place emphasis on the technical and scientific aspects of the subject matter.\n\nDuring the course, the students investigate an academically interesting problem in the main field of study. The student perform research, theoretical or applied, independently under the supervision of an academic supervisor.",
    "Sub-courses": "",
    "Form of teaching": "Initiation\n• The thesis project is to be carried out by a single student or two students working together.\n• Student(s) write a thesis proposal according to the guidelines of the study programme in their chosen main field of study.\n• The department appoints an examiner for the project. The examiner will ensure that the students meet the requirements for general and specific prerequisites for the thesis and that the proposed topic for the thesis meets the general intended learning outcomes for theses.\n• The Head of the Programme ensures that the thesis falls within the main subject of the Master's programme.\nPlanning\n• The students must write a planning report providing a detailed description of the problem/task. The planning report must contain the background, purpose, objective, scope, method and timetable for completion of the thesis. The planning report is submitted to the examiner for approval.\nSupervision\n• The students are entitled to regular supervision during the course of their work.\nWritten report\n• The thesis report must be written in English.\n• The report must be checked for plagiarism, typically using anti-plagiarism software.\n• The University of Gothenburg's policies regarding open access and confidentiality apply to the work on the thesis and to publishing the report.\n• When two students work jointly on a thesis, the division of the work must be clearly stated in the thesis report.\nOral presentation\n• The oral presentation begins with the students describing their work. This is followed by a defense of their findings, guided by the opposing examiners (other students), and a discussion.\n• The oral presentation must be made in English.\n• At the time of the oral presentation, the written thesis must be completed but not published. This is to make it possible to include viewpoints that arise during the oral presentation to be incorporated into the thesis.\n• The oral presentation, including a defense of the thesis, must be done at the University of Gothenburg. Any additional presentations can be made at a company or other external organisation, if necessary. In exceptional cases, for example, if thesis research has been conducted abroad, the examiner may grant a dispensation from the requirement for an oral presentation, defense of the findings in the thesis and presence at other presentations at the University of Gothenburg.\n• The presentation of the thesis must be announced at the department at least two weeks prior to the date of the presentation.",
    "Assessment": "For a thesis to be approved, the following stages must be completed:\n\n•\nan approved planning report\n•\nan approved thesis report\n•\nan approved presentation and defense of the thesis\n• approved opposition of another thesis\n• attendance of the presentation and defense of two other theses\nIf a student, who has failed the same examined component twice, wishes to change examiner before the next examination, a written application shall be sent to the department responsible for the course and shall be granted unless there are special reasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\n\nIn cases where a course has been discontinued or has undergone major changes, the student shall normally be guaranteed at least three examination occasions (including the ordinary examination) during a period of at least one year from the last time the course was given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).",
    "Course evaluation": "The course is evaluated through meeting after the course between teachers and student representatives. Further, an anonymous questionnaire is used to ensure written information. The outcome of the evaluations serves to improve the course by indicating which parts could be added, improved, changed or removed.",
    "Additional information": "The choice of the course material depends on the chosen project and will be determined jointly by the students and their supervisor at the beginning of the work."
  }
}