{
  "metadata": {
    "source_document": "DIT993.md",
    "course_code": "DIT993",
    "course_title": "Mathematical Modelling and Problem Solving",
    "department": "Department of Computer Science and Engineering",
    "credits": "7.5",
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "1 Sep 2025 - 23 Nov 2025",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-86141"
  },
  "sections": {
    "About": "The course is primarily intended as an introduction to mathematical modelling and problem solving for students with limited experience in the use of mathematics in engineering, but which may come to work in different areas where mathematics is useful.\n\nThe main purpose of the course is to provide the student with the ability to apply the theoretical mathematics to solve problems in science and technology. With application oriented exercises, and by teaching modelling and problem solving techniques, the course then bridges the gap between the theoretical courses in mathematics and relevant applications. The course also includes a broader summary of mathematical thinking.\n\nThe core of the course is a number of application oriented exercises, which are used as a starting point for the student's own learning. The problems have been carefully selected to develop the student's own skills in modelling and solving problems in a investigative way. The exercises illustrate many areas of application and are organized after the man model types.\n\nIn the list below one can find examples indicating the more detailed scope:\n\n- Functions and equations, for example how different mathematical statements can be motivated and how to select and fit functions to empirical data.\n- Optimization models, e.g. mathematical programming in economics and decision support.\n- Dynamic models, e.g. simulation in biology, physics and engineering.\n- Probability models, e.g. stochastic simulation, Markov models for text and Bayesian inference.\n- Discrete models, e.g. graphs and networks for modelling projects and activities, modelling with discrete standard problems and boolean logic, planning.\n- One to two more modules with topics that can change from instance to instance.\n\nWith the exercises as a starting point, we actively teach modelling and problem solving with a supervision style that develops the independence of the student. During lectures, we also discuss different problem solving strategies, reflect on solutions and compare different ways to solve the same problem.\n\nThe course also demonstrates the importance of building mathematical computer models for different kinds of applications.",
    "Entry requirements": "Completed courses to a total of 45 hp are required, including:\n\n- a course in imperative or object oriented programming (DIT012, DIT953 or similar)\n\n- a course in linear algebra (MMG20 or similar)\n\n- a course in mathematical analysis (MMG30 or similar)",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 285 credits",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)\n\nApplication closed, late application opens 15 July 2025.",
    "Additional information": "Last modified: 20 February 2025"
  }
}