{
  "metadata": {
    "source_document": "LT2216.pdf",
    "course_code": "LT2216",
    "course_title": "Dialogue systems",
    "swedish_title": "Dialogsystem",
    "department": "Department of Philosophy, Linguistics and Theory of Science",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Language Technology",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2018-05-29",
    "valid_from_date": "2023-08-28",
    "programmes": [
      "Applied Data Science Master's Programme (N2ADS)",
      "Master in Language Technology (H2LTG)",
      "Master in Language Technology (One year or Two years) (H2MLT)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Philosophy, Linguistics and\nTheory of Science on 2018-05-29 and was last revised on 2023-05-29 to be valid from\n2023-08-28, autumn semester of 2023.",
    "Position in the educational system": "The course can be taken as a free-standing course.\n\nThe course can be part of the following programmes: 1) Applied Data Science Master's\nProgramme (N2ADS), 2) Master in Language Technology (H2LTG) and 3) Master in\nLanguage Technology (One year or Two years) (H2MLT)",
    "Entry requirements": "Admission to the course requires either successful completion of both of the following\ncourses:\n• LT2001 Introduction to programming, 7.5 credits\n• LT2002 Introduction to formal linguistics, 7.5 credits\nor equivalent language technology skills.\nEnglish 6 or equivalent is also required.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\nKnowledge and understanding\n• account for the most common strategies for dialogue management,\n• account for the functionality and limitations of components such as speech\nsynthesis, speech recognition, and natural language understanding,\n• account for the most important methodological principles for development and\nevaluation of dialogue systems,\n• account for theories of human language use in dialogue,\n\nCompetence and skills\n• design, implement and test a dialogue system application for a specific domain,\n• adapt and use speech recognition and natural language components in a dialogue\nsystems application\n• design and implement a dialogue management mechanism for a specific domain\n• design prompts for a text to speech component,\n• perform work according to a predetermined schedule,\n\nJudgement and approach\n• make informed judgements of the theories and technologies that underlie the kinds\nof speech synthesis, speech recognition, natural language understanding, and\ndialogue management components that are discussed in the course - their merits\nand shortcomings.",
    "Course content": "The lectures in the course focus on theories of dialogue management. These are\nconnected to theories of human language use in dialogue, including concepts such as\ndialogue structure, turn-taking and feedback. Part of the course is also spent on\nmethodologies for design and evaluation of dialogue systems.\n\nThe practical part of the course focuses on how to put together components into a\nfunctioning dialogue system, and how to build a dialogue system application by\nadapting such a system to a particular domain.\n\nOther components of dialogue systems such as speech recognition, natural language\nunderstanding, and speech synthesis are also covered.",
    "Sub-courses": "",
    "Form of teaching": "A part of the course is given in the form of lectures, but it is mainly lab- and project\noriented.",
    "Assessment": "The course is assessed through laboratory exercises, project assignments, written and/or\noral exams.\n\nThe grading teacher may request completion of examined student achievements.\n\nStudents are expected to hand in requested materials on time.\n\nA student who has taken two exams in a course or part of a course without obtaining a\npass grade is entitled to the nomination of another examiner. The student needs to\ncontact the department for a new examiner, preferably in writing, and this should be\napproved by the department unless there are special reasons to the contrary (Chapter 6\nSection 22 of the Higher Education Ordinance).\n\nIf a student has received a recommendation from the University of Gothenburg for\nspecial educational support, where it is compatible with the learning outcomes of the\ncourse and provided that no unreasonable resources are required, the examiner may\ndecide to allow the student to sit an adjusted exam or alternative form of assessment.\n\nIn the event that a course has ceased or undergone major changes, students are to be\nguaranteed at least three examination sessions (including the ordinary examination\nsession) over a period of at least one year, but no more than two years, after the course\nhas ceased/been changed. The same applies to placements and professional placements\n(VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).",
    "Course evaluation": "Students participating in, or having completed the course, are given the chance to\nanonymously submit their opinions and suggestions for the course in a course\nevaluation. A short version of the course evaluation, together with the reflections of the\ncourse coordinator, is published and made available to the students within a reasonable\ntime after the course has finished. The next time the course will be given, a short version\nof the course evaluation will be presented together with any implemented measures.",
    "Additional information": "The course may not be included in a degree together with LT2816.\n\nThe course requires access to a computer (or similar) with internet access."
  }
}