{
  "metadata": {
    "source_document": "MMA110.md",
    "course_code": "MMA110",
    "course_title": "Integration Theory",
    "department": "Department of Mathematical Sciences",
    "credits": "7.5",
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "1 Sep 2025 - 4 Nov 2025",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-17008",
    "content_type": "course"
  },
  "sections": {
    "About": "The course treats measure theory and the Lebesgue integral. The Lebesgue integral is more general than the Riemann integral, and it is an important tool in modern analysis since it is easier to integrate limits of functions. Integrals with respect to general measures play an important role in many areas of mathematics and its applications, for example in probability theory and potential theory. The course is one of the first you will take as a graduate student in mathematics.",
    "Entry requirements": "Knowledge equivalent to 90 credits in mathematics.",
    "Selection": "All eligible applicants who have applied before the deadline will be granted a place.",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\n**No fees** are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)",
    "Additional information": "Application closed, late application opens 15 July 2025.\n\nMathematical Sciences is a joint department of Chalmers/University of Gothenburg. Your education takes place in the spacious and bright premises of Mathematical Sciences at the Chalmers campus Johanneberg, where there are lecture halls, computer rooms and group rooms. Here you can also find student lunch room and reading room, as well as student counsellors and student office.\n\n[Maps for Campus Johanneberg](https://maps.chalmers.se/#a85a8be2-4ff6-4e39-9880-c2adb2a7626f)\n\nLast modified 18 February 2025"
  }
}