{
  "metadata": {
    "source_document": "MMA310.md",
    "course_code": "MMA310",
    "course_title": "Galois Theory",
    "department": "Department of Mathematical Sciences",
    "credits": "7.5",
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "3 Nov 2025 - 18 Jan 2026",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-17004",
    "content_type": "course"
  },
  "sections": {
    "About": "In this course you will study polynomial equations over fields, using group theory. Among other things, we will show that there is no general formula with root expressions for the solutions of polynomial equations of degree five. We do this by classifying algebraic extension fields, using the symmetric groups of the fields. As a byproduct, we will determine which of the regular polygons can be constructed with compass and ruler.",
    "Entry requirements": "Knowledge equivalent to 90 credits in mathematics, including the course MMG500 Algebraic Structures.",
    "Selection": "All eligible applicants who have applied before the deadline will be granted a place.",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)",
    "Additional information": "Last modified: 18 February 2025\n\nApplication closed, late application opens 15 July 2025.\n\nFacilities:\nMathematical Sciences is a joint department of Chalmers/University of Gothenburg. Your education takes place in the spacious and bright premises of Mathematical Sciences at the Chalmers campus Johanneberg, where there are lecture halls, computer rooms and group rooms. Here you can also find student lunch room and reading room, as well as student counsellors and student office.\n\n[Maps for Campus Johanneberg](https://maps.chalmers.se/#a85a8be2-4ff6-4e39-9880-c2adb2a7626f)"
  }
}