{
  "metadata": {
    "source_document": "MMA400.md",
    "course_code": "MMA400",
    "course_title": "Applied Functional Analysis",
    "department": "Department of Mathematical Sciences",
    "credits": "7.5",
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "language_of_instruction": "English",
    "duration": "1 Sep 2025 - 4 Nov 2025",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-17009",
    "content_type": "course"
  },
  "sections": {
    "About": "The course is about problems where the variables are not numbers (as in calculus), but functions or more abstract objects. A linear structure where the objects can be added and multiplied with scalars is combined with a geometric/topological structure, where we can measure distances and take limits of the objects.\n\nFunctional analysis arose in the first decades of the 20th century, when mathematicians discovered that methods used to solve integral equations and partial differential equations also could be used in more abstract settings. During the course you will study normed spaces, Banach and Hilbert spaces, fixed-point theorems, compactness, spectral theory for compact self-adjoint maps, the Fredholm alternative, and applications to differential and integral equations.",
    "Entry requirements": "Knowledge equivalent to the couses MMG400 Linear Algebra II and MMG300 Multivariable Analysis.",
    "Selection": "All eligible applicants who have applied before the deadline will be granted a place.",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\n**No fees** are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)\n\nApplication closed, late application opens 15 July 2025.",
    "Additional information": "Last modified: 18 February 2025"
  }
}