{
  "metadata": {
    "source_document": "MSA101.pdf",
    "course_code": "MSA101",
    "course_title": "Computational Methods for Bayesian Statistics",
    "swedish_title": "Beräkningsmetoder för Bayesiansk statistik",
    "department": "Department of Mathematical Sciences",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Mathematical Statistics",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2016-09-23",
    "valid_from_date": "2019-09-02",
    "programmes": [
      "Mathematical Sciences, Master's Programme (N2MAT)",
      "Applied Data Science Master's Programme (N2ADS)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Mathematical Sciences on 2016-09-23 and was last revised on 2019-05-14 to be valid from 2019-09-02, autumn semester of 2019.",
    "Position in the educational system": "The course is part of the Master's Programme in Mathematical Sciences, but it is also open for students outside the program who meet the course prerequisites.\nThe course can be part of the following programmes: 1) Mathematical Sciences, Master's Programme (N2MAT) and 2) Applied Data Science Master's Programme (N2ADS)",
    "Entry requirements": "Basic skills in mathematical statistics corresponding to at least 15 hp, in addition to the course MSG400 Stochastic Data Processing and Simulation.",
    "Learning outcomes": "On successful completion of the course the student will be able to\n• explain and apply a Bayesian approach to probability inference in models of limited complexity\n• implement important computational algorithms for Bayesian inference, for example Metropolis-Hastings MCMC\n• make independent and informed decisions about statistical modeling and computational choices\n• present his or her analysis in a structured and pedagogical way.",
    "Course content": "• Philosophy of Bayesian statistics.\n• Conjugate priors and improper priors.\n• Approximate Bayesian inference for low-dimensional parameter spaces.\n• Basic sampling methods.\n• Monte Carlo integration.\n• The EM algorithm.\n• Advanced sampling methods: Markov chain Monte Carlo, variations and alternatives.\n• Computations for Bayesian Networks.\n• Hierarchical models.\n• Bayesian statistical modelling in practice: Choosing priors, model comparison and model checking, and presenting and communicating results.",
    "Sub-courses": "",
    "Form of teaching": "Lectures and computer based hand-in assignments.",
    "Assessment": "Compulsory computer based hand-in assignments. The grade will be based on a written examination at the end of the course.\n\nIf a student, who has failed the same examined component twice, wishes to change examiner before the next examination, a written application shall be sent to the department responsible for the course and shall be granted unless there are special reasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).",
    "Course evaluation": "Oral and/or written course evaluation will be performed. The results of the evaluation and possible changes to the course will be shared with students who participated in the evaluation and students who are starting the course.",
    "Additional information": "The course MSA101 Computational Methods for Bayesian Statistics has partially the same content as the course MSA100 Computer Intensive Statistical Methods. It is not allowed to be registered and/or examined in more than one of these courses."
  }
}