{
  "metadata": {
    "source_document": "MSA220.pdf",
    "course_code": "MSA220",
    "course_title": "Statistical Learning for Big Data",
    "swedish_title": "Statistisk slutledning för stora datamängder",
    "department": "Department of Mathematical Sciences",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Mathematical Statistics",
    "specialization": "A1N, Second cycle, has only first-cycle\ncourse/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2015-02-27",
    "valid_from_date": "2019-09-02",
    "programmes": [
      "Mathematical Sciences, Master's Programme (N2MAT)",
      "Applied Data Science Master's Programme (N2ADS)"
    ],
    "iteration": "Spring 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "24 Mar 2025 - 8 Jun 2025",
    "application_period": "16 Sep 2024 - 15 Oct 2024",
    "application_code": "GU-17047"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Mathematical Sciences on 2015-\n02-27 and was last revised on 2019-05-14 to be valid from 2019-09-02, autumn semester\nof 2019.",
    "Position in the educational system": "The course can be part of the following programmes: 1) Mathematical Sciences,\nMaster's Programme (N2MAT) and 2) Applied Data Science Master's Programme\n(N2ADS)",
    "Entry requirements": "The prerequisites for the course are a basic course in statistical inference and the course\nMSG500 Linear Statistical Models.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n• demonstrate understanding of the key concepts and ideas concerning classification,\nclustering and dimension reduction.\n• solve high-dimensional data analysis exercises and interpret the results of such\nanalyses.",
    "Course content": "• Overview of high-dimensional data analysis\n• Classification:Bayes rule, discriminant analysis methods, nearest neighbour\nclassifier, classification and regression trees.\n• Cost functions, greedy searches, gradient descent, cross-validation.\n• Logistic regression\n• Regularization methods. Sparse logistic regression, sparse discriminant analysis.\n• Ensemble methods: bagging, random projections, random forests.\n• Clustering: k-means, hierarchical clustering, model-based clustering, spectral\nmethods.\n• Dimension reduction: PCA, canonical correlation, multi-dimensional scaling.\n• Special topics (subset of the following): networks and graphical models, sparse\ncovariance estimation, network clustering and community detection, neural\nnetworks, matrix completion, collaborative filtering.\n• Large-scale learning: stochastic searches, batch-methods, online learning.",
    "Sub-courses": "",
    "Form of teaching": "The teaching is organized with lectures, discussions, and reading assignments.",
    "Assessment": "Oral and/or written examination.\n\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\n\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).",
    "Course evaluation": "The results of and possible changes to the course will be shared with students who\nparticipated in the evaluation and students who are starting the course.",
    "Additional information": "\n\nLast modified: 15 January 2025",
    "Selection": "All eligible applicants who have applied before the deadline will be granted a place.",
    "Tuition": "Full education cost: 15 998 SEK\n\nFirst payment: 15 998 SEK\n\n**No fees** are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)"
  }
}