{
  "metadata": {
    "source_document": "MSA680.pdf",
    "course_code": "MSA680",
    "course_title": "Data science for biomedicine",
    "swedish_title": "Data science för biomedicin",
    "department": "Department of Mathematical Sciences",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Mathematical Statistics",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2021-05-25",
    "valid_from_date": "2021-08-30",
    "programmes": [
      "Mathematical Sciences, Master's Programme (N2MAT)",
      "Applied Data Science Master's Programme (N2ADS)"
    ],
    "iteration": "Spring 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "20 Jan 2025 - 23 Mar 2025",
    "application_period": "16 Sep 2024 - 15 Oct 2024",
    "application_code": "GU-17034"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Mathematical Sciences on 2021-\n05-25 to be valid from 2021-08-30, autumn semester of 2021.\nField of education: Science 100%\nDepartment: Department of Mathematical Sciences",
    "Position in the educational system": "The course can be part of the following programmes: 1) Mathematical Sciences,\nMaster's Programme (N2MAT) and 2) Applied Data Science Master's Programme\n(N2ADS)\nMain field of studies\nMathematical Statistics\nSpecialization\nA1N, Second cycle, has only first-cycle\ncourse/s as entry requirements",
    "Entry requirements": "Knowledge corresponding to at least one of the courses DIT862 Statistical Methods for\nData Science or MSG110 Probability Theory.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n•\nexplain basic experimental design of controlled studies and the use of simulation\nfor complex designs.\n•\nperform appropiate data analysis for the designs covered in the course.\n•\nexplain the mixed models framework for fixed and random effects and\nconduct appropiate statistical analysis of longitudinal data using standard software\n(SAS).\n• recognize hierarchical data structures and perform appropiate statistical analysis\nusing standard software (R)",
    "Course content": "The aim of the course is to provide basic knowledge of models and methods in data\nscience\nfor biomedicine.\nTopics covered by the course are:\n• Introduction to controlled randomised experiments\n• Basic designs and randomisation for controlled experiments\n• Hypothesis testing for efficacy, non-inferiority and bio-equivalence\n•\nSample size calculation\n• Bootstrap, simulation, multiplicity\n• Survival analysis\n• Introduction to linear mixed effects models\n• Estimation for the marginal model\n• Inference for the marginal model\n• Inference for the random effects\n• Fitting mixed models (in SAS)\n• Non-linear mixed models\n• Introduction to hierarchical models\n•\nFitting hierarchical models (in R)",
    "Sub-courses": "",
    "Form of teaching": "Lectures, and computer exercises where SAS and R are used.\nLanguage of instruction: English",
    "Assessment": "The assessment is based on a written exam and mandatory computer exercises.\nA student who has taken two exams in a course or part of a course without obtaining a\npass grade is entitled to the nomination of another examiner. The student needs to\ncontact the department for a new examiner, preferably in writing, and this should be\napproved by the department unless there are special reasons to the contrary (Chapter 6\nSection 22 of the Higher Education Ordinance).\nIf a student has received a recommendation from the University of Gothenburg for\nspecial educational support, where it is compatible with the learning outcomes of the\ncourse and provided that no unreasonable resources are required, the examiner may\ndecide to allow the student to sit an adjusted exam or alternative form of assessment.\nIn the event that a course has ceased or undergone major changes, students are to be\nguaranteed at least three examination sessions (including the ordinary examination\nsession) over a period of at least one year, but no more than two years, after the course\nhas ceased/been changed. The same applies to placements and professional placements\n(VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).",
    "Course evaluation": "At the end of the course the students will be asked to answer a questionnaire. The results\nof the evaluation and possible changes to the course will be shared with students who\nparticipated in the evaluation and students who are starting the course.",
    "Additional information": "\n\nLast modified 16 August 2024",
    "Selection": "All eligible applicants who have applied before the deadline will be granted a place.",
    "Tuition": "Full education cost: 15 998 SEK\nFirst payment: 15 998 SEK\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)"
  }
}