{
  "metadata": {
    "source_document": "MSG500.pdf",
    "course_code": "MSG500",
    "course_title": "Linear Statistical Models",
    "swedish_title": "Linjära statistiska modeller",
    "department": "Department of Mathematical Sciences",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "First Cycle",
    "main_field_of_study": "Mathematical Statistics",
    "specialization": "G1F, First cycle, has less than 60 credits in first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2019-05-17",
    "valid_from_date": "2020-08-31",
    "programmes": [
      "Mathematical Sciences, Master's Programme (N2MAT)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Bachelor's Programme in Mathematics (N1MAT)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Mathematical Sciences on 2019-\n05-17 and was last revised on 2020-01-31 to be valid from 2020-08-31, autumn semester\nof 2020.",
    "Position in the educational system": "The course is part of the Bachelor Program in Mathematical Sciences. It is also open for\nstudents outside the program who meet the course prerequisites.\nThe course can be part of the following programmes: 1) Mathematical Sciences,\nMaster's Programme (N2MAT), 2) Applied Data Science Master's Programme\n(N2ADS) and 3) Bachelor's Programme in Mathematics (N1MAT)",
    "Entry requirements": "For entrance to the course, knowledge corresponding to the courses MSG110\nProbability Theory and MSG200 Statistical Inference is required",
    "Learning outcomes": "On successful completion of the course, the student should be able to\n• explain the common mathematical structure of linear regression models and\ngeneralized linear models\n• construct and use these models for data analysis using statistical inference and\nsuitable software\n• interpret the results and criticize the model limitations\n• identify data analysis situations for which linear models apply naturally and\nto estimate and interpret parameters\n• predict future observations and test hypotheses using suitable software such as R\n• construct regression models that are suitable for the current data but can\nalso generalize to future observations\n• explain the model limitations, identify situations where the hypothesized model is\nnot suitable for the given data, and possibly transform the data to increase the\nmodel predictive ability",
    "Course content": "The course covers the following topics:\n• simple linear and multivariate linear models and underlying assumptions\n• the bias/variance trade-of\n• properties of least squares estimators\n• identification of outliers and the use of residuals and other diagnostics to verify if\nmodel assumptions are met\n• the use of categorical covariates in regression\n• testing parameters using the t-test\n• goodness of fit indices (R2 and adjusted R2)\n• confidence and prediction intervals\n• the multicollinearity problem, its identification and remedial measures\n• Model selection via greedy algorithms (stepwise procedures) and the AIC\n• Model selection via the partial F test\n• Prediction error and cross validation\n• Interaction between covariates\n• an introduction to generalized linear models, the exponential family, and asymptotic\nproperties of the maximum likelihood estimators\n• testing procedures for generalized linear models",
    "Sub-courses": "",
    "Form of teaching": "Lectures; weekly (or almost weekly) mini-projects and presentations",
    "Assessment": "Summary report of the weekly mini-projects; a final project report; a written exam.\nAttendance to the weekly presentations of mini-analyses is mandatory. See the course\npage for how to compensate for missed attendance.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nThe grade levels are Fail (U), Pass (G), and High Pass (VG). Students who are\ncontractually entitled to ECTS grades should inform the examiner about this no later\nthan one week after the start of the course. Students without such entitlement will not be\nawarded ECTS grades. Grades will be converted into ECTS terminology according to a\nstandard model approved by the University President.",
    "Course evaluation": "Written course evaluation will be performed at the end of the course. The results of the\nevaluation will be communicated to the students and will serve as a guide for the\ndevelopment of the course.",
    "Additional information": ""
  }
}