{
  "metadata": {
    "source_document": "TIA161.md",
    "course_code": "TIA161",
    "course_title": "Digital Innovation in Sports",
    "department": "Department of Applied Information Technology",
    "credits": "7.5",
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Mixed time",
    "location": "Göteborg",
    "study_form": "Distance",
    "language_of_instruction": "English",
    "duration": "5 Nov 2025 - 18 Jan 2026",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-87017",
    "content_type": "course"
  },
  "sections": {
    "About": "**Recent years have seen drastic developments in terms of digitalisation in sports. The use of digital technology in sports affects how sports teams are organized and managed, how we gain access to sports information and design new sports equipment. Digitization has also created new sports, such as e-Sports, which have major consequences for the perception of what sports are and how sports are practiced. The development of analytical technology to support performance improvement has also been intensified with the help of digitalisation.**\n\nThis course gives you the opportunity to acquire and apply knowledge about digitalisation in sports as a general societal phenomenon as well as professionalized specialized activities. After the course, you will have the ability to analyze, evaluate and explain how digitalisation affects and develops different sports.\n\n### Online education\n\nThe course is given entirely online. You will have the possibility to participate in the course in a way that suits you. You can either follow the course synchronously, with lectures and seminars online, or take part in the content asynchronously, when you have time. It is also possible to adapt the course pace to your own circumstances. In this way, it is possible to complete the course alongside other activities, such as work or other studies.\n\n### Multiple perspectives\n\nYou will gain insights into how digital technologies have influenced endurance sports such as running, cycling and cross-country skiing, as well as team sports such as football and ice hockey. We will also focus on emerging technologies and platforms.\n\nThe perspectives that will be treated, the literature as well as guest lecturers in the course are chosen based on an effort to offer a breadth of approaches that are inclusive and equal.",
    "Entry requirements": "Bachelor's degree (180 credits). Applicants must prove their knowledge of English: English 6/English B from Swedish Upper Secondary School or the equivalent level of an internationally recognized test, for example TOEFL, IELTS.",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 165 credits.",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)\n\nApplication closed, late application opens 15 July 2025.",
    "Additional information": "Last modified 20 February 2025"
  }
}