{
  "metadata": {
    "source_document": "TIA109.pdf",
    "course_code": "TIA109",
    "course_title": "Information Visualization",
    "swedish_title": "Information Visualization",
    "department": "Dep of Applied Information Technology",
    "field_of_education": "Science 100%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Computer Science-Interaction Design, Interaction Design",
    "specialization": "A1F, Second cycle, has second-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2010-12-21",
    "valid_from_date": "2017-08-20",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Applied Data Science Master's Programme (N2ADS)",
      "Game Design & Technology Master's Programme (N2GDT)",
      "Computer Science, Bachelor's Programme (N1COS)"
    ]
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by The IT Faculty Board on 2010-12-21 and was\nlast revised on 2017-06-16 by Department of Computer Science and Engineering to be\nvalid from 2017-08-20, autumn semester of 2007.",
    "Position in the educational system": "The course is offered as a single subject course.\nThe course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS), 2) Applied Data Science Master's Programme (N2ADS), 3)\nGame Design & Technology Master's Programme (N2GDT) and 4) Computer Science,\nBachelor's Programme (N1COS)",
    "Entry requirements": "To be eligible for the course the student must have a Bachelor degree of 180 credits.\nAdditionally, the course TIG095 Human Computer Interaction 7.5 credits, or the\nequivalent is required. In addition, students need to have successfully completed a\ncourse in Graphical Interfaces (TIA106) 7.5 credits at advanced level.\nTo be eligible for this course as a programme student in Science Bachelors Programme\nNICOS, the student must have passed at least 90 credits in programme courses and the\nadditional courses TIG095 Human Computer Interaction 7.5 credits and Graphical\nInterfaces (TIA106) 7.5 credits at advanced level.",
    "Learning outcomes": "The course aims to give an understanding in how information can be presented to\nprovide efficient and effective knowledge transfer, as well as how to design interactive\nsystems that allow users to easily adapt these presentations depending on task and\ncontext.\nAfter completion of the course the student should be able to\nKnowledge and understanding\n• realize the difference between well-known information visualization techniques,\nincluding the pros and cons they have in respect to types of data, functionality,\nadaptability, and scalability,\n• describe how the cognitive and perceptive abilities of humans affect the possibilities\nof information visualization.\nSkills and abilities\n•\ncreate concepts for information visualizations taking into consideration specific data\nsets, users, technical platforms, and use context,\n• iteratively develop visualizations from early non-functional sketches through mock-\nups to functional prototype making use of user feedback.\nJudgement and approach\n•\ncompare different interactive visualization techniques to evaluate their feasibility for\nboth generic and specific use,\n• analyze and provide creative criticism on specific solutions to visualize information.",
    "Course content": "The course provides an overview on how to design and analyze computer applications,\nbased on knowledge of the human sensory and cognitive system. Screen based as well as\nother types of interactive interfaces, such as auditory and haptic ones, are discussed as\nmeans to efficiently and intelligibly present information. Not only actual applications\nare covered, but also the development of methods to pre-process data and the creation\nof interfaces so users can personalize the information presentations available so it suits\ntheir needs.",
    "Sub-courses": "",
    "Form of teaching": "The course consists of a series of lectures, one exercise, and a project.\nThe course is structured into several different modules, each consisting of reading\nmaterial taken from academic research within one area of visualization and exercises or\nprojects within these areas. The exercises and projects are done in groups with the\nexception of the final individual assignment. Areas covered include specific techniques\nwith information visualization, e.g. data visualization, scientific visualization and virtual\nreality.",
    "Assessment": "The course is examined by means of three modules:\n• Group Work: Design Exercise 1.5 credit (fail/pass)\n•\nDesign Project 2.0 credits (fail/pass)\n• Written Examination 4.0 credits (fail/pass/pass with distinction)\nA student who has failed a test twice has the right to change examiners, if it is possible.\nA written application should be sent to the Department.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\nTo receive a passing grade for the whole course, a student must have a passing mark on\nthe written exam, and both the exercise, and the project. To pass with distinction, a\nstudent must have passed with distinction the written exam and have a passing mark on\nboth the exercise, and the project.",
    "Course evaluation": "After completion of the course the students are to be given the possibility of\nparticipating in course anonymously. Continuous evaluation will be used, including\nthree meetings between teacher(s) and student representatives. Additionally, the course\nwill be evaluated with a course questionnaire, and discussed with the student\nrepresentatives.",
    "Additional information": ""
  }
}