{
  "metadata": {
    "source_document": "TIA241.pdf",
    "course_code": "TIA241",
    "course_title": "Design of children's technology",
    "swedish_title": "Design av teknologi för barn",
    "department": "Dep of Applied Information Technology",
    "field_of_education": "Design 50% and Technology 50%",
    "credits": "7.5",
    "cycle": "Second Cycle",
    "main_field_of_study": "Interaction Design, Computer Science-Interaction Design",
    "specialization": "A1N, Second cycle, has only first-cycle course/s as entry requirements",
    "language_of_instruction": "English",
    "confirmation_date": "2015-06-18",
    "valid_from_date": "2015-09-01",
    "programmes": [
      "Computer Science, Master's Programme (N2COS)",
      "Computer Science, Bachelor's Programme (N1COS)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Confirmation": "This course syllabus was confirmed by Department of Applied Information Technology\non 2015-06-18 to be valid from 2015-09-01, autumn semester of 2015.",
    "Position in the educational system": "The course can be part of the following programmes: 1) Computer Science, Master's\nProgramme (N2COS) and 2) Computer Science, Bachelor's Programme (N1COS)\n\nMain field of studies\nInteraction Design\nComputer Science-Interaction Design\nSpecialization\nA1N, Second cycle, has only first-cycle\ncourse/s as entry requirements\nA1N, Second cycle, has only first-cycle\ncourse/s as entry requirements",
    "Entry requirements": "To be eligible for the course the student must have a Bachelor degree of 180 credits and\nhaving completed the course TIA104 - Interaction design methodology, or the\ncourse TIG095 - Human-Computer Interaction, or similar",
    "Learning outcomes": "On successful completion of the course the student will be able to:\nKnowledge and understanding\n- Describe stages of child development relevant for the design of technologies.\n- Describe a rich set of examples of relevant technologies for children for different aims.\n- Describe a broad set of methods to involve children with different abilities and\ninterests in the design process.\n- Discuss the problems and possibilities of including children in different stages in the\ndesign process.\n- Explain the ethical issues related to designing technologies for and with children.\n\nSkills and abilities\n- Design technology specifically adapted for children.\n- Identify needs and requirements for children and other stakeholders\n- Design with regards to both children and other stakeholders\n- Modify design methods to fit the context and needs of children\n\nJudgement and approach\n- Analyse designs taking into account the needs of children\n- Make an informed evaluation of the ethical and societal impacts of a design\n-Criticize designs and design processes with respect to the needs of children",
    "Course content": "The course explores the intersection between user-centered design, interaction design,\ncritical design, and gameplay design to design artefacts (such as games, toys, social\nrobots) for and with children in different age groups, with different abilities and\ninterests. Plan and execute the design of technologies for children, taking into account\ndifferent ages, abilities, interests, as well as ethical aspects. Moreover, the students\nshould be able to critically reflect on the design process of these technologies.",
    "Sub-courses": null,
    "Form of teaching": "The course consists of a series of lectures combined with assignments in the form or\nprojects, design exercises, written assignments etc.",
    "Assessment": "The course is examined through two modules, namely:\n1.Assignments\n2.One individual exam\n\nIf a student, who has failed the same examined component twice, wishes to change\nexaminer before the next examination, a written application shall be sent to the\ndepartment responsible for the course and shall be granted unless there are special\nreasons to the contrary (Chapter 6, Section 22 of Higher Education Ordinance).\n\nIn cases where a course has been discontinued or has undergone major changes, the\nstudent shall normally be guaranteed at least three examination occasions (including the\nordinary examination) during a period of at least one year from the last time the course\nwas given.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).",
    "Course evaluation": "After completion of the course the students given the opportunity to communicate their\nexperience and views regarding the course anonymously in an electronic questionnaire.\nDuring the course, three course evaluation meetings will be held with teachers and\nstudent representatives.\n\nThe results of and possible changes to the course will be shared with students who\nparticipated in the evaluation and students who are starting the course.",
    "Additional information": null
  }
}