{
  "metadata": {
    "source_document": "TIA345.md",
    "course_code": "TIA345",
    "course_title": "Strategy",
    "swedish_title": "Strategi",
    "department": "Department of Applied Information Technology",
    "credits": "7.5",
    "cycle": "Second cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-11-21",
    "valid_from_date": "Autumn Semester 2024",
    "programmes": [
      "Digital Leadership Master's Programme"
    ],
    "content_type": "course"
  },
  "sections": {
    "Position in the educational system": "The course is a compulsory course in the Digital Leadership Master's Programme.",
    "Entry requirements": "Bachelor’s degree 180 credits including an independent project (degree project) of at least 15 credits or equivalent and English 6/English B from Swedish Upper Secondary School or equivalent.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n_Knowledge and understanding_\n\n- discuss and compare the major approaches to strategy, such as strategic planning, strategy-as-practice, and options thinking;\n- discuss and explain the transition from IT as competitive advantage thinking to digital as a core of the strategy thinking;\n\n_Competence and skills_\n\n- analyze and categorize common digital strategy problems;\n- apply structured approaches to generate solutions to strategic problems in organizations;\n- argue for and against specific strategic approaches based on the context;\n\n_Judgement and approach_\n\n- compare various strategies and their suitability for a specific context;\n- evaluate strategic potential of emergent digital technologies;\n- critically evaluate existing digital strategies.",
    "Course content": "The field of strategy has evolved greatly over the preceding decades, often with new paradigms making the old ones obsolete. Digitalization brings a new set of challenges to the table. Information technology has ascended from a supporting, cost-generating function, to foundation for organizational strategy. This course introduces students to the development of the strategy as a concept and growing role of digital in strategy. The course teaches students to analyze strategic challenges and use structured approaches for addressing them. The course draws on concepts from preceding courses - Technology, Platforms, Infrastructure, Organizing, and Governance - and help students apply these to the strategic analysis. The objective of the Strategy course is to help students connect concepts and theories from the other courses, and use them in creating and analyzing strategies. This course also prepares students for the Project Work II, equipping them with tools to tackle strategic challenges of a case organization.",
    "Sub-courses": "Strategy, 7.5 Credits",
    "Form of teaching": "The course is delivered in form of lectures, student-led seminars, and case discussions. A blend of in-person and online teaching is used. The course aims at delivering extensive formative as well as summative assessment. To this end students are expected to actively participate and contribute to their own and other students' learning.\n\nLanguage of instruction: English",
    "Assessment": "An overall assessment is made based on three components:\n\n- Weekly tasks - Students will be given tasks to complete related to the content of the week.\n- Case reports - Students need to submit case reports, based on the cases discussed during the course. Reports include proposed solutions of the case, as well as reflections on individual learning.\n- Individual written exam.\n\nIf a student who has been failed twice for the same examination element wishes to change examiner before the next examination session, such a request is to be granted unless there are specific reasons to the contrary (Chapter 6 Section 22 HF).\n\nIf a student has received a certificate of disability study support from the University of Gothenburg with a recommendation of adapted examination and/or adapted forms of assessment, an examiner may decide, if this is consistent with the course’s intended learning outcomes and provided that no unreasonable resources would be needed, to grant the student adapted examination and/or adapted forms of assessment.\n\nIf a course has been discontinued or undergone major changes, the student must be offered at least two examination sessions in addition to ordinary examination sessions. These sessions are to be spread over a period of at least one year but no more than two years after the course has been discontinued/changed. The same applies to placement and internship (VFU) except that this is restricted to only one further examination session.\n\nIf a student has been notified that they fulfil the requirements for being a student at Riksidrottsuniversitetet (RIU student), to combine elite sports activities with studies, the examiner is entitled to decide on adaptation of examinations if this is done in accordance with the Local rules regarding RIU students at the University of Gothenburg.",
    "Grades": "The grading scale comprises: Pass (G) and Fail (U). In order to pass the course, students are required to pass each of the three components.",
    "Course evaluation": "After completion of the course the students are to be given the opportunity to participate in a course evaluation electronically. The result of the course evaluation is to be made accessible to the students. The next time the course is given the processed result of the course evaluation is to be presented to the students including possible changes brought about as a result of the course evaluation.",
    "Additional information": ""
  }
}