{
  "metadata": {
    "source_document": "TIA340.md",
    "course_code": "TIA340",
    "course_title": "Governance",
    "swedish_title": "Styrning",
    "department": "Department of Applied Information Technology",
    "credits": "7.5",
    "cycle": "Second cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-11-25",
    "valid_from_date": "Autumn Semester 2024",
    "programmes": [
      "Digital Leadership Master's Programme"
    ],
    "content_type": "course"
  },
  "sections": {
    "Position in the educational system": "The course is a compulsory course in the Digital Leadership Master's Programme.",
    "Entry requirements": "Bachelor’s degree 180 credits including an independent project (degree project) of at least 15 credits or equivalent and English 6/English B from Swedish Upper Secondary School or equivalent.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n_Knowledge and understanding_\n\n- describe the underlying theories associated with governance, control and ambidexterity;\n- describe the terminology and contemporary issues within governance and control for digitalization;\n\n_Competence and skills_\n\n- based on the course literature, independently argue for and against different types of governance and control configurations for digitalization;\n- present and demonstrate the effects of specific governance and control configurations and misdirected governance and control for organizations;\n\n_Judgement and approach_\n\n- evaluate and assess the effects of specific governance and control configurations and misdirected governance and control for businesses.",
    "Course content": "Digitalization brings changes in pre-requisites for governance and control of the organization. As organizations become increasingly dependent upon digital solutions not only to automate administrative support functions but also to transform businessand value models, an integrated governance and control of digitalization becomes a necessity for success. Earlier perspectives on governance and control as stabile, bureaucratic, formalized and not subject to changes over time are contrasted with radically different demands through exponential technological development and dynamic logics. To assure success there is dire need for governance and control for purposive digitalization in organizations and true digital leadership.\n\nThe course offers an introduction to the areas of digitalization, governance, IT governance and management control and highlights issues on how governance and control may be designed and configured to facilitate purposive digitalization. The course is directly aligned with ongoing research at SCDI, where concrete examples and findings from research are integrated into the course. The course builds on previous courses in the program through incorporating concepts related to strategy, platforms, digital materiality and digital infrastructure.\n\nThe course is operationalized through a design project that runs parallel with weekly lectures, discussions, and reports. The design project involves students working in groups to design a mockup and a methodological support for a digital governance solution.",
    "Sub-courses": "Governance, 7.5 Credits",
    "Form of teaching": "The course uses a combination of flipped classroom and student-requested lectures, as well as a combination of reading, supervision, group work, and reporting.\n\nLanguage of instruction: English\n\nThe language of instruction is English, yet group discussions may be conducted in Swedish if all members are proficient in Swedish.",
    "Assessment": "The student is continuously assessed based on active participation in the group design project. If the student is deemed to have been active in the mockup and methodological support, this material is evaluated to determine whether the student has acquired knowledge, ability, and skills in relation to the learning objectives.\n\nIf a student who has been failed twice for the same examination element wishes to change examiner before the next examination session, such a request is to be granted unless there are specific reasons to the contrary (Chapter 6 Section 22 HF).\n\nIf a student has received a certificate of disability study support from the University of Gothenburg with a recommendation of adapted examination and/or adapted forms of assessment, an examiner may decide, if this is consistent with the course’s intended learning outcomes and provided that no unreasonable resources would be needed, to grant the student adapted examination and/or adapted forms of assessment.\n\nIf a course has been discontinued or undergone major changes, the student must be offered at least two examination sessions in addition to ordinary examination sessions. These sessions are to be spread over a period of at least one year but no more than two years after the course has been discontinued/changed. The same applies to placement and internship (VFU) except that this is restricted to only one further examination session.\n\nIf a student has been notified that they fulfil the requirements for being a student at Riksidrottsuniversitetet (RIU student), to combine elite sports activities with studies, the examiner is entitled to decide on adaptation of examinations if this is done in accordance with the Local rules regarding RIU students at the University of Gothenburg.",
    "Grades": "The grading scale comprises: Pass (G) and Fail (U).",
    "Course evaluation": "After completion of the course the students are to be given the opportunity to participate in a course evaluation electronically. The result of the course evaluation is to be made accessible to the students. The next time the course is given the processed result of the course evaluation is to be presented to the students including possible changes brought about as a result of the course evaluation.",
    "Additional information": null
  }
}