{
  "metadata": {
    "source_document": "TIA335.md",
    "course_code": "TIA335",
    "course_title": "Organizing",
    "swedish_title": "Organisering",
    "department": "Department of Applied Information Technology",
    "credits": "7.5",
    "cycle": "Second cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-11-21",
    "valid_from_date": "Autumn Semester 2024",
    "programmes": [
      "the Digital Leadership Master's Programme"
    ]
  },
  "sections": {
    "Position in the educational system": "The course is a compulsory course in the Digital Leadership Master's Programme.",
    "Entry requirements": "Bachelor’s degree 180 credits including an independent project (degree project) of at least 15 credits or equivalent and English 6/English B from Swedish Upper Secondary School or equivalent.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n_Knowledge and understanding_\n\n1. understand the historical paths from organization to organizing and the role of technology in this development;\n\n2. explain the (emergent) relationship between technology and organizing (humans and non-humans);\n\n_Competence and skills_\n\n3. critically evaluate the transformative power of digital technology;\n\n4. analyze different and emergent instantiations of digital organizing;\n\n_Judgement and approach_\n\n5. create design fictions on digital disruptions.",
    "Course content": "New digital technologies not only have implications for individuals and organizations but it also fundamentally change our organizing capacity. Understanding this transformation is critical in digital leadership. The overall aim with this course is to provide the students with a historical backdrop on organization studies, the transformation in perspective from organization to organizing, and the role of digital technologies in this development. The course also introduces the students to the transformative power of digital technologies and how such powers are manifested in new and emergent organizational forms.\n\n## Organizing and Technology\n\nThis sub-course is grounded in research-based insights on different perspectives of technology and organization. It provide knowledge into the disruptive and transformative potential of digital technologies, emergent organizational forms and problematize how to prepare for navigating in this complex digital era. This is a course that will provide research-based insights on digital organizing, transformation and disruption - insights that are of significant importance to individuals, organizations and the society. The sub-course consist of four overall modules:\n\n- Scientific Models of Organization. This module provide a brief introduction and a historical backdrop to some of the existing scientific models of organization. We will discuss the scientific Management Movement, the Human relations School, Tavistock Research School and Postmodernism.\n- Technology and Organizing. This module introduces the students to current theorizing on organizing and digital technologies including sociomateriality and affordances. It will particularly introduce the students to reflect on the entanglements of the human and non-human.\n- Digital Transformation and Disruption. This module focus on the transformative and disruptive powers of digital technologies. It engages in current research on digital transformation and reflect upon the many challenges (individual, organizational and societal) related to these transformations.\n- Institutional Arrangements in Organizing. This module will raise questions related to institutional pressures, logics and legitimacy in digital transformation.\n\n## Design Fictions\n\nThis sub-module is designed as a 24h sprint on design fictions. This is a creative exercise in which the students are expected to analyze and embark on big contemporary issues of digital transformation and disruptions.",
    "Sub-courses": "Quiz, 5 Credits\n\nExercise and Presentation, 2.5 Credits",
    "Form of teaching": "The first four modules include lectures, guest lectures and seminars. Each module will run weekly and will be wrapped up by \"open floor\" discussions. Students are expected to actively engage in discussions as well as take on responsibility for the seminars. The fifth module will be a creative exercise and include workshops and lectures.",
    "Assessment": "Module 1-4 will be assessed by online multiple choice/quiz examinations. These examinations will be weekly, that is there will be one assessment per module. The assessments are intended to capture learning outcome: #1, #2, #3, #4.\n\nModule 5 will be assessed through a creative assignment and oral presentation where students collaboratively develop design fictions rooted in contemporary issues related to digital disruption. This exercise and assessment is related to learning outcome: #5.",
    "Grades": "The grading scale comprises: Pass (G) and Fail (U). For the grade Pass on the course, Pass is required on both sub-courses.",
    "Course evaluation": "After completion of the course the students are to be given the opportunity to participate in a course evaluation electronically. The result of the course evaluation is to be made accessible to the students. The next time the course is given the processed result of the course evaluation is to be presented to the students including possible changes brought about as a result of the course evaluation.",
    "Additional information": "If a student is prevented from taking part in the ordinary examination, the examiner can decide on an alternative form of examination.\n\nIf a student who has been failed twice for the same examination element wishes to change examiner before the next examination session, such a request is to be granted unless there are specific reasons to the contrary (Chapter 6 Section 22 HF).\n\nIf a student has received a certificate of disability study support from the University of Gothenburg with a recommendation of adapted examination and/or adapted forms of assessment, an examiner may decide, if this is consistent with the course’s intended learning outcomes and provided that no unreasonable resources would be needed, to grant the student adapted examination and/or adapted forms of assessment.\n\nIf a course has been discontinued or undergone major changes, the student must be offered at least two examination sessions in addition to ordinary examination sessions. These sessions are to be spread over a period of at least one year but no more than two years after the course has been discontinued/changed. The same applies to placement and internship (VFU) except that this is restricted to only one further examination session.\n\nIf a student has been notified that they fulfil the requirements for being a student at Riksidrottsuniversitetet (RIU student), to combine elite sports activities with studies, the examiner is entitled to decide on adaptation of examinations if this is done in accordance with the Local rules regarding RIU students at the University of Gothenburg."
  }
}