{
  "metadata": {
    "source_document": "TIA320.md",
    "course_code": "TIA320",
    "course_title": "Platforms",
    "swedish_title": "Plattformar",
    "department": "Department of Applied Information Technology",
    "credits": "7.5",
    "cycle": "Second cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-06-10",
    "valid_from_date": "Autumn Semester 2024",
    "programmes": [
      "Digital Leadership Master's Programme (N2DGL)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Position in the educational system": "The course is a compulsory course in Digital Leadership Master's Programme (N2DGL).",
    "Entry requirements": "Bachelor’s degree 180 credits including an independent project (degree project) of at least 15 credits or equivalent and English 6/English B from Swedish Upper Secondary School or equivalent.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n_Knowledge and understanding_\n\n- describe and explain fundamental principles behind digital ecosystems;\n- describe and explain key properties of digital platforms and how these properties shape platforms, organizations and markets;\n- explain the role of data in contemporary digital platforms;\n\n_Competence and skills_\n\n- choose suitable strategies for new and existing digital platforms;\n- choose suitable digital servitization approaches for traditional products and services;\n- assess platformization and servitization potential for traditional products and services;\n\n_Judgement and approach_\n\n- critically appraise impacts of digital platforms on individuals, organizations, industries and society at large;\n- analyze digital ecosystems and recognize roles of various members within an ecosystem;\n- interpret practical examples of platformization in terms of established concepts, frameworks and theories.",
    "Course content": "Capitalizing on the rapid ICT development, and growing digitalization of all aspects of our lives, digital platforms have become dominant. Today, the list of the largest companies is dominated by companies that built their business models around digital platforms. Billions of people interact with at least one digital platform daily (e.g. payment systems, smartphone content markets, social networks, seach engines). While digital platforms have been successful, this success does not come without its challenges to the platform owner and to the society at large.\n\nDigital platforms are at the heart of this course. The course focuses on three major issues: 1) the key developments that enabled proliferation of digital platforms; 2) fundamental mechanisms behind digital platforms, including multi-sided markets, network effects and open innovation; 3) contemporary developments in digital platforms, including platformization impact on the society and growing role of data. The course provides students with skills to analyze, develop and evaluate alternative strategies and approaches for building sustainable digital platforms.\n\nThe course builds on the foundations of the course TIA315 Technology. During the course the students explore how digital technology properties shape digital platfoms. The course also introduces new concepts, such as, digital ecosystems, network effects, platformization, servitization and economies of data.",
    "Sub-courses": "Platforms, 7.5 Credits",
    "Form of teaching": "The course is delivered in form of lectures, seminars, and workshops. A blend of inperson and online teaching is used.\n\nThe course aims at delivering extensive formative as well as summative assessment. To this end students are expected to actively participate and contribute to their own and other students' learning.\n\nLanguage of instruction: English",
    "Assessment": "An overall assessment is made based on three components:\n\n1. Weekly tasks - Students will be given tasks to complete related to the content of the week. The aim of such tasks is to test student knowledge and judgement, and produce input for formative assessment.\n2. Participation in seminars - Every student will be assigned responsibility to organize and facilitate a seminar during the course. Seminars are designed to test students knowledge and understanding, as well as ability to apply said knowledge to the real-life examples. Students will analyze existing platforms, identify challenges, and develop a plan for action to resolve these challenges.\n3. Individual oral exam performed in groups - Students will be tested in groups of 4-5. The exam aims at testing students' knowledge, understanding and ability to make judgements related to the core concepts of the course.\n\nIf a student who has twice received a failing grade for the same examination component wishes to change examiner ahead of the next examination session, such a request should be made to the department in writing and should be approved by the department unless there are special reasons to the contrary (Chapter 6 Section 22 of the Higher Education Ordinance).\n\nIf a student has received a recommendation from the University of Gothenburg for study support for students with disabilities, the examiner may, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources are required, decide to allow the student to sit an adjusted exam or alternative form of assessment.\n\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years after the course has ceased/been changed. The same applies to internships and professional placements (VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass (G) and Fail (U).\n\nIn order to pass the course, students are required to pass each of the three components.",
    "Course evaluation": "After completion of the course the students are to be given the opportunity to participate in a course evaluation electronically. The result of the course evaluation is to be made accessible to the students. The next time the course is given the processed result of the course evaluation is to be presented to the students including possible changes brought about as a result of the course evaluation.",
    "Additional information": "The course cannot be included in a degree together with the course TIA302 Platforms, 7,5 credits."
  }
}