{
  "metadata": {
    "source_document": "TIA505.md",
    "course_code": "TIA505",
    "course_title": "Social Media and Society",
    "swedish_title": "Sociala medier och samhälle",
    "department": "Department of Applied Information Technology",
    "credits": "7.5",
    "cycle": "Second cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-06-10",
    "valid_from_date": "Autumn Semester 2024",
    "programmes": [
      "Master in Communication (N2CMN)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Position in the educational system": "This course is an introductory course in the second-cycle. It is a compulsory course within Master in Communication (N2CMN).",
    "Entry requirements": "A bachelor's degree of 180 credits, of which a minimum of 90 credits in a major subject.\n\nApplicants must have sufficient English language competence: English 6 from SwedishUpper Secondary School or the equivalent level of an internationally recognized test, forexample TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n_Knowledge and understanding_\n\n- demonstrate an understanding of the impact of social media on a variety of social issues;\n\n_Competence and skills_\n\n- analyse the contents, formats and uses of social media, drawing on relevant theories and approaches to do so;\n- apply relevant theories and methods to explore how social media technologies reshape questions of identity, relationship, community and public;\n- systematically conduct, and write up, a research project with well-formulated questions, arguments, analyses and interpretations;\n\n_Judgement and approach_\n\n- critically examine the construction of digital rhetoric in social media;\n- critique the use of social media for news distribution, political engagement, and the communication of science and health, informed by relevant theories and methods.",
    "Course content": "This course examines the relationship between social media and society. The aim is to deepen students’ understanding of how social media shape, and are shaped by, aspects of society. We will draw from a broad range of theoretical perspectives such as digital\n\nrhetoric, media cognition and multimodal communication, to investigate the contents, formats and uses of social media technologies. In particular, the course will explore the relationship between the technical affordances of social media technologies and a user’s identity and social relationships. We will also explore the impact of social media by situating them in the contexts relating to sustainability, disinformation and political engagement, among others.\n\nThrough problem-based learning, students will be provided with the skills to independently approach complex, real-world issues. In the process, they will employ problem-solving methods effectively, systematically present research results and critically evaluate the theoretical and methodological approaches that they adopt. By\n\nthe end of the course, they will be able to envision how emerging technologies and the continuous development of social media could potentially lead to actions for social change.",
    "Sub-courses": "Seminar Discussion, 1 Credits\n\nGroup Presentation, 2 Credits\n\nIndividual Assignment, 4.5 Credits",
    "Form of teaching": "The course education is provided through lectures, workshops. In lectures, the majority of the course content is introduced. In workshops, students are given an opportunity to discuss the issues relating to the theories and methods that are covered in the course.",
    "Assessment": "The course is examined through one group presentation (2 credits), a contribution to a seminar discussion (1 credits), and an individual assignment (4.5 credits).\n\nAttendance to one seminar discussion is mandatory to pass this course. In the seminar, students are required to present topics and content that are essential to undertake the individual assignment. A student who misses the seminar discussion will be required to complete a compensation assignment.\n\nIf a student who has twice received a failing grade for the same examination component wishes to change examiner ahead of the next examination session, such a request should be made to the department in writing and should be approved by the department unless there are special reasons to the contrary (Chapter 6 Section 22 of the Higher Education Ordinance).\n\nIf a student has received a recommendation from the University of Gothenburg for study support for students with disabilities, the examiner may, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources\n\nare required, decide to allow the student to sit an adjusted exam or alternative form of assessment.\n\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years after the course has ceased/been changed. The same applies to internships and professional placements (VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\n\nThe grading scale for the contribution to a seminar discussion is: Fail (U) or Pass (G). The grading scale for the individual assignment is: Fail (U), Pass (G) or Pass with Distinction (VG). The grading scale for the group presentation is: Fail (U), Pass (G) or Pass with Distinction (VG).\n\nTo get a Pass for the whole course, a student should get a Pass (G) for the contribution to the seminar discussion, a Pass (G) for the individual assignment and a Pass (G) for the group presentation. To get a Pass with Distinction (VG) for the whole course, a student should get a Pass with Distinction (VG) for the individual assignment, and a Pass (G) for the contribution to the seminar discussion and for the group presentation.",
    "Course evaluation": "After completion of the course the students are to be given the possibility of participating in a course evaluation anonymously. The processed results of the cours eevaluations are to be made accessible to students and also made available to new students at the beginning of the next course. Possible changes brought about as a result\n\nof course evaluations are to be described.\n\nAdditionally, the course coordinator will conduct a mid-term informal evaluation during the course, which will provide the course coordinator with the opportunity of incorporating students’ feedback in the second half of the course.",
    "Additional information": "This course may not be part of a degree combined with TIA066 Communication: Communication Technology."
  }
}