{
  "metadata": {
    "source_document": "TIA550.md",
    "course_code": "TIA550",
    "course_title": "Digital Rhetorics",
    "swedish_title": "Digital retorik",
    "department": "Department of Applied Information Technology",
    "credits": "7.5",
    "cycle": "Second cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-06-10",
    "valid_from_date": "Autumn Semester 2024",
    "programmes": [
      "Master in Communication (N2CMN)",
      "Human-centered Artificial Intelligence Master's Programme (T2HAI)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Position in the educational system": "The course is an optional course in Master in Communication (N2CMN) and Human-centered Artificial Intelligence Master's Programme (T2HAI).",
    "Entry requirements": "A bachelor's degree of 180 credits, of which a minimum of 90 credits in a major subject.\n\nApplicants must have sufficient English language competence: English 6 from SwedishUpper Secondary School or the equivalent level of an internationally recognized test, forexample TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n_Knowledge and understanding_\n\n- demonstrate understanding of discourse analytical tools that are valuable for analysing persuasion in digital communicative contexts;\n\n_Competence and skills_\n\n- apply basic data-scraping techniques to collect sensible datasets of digital discourse as the basis for an empirical analysis;\n- use big data corpus tools and methods to manage and navigate collected digital data in a motivated manner;\n- apply discourse analytical tools to digital communication in order to inquire about societal challenges relating to digital persuasion (e.g. mis- and dis-information; incivility; political polarisation);\n- demonstrate the ability to rationally debate, negotiate and pursue consensus-seeking solutions to tasks;\n\n_Judgement and approach_\n\n- critically reflect on societal challenges relating to digital persuasion (e.g. mis- and dis-information; incivility; political polarisation) and, from these, propose creative solutions.",
    "Course content": "Persuasion can be defined as intentionally and successfully encouraging another person towards a certain course of action, quite possibly against their will or inclination. Of all communication phenomena, forms of persuasion were the first subject to scholarly study, as far back as ancient times. Such ancient rhetorical accounts were devised when societies were organised in vastly different ways. Today, the largest part of our communication, including persuasion, happens in digital contexts where technology aids communication across geographical and temporal boundaries. While present day questions of persuasion, just as the frameworks for studying them, share something with those of former societies, they are also different from them. The intentional relay of mistruths and acts of bullying persist, though their forms and consequences differ in digital contexts in today’s high-information societies. Other persuasive phenomena (e.g. concerning filter bubbles) are largely consequent from digital environments for communication.\n\nThis course focuses on contemporary discourse analytical methods for studying persuasion that takes place in digital contexts of communication. In addition to phenomena at the heart of ancient rhetorical notions (e.g. the intrinsic proofs, ‘kairos’), opportunities for contemporary digital persuasion are often furnished by, for example: high-remixing, high-visuality, antagonism, information-overload and information-complexity. These raise new versions of important long-standing social questions (e.g. concerning access to – and moderation of – information, of digital literacies, etc.) and entirely new ones as important questions of our time, questions centrally of communication and of persuasion therein. To make exploration of these digital persuasive phenomena and important socio-political questions possible, big-data scraping and big data analysis are taught in this course as prevalent modern-day approaches in the communication sciences to the study of digital discourse.\n\nAt several points in the course and therefore as a special focus of the course, communicative persuasion and the important social questions related to it will be explored with cases concerning climate change.",
    "Sub-courses": "Module 1, 2 Credits\n\nModule 2, 3.5 Credits\n\nModule 3, 2 Credits",
    "Form of teaching": "The course education is provided through lectures and workshops. Lectures are of two types: online lectures, where discourse analytical frameworks will be taught; and in-class lectures, where persuasion in digital communication and questions connected to this will be taught. In-class lectures will usually have a workshop component so that students are given an opportunity to both: (i) practice empirical analysis of digital discourse, and (ii) discuss and debate the important social questions relating to digital persuasion that are covered in the course.",
    "Assessment": "The course is examined through three modules:\n\n- Module 1 (learning objective 1). Online tests to establish proficiency regarding discourse analytic frameworks, 2 credits.\n- Module 2 (learning objectives 2, 3 and 4). An individually written empirical case study into a pertinent digital rhetoric question, 3.5 credits.\n- Module 3 (learning objectives 5 and 6). Presentation of a proposed solution to a contemporary digital persuasion challenge, to a non-academic audience, 2 credits.\n\nFor the individually written empirical case study, students are permitted to supplement a failed assignment, if the examiner deems it possible for the student to achieve a pass grade by means of minor supplementation.\n\nIf a student who has twice received a failing grade for the same examination component wishes to change examiner ahead of the next examination session, such a request should be made to the department in writing and should be approved by the department unless there are special reasons to the contrary (Chapter 6 Section 22 of the Higher Education Ordinance).\n\nIf a student has received a recommendation from the University of Gothenburg for study support for students with disabilities, the examiner may, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources are required, decide to allow the student to sit an adjusted exam or alternative form of assessment.\n\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years after the course has ceased/been changed. The same applies to internships and professional placements (VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\n\nThe grading scale for the set of online tests concerning discourse analytic frameworks is: Fail (U) or Pass (G). The grading scale for the individually written empirical case study is: Fail (U), Pass (G) or Pass with Distinction (VG). The grading scale for the solution proposal presentation is: Fail (U) or Pass (G)\n\nTo get a Pass for the whole course a student should get Pass (G) for the individually written empirical case study, a Pass (G) for the set of online tests concerning discourse analytic frameworks and a Pass (G) for the presentation. To get a Pass with Distinction for the whole course a student should get a Pass with Distinction (VG) for the individually written empirical case study, a Pass (G) for the set of online tests concerning discourse analytic frameworks and a Pass (G) for the presentation.",
    "Course evaluation": "After completion of the course the students are to be given the possibility ofparticipating in a course evaluation anonymously. The results of the evaluation andpossible changes to the course brought about as a result of the course evaluation will beshared with students who participated in the evaluation and new students at thebeginning of the next course.\n\nAdditionally, the course coordinator will conduct a mid-term informal evaluationduring the course, which will provide the course coordinator with the opportunity ofincorporating students’ feedback in the second half of the course.",
    "Additional information": "The use of generative AI tools is not allowed for completing the assignments."
  }
}