{
  "metadata": {
    "source_document": "TIA555.md",
    "course_code": "TIA555",
    "course_title": "Critical Topics in Digital Discourse",
    "swedish_title": "Kritiska perspektiv på digitala diskurser",
    "department": "Department of Applied Information Technology",
    "credits": "7.5",
    "cycle": "Second cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-06-10",
    "valid_from_date": "Autumn Semester 2024",
    "programmes": [
      "Master in Communication (N2CMN)"
    ],
    "iteration": "Autumn 2025",
    "study_pace": "50%",
    "time": "Day",
    "location": "Göteborg",
    "study_form": "Campus",
    "duration": "5 Nov 2025 - 18 Jan 2026",
    "application_period": "17 Mar 2025 - 15 Apr 2025",
    "application_code": "GU-87025"
  },
  "sections": {
    "Position in the educational system": "The course is part of Master in Communication (N2CMN).",
    "Entry requirements": "A bachelor's degree of 180 credits, of which a minimum of 90 credits in a major subject.\n\nApplicants must have sufficient English language competence: English 6 from SwedishUpper Secondary School or the equivalent level of an internationally recognized test, forexample TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n_Knowledge and understanding_\n\n- understand key concepts, developments and problems in current critical debates around digital media;\n\n_Competence and skills_\n\n- analyze a text through a systematic approach to annotation and revision;\n- explain and apply key concepts in critical media/communication studies;\n- formulate innovative critical questions in light of oversights, limits, and ambiguities in academic texts;\n- practice dialogue and open-ended discussion as a method of critical inquiry and intellectual collaboration.",
    "Course content": "This course is dedicated to in-depth reading and debate on current and emerging topics in digital media. Lectures, seminars, and assessments will focus on students developing the ability to understand critical debates on and around digital media and cultivating students’ ability to independently formulate their own critical responses to those debates. Possible topics of reading and discussion include ethics of AI, the role of power in creating biased information systems, environmental impacts of digital infrastructures, and questions of privacy and freedom in online communications.",
    "Sub-courses": "Critical Perspectives in Digital Discourse, 7.5 Credits",
    "Form of teaching": "Lectures, seminars, workshops, group work, case-studies, and exercises in writing and speaking.\n\nLanguage of instruction: English",
    "Assessment": "At the end of the course, students are assessed based on their work during the course, done both individually and in groups, and an individual written reflection. Students are assessed based on a dossier compiling and documenting written and class exercises, supplemented by a critical reflection on findings (7.5 credits).\n\nThis course requires sufficiently regular attendance and engagement in class to complete in-class exercises and group project. If student attendance or participation is infrequent or irregular, the examiner may decide to provide an alternative written examination (e.g., written commentaries on readings and lectures).\n\n**Reassessment**\n\nDossier of reading responses, supplemented by a critical reflection.\n\nIf a student who has twice received a failing grade for the same examination component wishes to change examiner ahead of the next examination session, such a request should be made to the department in writing and should be approved by the department unless there are special reasons to the contrary (Chapter 6 Section 22 of the Higher Education Ordinance).\n\nIf a student has received a recommendation from the University of Gothenburg for study support for students with disabilities, the examiner may, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources are required, decide to allow the student to sit an adjusted exam or alternative form of assessment.\n\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years after the course has ceased/been changed. The same applies to internships and professional placements (VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass (P) and Fail (U) for all assessments.\n\nFor the grade Pass (P) on the course, Pass (P) is required on all assignments.",
    "Course evaluation": "After completion of the course the students are to be given the possibility of participating in a course evaluation anonymously. The results of the evaluation and possible changes to the course brought about as a result of the course evaluation will be shared with students who participated in the evaluation and new students at the beginning of the next course.\n\nAdditionally, the course coordinator will conduct a mid-term informal evaluation during the course, which will provide the course coordinator with the opportunity of incorporating students’ feedback in the second half of the course.",
    "Additional information": "The use of generative AI tools is allowed for completing the written assignments, so long as students document their use of the tool (e.g., a record of prompts and revisions used to complete the assessment).\n\nLast modified\n\n11 March 2025",
    "Selection": "Selection is based upon the number of credits from previous university studies, maximum 165 credits.",
    "Tuition": "Full education cost: 17 753 SEK\n\nFirst payment: 17 753 SEK\n\nNo fees are charged for EU and EEA citizens, Swedish residence permit holders and exchange students.\n\n[More information about tuition fees](https://www.gu.se/en/study-in-gothenburg/apply/tuition-fees)"
  }
}