{
  "metadata": {
    "source_document": "TIA560.md",
    "course_code": "TIA560",
    "course_title": "Project Management for Strategic Communication",
    "swedish_title": "Projektledning för strategisk kommunikation",
    "department": "Department of Applied Information Technology",
    "credits": "7.5",
    "cycle": "Second cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-06-10",
    "valid_from_date": "Autumn Semester 2024",
    "programmes": [
      "Master in Communication (N2CMN)"
    ]
  },
  "sections": {
    "Position in the educational system": "The course is part of Master in Communication (N2CMN).",
    "Entry requirements": "A bachelor's degree of 180 credits, of which a minimum of 90 credits in a major subject.\n\nApplicants must have sufficient English language competence: English 6 from SwedishUpper Secondary School or the equivalent level of an internationally recognized test, forexample TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n_Knowledge and understanding_\n\n- explain key theories, concepts, and perspectives pertinent to the fields of project management and strategic communication;\n- describe relevant soft skills that support the effective development of complex projects;\n\n_Competence and skills_\n\n- independently develop a communication campaign, grounded on approaches and theories in the fields of projects management and strategic communication, in response to a communication need of an organization;\n\n_Judgement and approach_\n\n- critically reflect on specific “lessons learned” on how to develop successful strategic communication campaigns.",
    "Course content": "The aim of the course is to provide students with theoretical and practical knowledge and skills derived from project management that are relevant in the area of strategic communication. Specifically, the course will strengthen students’ ability to plan strategic communication projects in response of an internal and/or external communication need of an organization.\n\nFollowing the principle of authentic assessment, students will be working in teams of “communication agencies” to tackle a complex real-world situation that will involve the development and pitch of a communication campaign in response to a brief of an organization that will serve as the “client.”\n\nDrawing on approaches and theories from project management (with particular reference to the Agile perspective), public relations, corporate communication, management, and leadership studies, the course will both expose students to principles and techniques commonly used by strategic communication professionals and strengthen in the students specific core soft skills (presentation, teamwork, conflict resolution, etc.) for effectively managing complex projects.",
    "Sub-courses": "Module 1, 5 Credits\n\nModule 2, 2.5 Credits",
    "Form of teaching": "Lectures, workshops, case studies, collaborative and problem-based learning.\n\nLanguage of instruction: English",
    "Assessment": "The course is examined through two assignments:\n\n- Module 1 (learning objectives 1 and 3). Group assignment: Developing a strategic communication campaign (oral presentations, written assignment, and seminar participation), 5 credits.\n- Module 2 (learning objectives 1, 2, and 4). Individual assignment: Individual reflection (written assignment), 2.5 credits.\n\nStudents are permitted to supplement a failed assignment if the examiner deems it possible for the student to achieve a pass grade by means of minor supplementation.\n\nAttendance to mandatory sessions is required to pass this course. If a student is unable to attend a mandatory session, the examiner may decide to provide an alternative form of examination.\n\nIf a student who has twice received a failing grade for the same examination component wishes to change examiner ahead of the next examination session, such a request should be made to the department in writing and should be approved by the department unless there are special reasons to the contrary (Chapter 6 Section 22 of the Higher Education Ordinance).\n\nIf a student has received a recommendation from the University of Gothenburg for study support for students with disabilities, the examiner may, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources are required, decide to allow the student to sit an adjusted exam or alternative form of assessment.\n\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years after the course has ceased/been changed. The same applies to internships and professional placements (VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\n\n- Module 1 (group assignment) will be graded Pass (G) or Fail (U).\n- Module 2 (individual assignment) will be graded Pass with Distinction (VG), Pass (G) or Fail (U).\n\nTo get a Pass for the whole course a student should get Pass (G) for both assignments. To get a Pass with Distinction (VG) for the whole course a student should get a Pass (G) for Assignment 1 and a Pass with Distinction (VG) for Assignment 2.",
    "Course evaluation": "After completion of the course the students are to be given the possibility of participating in a course evaluation anonymously. The processed results of the course evaluations are to be made accessible to students and also made available to new students at the beginning of the next course. Possible changes brought about as a result of course evaluations are to be described.\n\nAdditionally, the course coordinator will conduct a mid-term informal evaluation during the course, which will provide the course coordinator with the opportunity of incorporating students’ feedback in the second half of the course.",
    "Additional information": "The use of generative AI tools is not allowed for completing the assignments.\n\nThe course cannot be included in a degree together with the courses TIA085 Communicative Leadership and TIA173 Strategic Communication and Leadership."
  }
}