{
  "metadata": {
    "source_document": "TIA545.md",
    "course_code": "TIA545",
    "course_title": "Technology and Embodied Interaction",
    "swedish_title": "Teknologi och förkroppsligad interaktion",
    "department": "Department of Applied Information Technology",
    "credits": "7.5",
    "cycle": "Second cycle",
    "language_of_instruction": "English",
    "confirmation_date": "2024-06-10",
    "valid_from_date": "Autumn Semester 2024",
    "programmes": [
      "Master in Communication (N2CMN)"
    ],
    "content_type": "course"
  },
  "sections": {
    "Position in the educational system": "The course is an optional course in Master in Communication (N2CMN).",
    "Entry requirements": "A bachelor's degree of 180 credits, of which a minimum of 90 credits in a major subject.\n\nApplicants must have sufficient English language competence: English 6 from SwedishUpper Secondary School or the equivalent level of an internationally recognized test, forexample TOEFL, IELTS.",
    "Learning outcomes": "On successful completion of the course the student will be able to:\n\n_Knowledge and Understanding_\n\n- identify and outline the foundations of embodied interaction as an area of research and development;\n- demonstrate an understanding of the methodological basis of video ethnography and multimodal conversation analysis;\n\n_Competence and Skills_\n\n- transcribe and analyze embodied interaction that includes technology;\n- apply theoretical knowledge in the design of interactive artifacts and activities;\n\n_Judgment and Approach_\n\n- formulate and critically reflect on design implications based on studies of embodied interaction.",
    "Course content": "Our everyday and professional lives are shaped by technology. The development and implementation of technology, therefore, influence how we interact with the world around us. This course directs its interest to the coordinated creation, manipulation, and use of technology through embodied interaction. By emphasizing the embodied nature of human interaction, the interest in phenomena that occur in real-time and physical space is highlighted. The course equips participants with theoretical knowledge and practical skills to understand and analyze embodied interaction with and through technology. Special attention is devoted to the use of video ethnography and multimodal interaction analysis. The course also deals with the relationship between theory, empirical studies, and design.\n\nThe course is organized into three parts: (1) theoretical and methodological approaches to understanding and investigating embodied interaction; (2) practical aspects of analyzing technology and embodied interaction using audiovisual data; (3) the relationship between embodied interaction and the design of technologies.",
    "Sub-courses": "Group Assignment , 2 Credits\n\nDesign Workshop, 2 Credits\n\nIndividual Assignment, 3.5 Credits",
    "Form of teaching": "The course education is provided through lectures, seminars, group work and workshops.\n\nLanguage of instruction: English",
    "Assessment": "The course has three assignments: 1) one group assignment (2 credits); 2) one design workshop (2 credits); and 3) one individual writing assignment (3.5 credits).\n\nAttendance to mandatory sessions are required to pass this course (The design workshops and the group presentation). If a student is unable to attend a mandatory session, the examiner may decide to provide an alternative form of examination.\n\nIf a student who has twice received a failing grade for the same examination component wishes to change examiner ahead of the next examination session, such a request should be made to the department in writing and should be approved by the department unless there are special reasons to the contrary (Chapter 6 Section 22 of the Higher Education Ordinance).\n\nIf a student has received a recommendation from the University of Gothenburg for study support for students with disabilities, the examiner may, where it is compatible with the learning outcomes of the course and provided that no unreasonable resources are required, decide to allow the student to sit an adjusted exam or alternative form of assessment.\n\nIn the event that a course has ceased or undergone major changes, students are to be guaranteed at least three examination sessions (including the ordinary examination session) over a period of at least one year, but no more than two years after the course has ceased/been changed. The same applies to internships and professional placements (VFU), although this is restricted to just one additional examination session.",
    "Grades": "The grading scale comprises: Pass with Distinction (VG), Pass (G) and Fail (U).\n\nThe grading scale for the group assignment and design workshop is: G or U.\n\nThe grading scale for the individual writing assignment is: VG, G or U.\n\nTo get a G for the whole course a student should get G for all parts of the assessment. To get a VG for the whole course a student should get VG for the individual assignment and G for the other parts of the assessment.",
    "Course evaluation": "After completion of the course the students are to be given the possibility of participating in a course evaluation anonymously. The results of the evaluation and possible changes to the course brought about as a result of the course evaluation will beshared with students who participated in the evaluation and new students at the beginning of the next course.\n\nAdditionally, the course coordinator will conduct a mid-term informal evaluationduring the course, which will provide the course coordinator with the opportunity ofincorporating students’ feedback in the second half of the course.",
    "Additional information": ""
  }
}